[Killed] BlockStatement
src/handler.ts:25:73
   body: string;
 }
 
-function createResponse(statusCode: number, body: unknown): ApiResponse {
-  return { statusCode, body: JSON.stringify(body) };
-}
+function createResponse(statusCode: number, body: unknown): ApiResponse {}
 
 function createErrorResponse(error: string): ApiResponse {
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/handler.ts:26:10
 }
 
 function createResponse(statusCode: number, body: unknown): ApiResponse {
-  return { statusCode, body: JSON.stringify(body) };
+  return {};
 }
 
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] BlockStatement
src/handler.ts:29:58
   return { statusCode, body: JSON.stringify(body) };
 }
 
-function createErrorResponse(error: string): ApiResponse {
-  return createResponse(HTTP_STATUS.BAD_REQUEST, { error });
-}
+function createErrorResponse(error: string): ApiResponse {}
 
 function createSuccessResponse(body: unknown): ApiResponse {
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:33:60
   return createResponse(HTTP_STATUS.BAD_REQUEST, { error });
 }
 
-function createSuccessResponse(body: unknown): ApiResponse {
-  return createResponse(HTTP_STATUS.OK, body);
-}
+function createSuccessResponse(body: unknown): ApiResponse {}
 
 function validateText(
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:39:68
 
 function validateText(
   text: unknown,
-): { valid: true; text: string } | { valid: false; error: string } {
-  if (typeof text !== "string" || text === "") {
-    return { valid: false, error: "Text field is required" };
-  }
-  if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
-    return {
-      valid: false,
-      error: `Text is too long (max ${String(TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH)} characters)`,
-    };
-  }
-  return { valid: true, text };
-}
+): { valid: true; text: string } | { valid: false; error: string } {}
 
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "Cannot read properties of undefined (reading 'valid')"

[Killed] ConditionalExpression
src/handler.ts:40:7
 function validateText(
   text: unknown,
 ): { valid: true; text: string } | { valid: false; error: string } {
-  if (typeof text !== "string" || text === "") {
+  if (true) {
     return { valid: false, error: "Text field is required" };
   }
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/handler.ts:40:48
 function validateText(
   text: unknown,
 ): { valid: true; text: string } | { valid: false; error: string } {
-  if (typeof text !== "string" || text === "") {
-    return { valid: false, error: "Text field is required" };
-  }
+  if (typeof text !== "string" || text === "") {}
   if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
     return {
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "Text cannot be empty"

[Killed] BooleanLiteral
src/handler.ts:41:21
   text: unknown,
 ): { valid: true; text: string } | { valid: false; error: string } {
   if (typeof text !== "string" || text === "") {
-    return { valid: false, error: "Text field is required" };
+    return { valid: true, error: "Text field is required" };
   }
   if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "Text cannot be empty"

[Killed] StringLiteral
src/handler.ts:41:35
   text: unknown,
 ): { valid: true; text: string } | { valid: false; error: string } {
   if (typeof text !== "string" || text === "") {
-    return { valid: false, error: "Text field is required" };
+    return { valid: false, error: "" };
   }
   if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: ""

[Killed] ConditionalExpression
src/handler.ts:43:7
   if (typeof text !== "string" || text === "") {
     return { valid: false, error: "Text field is required" };
   }
-  if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
+  if (false) {
     return {
       valid: false,
killedBy: Input Validation should reject text longer than max length (1001)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
src/handler.ts:43:7
   if (typeof text !== "string" || text === "") {
     return { valid: false, error: "Text field is required" };
   }
-  if (text.length > TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH) {
+  if (true) {
     return {
       valid: false,
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
src/handler.ts:49:19
       error: `Text is too long (max ${String(TEXT_LIMITS.MAX_AUDIO_TEXT_LENGTH)} characters)`,
     };
   }
-  return { valid: true, text };
+  return { valid: false, text };
 }
 
killedBy: Lambda Handler - Error Cases should handle S3 errors gracefully
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/handler.ts:52:73
   return { valid: true, text };
 }
 
-function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
-  const bucketName = process.env.BUCKET_NAME ?? "";
-  const queueUrl = process.env.QUEUE_URL ?? "";
-  if (bucketName === "" || queueUrl === "") {
-    throw new Error(
-      "BUCKET_NAME and QUEUE_URL environment variables are required",
-    );
-  }
-  return { bucketName, queueUrl };
-}
+function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {}
 
 export async function handler(
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "BUCKET_NAME"
Received string:    "Cannot destructure property 'bucketName' of 'getRequiredEnvVars(...)' as it is undefined."

[Killed] LogicalOperator
src/handler.ts:53:22
 }
 
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
-  const bucketName = process.env.BUCKET_NAME ?? "";
+  const bucketName = process.env.BUCKET_NAME && "";
   const queueUrl = process.env.QUEUE_URL ?? "";
   if (bucketName === "" || queueUrl === "") {
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
src/handler.ts:53:49
 }
 
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
-  const bucketName = process.env.BUCKET_NAME ?? "";
+  const bucketName = process.env.BUCKET_NAME ?? "Stryker was here!";
   const queueUrl = process.env.QUEUE_URL ?? "";
   if (bucketName === "" || queueUrl === "") {
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] LogicalOperator
src/handler.ts:54:20
 
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
   const bucketName = process.env.BUCKET_NAME ?? "";
-  const queueUrl = process.env.QUEUE_URL ?? "";
+  const queueUrl = process.env.QUEUE_URL && "";
   if (bucketName === "" || queueUrl === "") {
     throw new Error(
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "BUCKET_NAME and QUEUE_URL environment variables are required"

[Killed] ConditionalExpression
src/handler.ts:55:7
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
   const bucketName = process.env.BUCKET_NAME ?? "";
   const queueUrl = process.env.QUEUE_URL ?? "";
-  if (bucketName === "" || queueUrl === "") {
+  if (true) {
     throw new Error(
       "BUCKET_NAME and QUEUE_URL environment variables are required",
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "BUCKET_NAME and QUEUE_URL environment variables are required"

[Killed] ConditionalExpression
src/handler.ts:55:28
 function getRequiredEnvVars(): { bucketName: string; queueUrl: string } {
   const bucketName = process.env.BUCKET_NAME ?? "";
   const queueUrl = process.env.QUEUE_URL ?? "";
-  if (bucketName === "" || queueUrl === "") {
+  if (bucketName === "" || false) {
     throw new Error(
       "BUCKET_NAME and QUEUE_URL environment variables are required",
killedBy: Lambda Handler - Error Cases should return error when QUEUE_URL is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
src/handler.ts:74:28
     const body = JSON.parse(event.body) as RequestBody;
     const validation = validateText(body.text);
 
-    if (!validation.valid) {
-      return createErrorResponse(validation.error);
-    }
+    if (!validation.valid) {}
 
     const text = validation.text;
killedBy: Input Validation should reject empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text field is required"
Received: "Text cannot be empty"

[Killed] LogicalOperator
src/handler.ts:88:42
     if (exists) {
       return createSuccessResponse({
         status: "ready",
-        url: `https://${bucketName}.s3.${process.env.AWS_REGION ?? "eu-west-1"}.amazonaws.com/${key}`,
+        url: `https://${bucketName}.s3.${process.env.AWS_REGION && "eu-west-1"}.amazonaws.com/${key}`,
         hash,
       });
killedBy: Lambda Handler - Cache Hit should have correct URL format with status ready
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://test-bucket.s3.us-east-1.amazonaws.com/cache/2cf24dba5fb0a30e26e83b2ac5b9e29e1b161e5c1fa7425e73043362938b9824.mp3"
Received: "https://test-bucket.s3.eu-west-1.amazonaws.com/cache/2cf24dba5fb0a30e26e83b2ac5b9e29e1b161e5c1fa7425e73043362938b9824.mp3"

[Killed] StringLiteral
src/handler.ts:88:14
     if (exists) {
       return createSuccessResponse({
         status: "ready",
-        url: `https://${bucketName}.s3.${process.env.AWS_REGION ?? "eu-west-1"}.amazonaws.com/${key}`,
+        url: ``,
         hash,
       });
killedBy: Lambda Handler - Cache Hit should return URL when file exists in S3
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test-bucket"
Received string:    ""

[Killed] BlockStatement
src/handler.ts:99:28
       status: "processing",
       hash,
     });
-  } catch (error: unknown) {
-    const errorMessage =
-      error instanceof Error ? error.message : "Unknown error occurred";
-    return createErrorResponse(errorMessage);
-  }
+  } catch (error: unknown) {}
 }
 
killedBy: Lambda Handler - Error Cases should return error when BUCKET_NAME is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[NoCoverage] StringLiteral
src/handler.ts:101:48
     });
   } catch (error: unknown) {
     const errorMessage =
-      error instanceof Error ? error.message : "Unknown error occurred";
+      error instanceof Error ? error.message : "";
     return createErrorResponse(errorMessage);
   }
