[Survived] LogicalOperator
src/index.ts:10:16
 import { handler } from "./handler";
 import { publishWarmMessage } from "./sqs";
 
-const region = process.env.AWS_REGION ?? "eu-west-1";
+const region = process.env.AWS_REGION && "eu-west-1";
 const s3Client = new S3Client({ region });
 const sqsClient = new SQSClient({ region });

[Killed] BlockStatement
src/index.ts:24:71
 function createResponse(
   statusCode: number,
   body: object,
-): { statusCode: number; headers: typeof CORS_HEADERS; body: string } {
-  return {
-    statusCode,
-    headers: { ...CORS_HEADERS },
-    body: JSON.stringify(body),
-  };
-}
+): { statusCode: number; headers: typeof CORS_HEADERS; body: string } {}
 
 export async function lambdaHandler(event: { body: string }): Promise<{
killedBy: Index Lambda Handlers healthHandler should return healthy status
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/index.ts:36:4
   statusCode: number;
   body: string;
   headers: Record<string, string>;
-}> {
-  const response = await handler(event, s3Client, sqsClient);
-  return { ...response, headers: { ...CORS_HEADERS } };
-}
+}> {}
 
 export async function healthHandler(): Promise<{
killedBy: Index Lambda Handlers lambdaHandler should return response with CORS headers
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/index.ts:38:34
   headers: Record<string, string>;
 }> {
   const response = await handler(event, s3Client, sqsClient);
-  return { ...response, headers: { ...CORS_HEADERS } };
+  return { ...response, headers: {} };
 }
 
killedBy: Index Lambda Handlers lambdaHandler should return response with CORS headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*"
Received: undefined

[Killed] BlockStatement
src/index.ts:45:4
   statusCode: number;
   body: string;
   headers: Record<string, string>;
-}> {
-  return createResponse(200, {
-    status: "healthy",
-    service: "audio-api",
-    timestamp: new Date().toISOString(),
-  });
-}
+}> {}
 
 export async function warmHandler(): Promise<{
killedBy: Index Lambda Handlers healthHandler should return healthy status
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/index.ts:46:30
   body: string;
   headers: Record<string, string>;
 }> {
-  return createResponse(200, {
-    status: "healthy",
-    service: "audio-api",
-    timestamp: new Date().toISOString(),
-  });
+  return createResponse(200, {});
 }
 
killedBy: Index Lambda Handlers healthHandler should return healthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: undefined

[Killed] BlockStatement
src/index.ts:57:4
   statusCode: number;
   body: string;
   headers: Record<string, string>;
-}> {
-  const queueUrl = process.env.QUEUE_URL ?? "";
-  if (queueUrl === "") {
-    return createResponse(500, { error: "QUEUE_URL not configured" });
-  }
-
-  try {
-    await publishWarmMessage(sqsClient, queueUrl);
-    return createResponse(200, {
-      status: "warming",
-      message: "Audio worker warm-up triggered",
-      timestamp: new Date().toISOString(),
-    });
-  } catch (error) {
-    return createResponse(500, {
-      error:
-        error instanceof Error ? error.message : "Failed to trigger warm-up",
-    });
-  }
-}
+}> {}
 
 export { lambdaHandler as handler };
killedBy: Index Lambda Handlers warmHandler should return error when QUEUE_URL not configured
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] LogicalOperator
src/index.ts:58:20
   body: string;
   headers: Record<string, string>;
 }> {
-  const queueUrl = process.env.QUEUE_URL ?? "";
+  const queueUrl = process.env.QUEUE_URL && "";
   if (queueUrl === "") {
     return createResponse(500, { error: "QUEUE_URL not configured" });
killedBy: Index Lambda Handlers warmHandler should return error when QUEUE_URL not configured
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] EqualityOperator
src/index.ts:59:7
   headers: Record<string, string>;
 }> {
   const queueUrl = process.env.QUEUE_URL ?? "";
-  if (queueUrl === "") {
+  if (queueUrl !== "") {
     return createResponse(500, { error: "QUEUE_URL not configured" });
   }
killedBy: Index Lambda Handlers warmHandler should return error when QUEUE_URL not configured
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
src/index.ts:59:24
   headers: Record<string, string>;
 }> {
   const queueUrl = process.env.QUEUE_URL ?? "";
-  if (queueUrl === "") {
-    return createResponse(500, { error: "QUEUE_URL not configured" });
-  }
+  if (queueUrl === "") {}
 
   try {
killedBy: Index Lambda Handlers warmHandler should return error when QUEUE_URL not configured
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
src/index.ts:63:7
     return createResponse(500, { error: "QUEUE_URL not configured" });
   }
 
-  try {
-    await publishWarmMessage(sqsClient, queueUrl);
-    return createResponse(200, {
-      status: "warming",
-      message: "Audio worker warm-up triggered",
-      timestamp: new Date().toISOString(),
-    });
-  } catch (error) {
+  try {} catch (error) {
     return createResponse(500, {
       error:
killedBy: Index Lambda Handlers warmHandler should trigger warm-up when QUEUE_URL is configured
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/index.ts:70:19
       message: "Audio worker warm-up triggered",
       timestamp: new Date().toISOString(),
     });
-  } catch (error) {
-    return createResponse(500, {
-      error:
-        error instanceof Error ? error.message : "Failed to trigger warm-up",
-    });
-  }
+  } catch (error) {}
 }
 
killedBy: Index Lambda Handlers warmHandler should handle publishWarmMessage errors with Error instance
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/index.ts:71:32
       timestamp: new Date().toISOString(),
     });
   } catch (error) {
-    return createResponse(500, {
-      error:
-        error instanceof Error ? error.message : "Failed to trigger warm-up",
-    });
+    return createResponse(500, {});
   }
 }
killedBy: Index Lambda Handlers warmHandler should handle publishWarmMessage errors with Error instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SQS error"
Received: undefined

[Killed] StringLiteral
src/index.ts:73:50
   } catch (error) {
     return createResponse(500, {
       error:
-        error instanceof Error ? error.message : "Failed to trigger warm-up",
+        error instanceof Error ? error.message : "",
     });
   }
killedBy: Index Lambda Handlers warmHandler should handle publishWarmMessage errors with non-Error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to trigger warm-up"
Received: ""
