[Killed] ArithmeticOperator
src/handler.ts:8:22
 import * as crypto from 'crypto';
 
 const STATE_COOKIE_NAME = 'tara_auth_state';
-const STATE_TTL_MS = 10 * 60 * 1000; // 10 minutes
+const STATE_TTL_MS = 10 * 60 / 1000; // 10 minutes
 
 function getFrontendUrl(): string {
killedBy: handler.ts mutation kills callbackHandler error message mutations should NOT expire session at exactly 10 minutes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Session+expired+-+please+try+again"

[Killed] ArithmeticOperator
src/handler.ts:8:22
 import * as crypto from 'crypto';
 
 const STATE_COOKIE_NAME = 'tara_auth_state';
-const STATE_TTL_MS = 10 * 60 * 1000; // 10 minutes
+const STATE_TTL_MS = 10 / 60 * 1000; // 10 minutes
 
 function getFrontendUrl(): string {
killedBy: handler.ts mutation kills callbackHandler error message mutations should NOT expire session at exactly 10 minutes
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Session+expired+-+please+try+again"

[Killed] BlockStatement
src/handler.ts:10:35
 const STATE_COOKIE_NAME = 'tara_auth_state';
 const STATE_TTL_MS = 10 * 60 * 1000; // 10 minutes
 
-function getFrontendUrl(): string {
-  const stage = process.env.STAGE || 'dev';
-  return stage === 'prod'
-    ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
-    : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
-}
+function getFrontendUrl(): string {}
 
 function generateRandomString(length: number): string {
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: undefined

[Killed] LogicalOperator
src/handler.ts:11:17
 const STATE_TTL_MS = 10 * 60 * 1000; // 10 minutes
 
 function getFrontendUrl(): string {
-  const stage = process.env.STAGE || 'dev';
+  const stage = process.env.STAGE && 'dev';
   return stage === 'prod'
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: "https://hak-dev.askend-lab.com"

[Killed] ConditionalExpression
src/handler.ts:11:17
 const STATE_TTL_MS = 10 * 60 * 1000; // 10 minutes
 
 function getFrontendUrl(): string {
-  const stage = process.env.STAGE || 'dev';
+  const stage = false;
   return stage === 'prod'
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: "https://hak-dev.askend-lab.com"

[Killed] ConditionalExpression
src/handler.ts:12:10
 
 function getFrontendUrl(): string {
   const stage = process.env.STAGE || 'dev';
-  return stage === 'prod'
+  return true
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
     : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
killedBy: handler.ts mutation kills getFrontendUrl should use dev URL when STAGE=dev
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com"
Received: "https://hak.askend-lab.com"

[Killed] ConditionalExpression
src/handler.ts:12:10
 
 function getFrontendUrl(): string {
   const stage = process.env.STAGE || 'dev';
-  return stage === 'prod'
+  return false
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
     : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: "https://hak-dev.askend-lab.com"

[Killed] ConditionalExpression
src/handler.ts:13:7
 function getFrontendUrl(): string {
   const stage = process.env.STAGE || 'dev';
   return stage === 'prod'
-    ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
+    ? true
     : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
 }
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: true

[Killed] ConditionalExpression
src/handler.ts:13:7
 function getFrontendUrl(): string {
   const stage = process.env.STAGE || 'dev';
   return stage === 'prod'
-    ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
+    ? false
     : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
 }
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak.askend-lab.com"
Received: false

[Killed] ConditionalExpression
src/handler.ts:14:7
   const stage = process.env.STAGE || 'dev';
   return stage === 'prod'
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
-    : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
+    : true;
 }
 
killedBy: handler.ts mutation kills getFrontendUrl should use dev URL when STAGE=dev
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com"
Received: true

[Killed] ConditionalExpression
src/handler.ts:14:7
   const stage = process.env.STAGE || 'dev';
   return stage === 'prod'
     ? process.env.FRONTEND_URL_PROD || 'https://hak.askend-lab.com'
-    : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
+    : false;
 }
 
killedBy: handler.ts mutation kills getFrontendUrl should use dev URL when STAGE=dev
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com"
Received: false

[Killed] BlockStatement
src/handler.ts:17:55
     : process.env.FRONTEND_URL_DEV || 'https://hak-dev.askend-lab.com';
 }
 
-function generateRandomString(length: number): string {
-  return crypto.randomBytes(length).toString('base64url').substring(0, length);
-}
+function generateRandomString(length: number): string {}
 
 function createStateCookie(state: AuthState): string {
killedBy: handler.ts mutation kills startHandler mutations should pass state and nonce to buildAuthorizationUrl
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, Any<String>
Received: undefined, undefined

Number of calls: 1

[Survived] MethodExpression
src/handler.ts:18:10
 }
 
 function generateRandomString(length: number): string {
-  return crypto.randomBytes(length).toString('base64url').substring(0, length);
+  return crypto.randomBytes(length).toString('base64url');
 }
 

[Killed] BlockStatement
src/handler.ts:21:54
   return crypto.randomBytes(length).toString('base64url').substring(0, length);
 }
 
-function createStateCookie(state: AuthState): string {
-  const encoded = Buffer.from(JSON.stringify(state)).toString('base64url');
-  return `${STATE_COOKIE_NAME}=${encoded}; HttpOnly; Secure; SameSite=Lax; Max-Age=600; Path=/`;
-}
+function createStateCookie(state: AuthState): string {}
 
 function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
src/handler.ts:22:63
 }
 
 function createStateCookie(state: AuthState): string {
-  const encoded = Buffer.from(JSON.stringify(state)).toString('base64url');
+  const encoded = Buffer.from(JSON.stringify(state)).toString("");
   return `${STATE_COOKIE_NAME}=${encoded}; HttpOnly; Secure; SameSite=Lax; Max-Age=600; Path=/`;
 }
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/handler.ts:26:79
   return `${STATE_COOKIE_NAME}=${encoded}; HttpOnly; Secure; SameSite=Lax; Max-Age=600; Path=/`;
 }
 
-function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
-  if (!cookieHeader) return null;
-
-  const cookies = cookieHeader.split(';').map(c => c.trim());
-  const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
-  
-  if (!stateCookie) return null;
-
-  try {
-    const encoded = stateCookie.split('=')[1];
-    const decoded = Buffer.from(encoded, 'base64url').toString('utf-8');
-    return JSON.parse(decoded) as AuthState;
-  } catch {
-    return null;
-  }
-}
+function parseStateCookie(cookieHeader: string | undefined): AuthState | null {}
 
 function clearStateCookie(): string {
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] BooleanLiteral
src/handler.ts:27:7
 }
 
 function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
-  if (!cookieHeader) return null;
+  if (cookieHeader) return null;
 
   const cookies = cookieHeader.split(';').map(c => c.trim());
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] ConditionalExpression
src/handler.ts:27:7
 }
 
 function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
-  if (!cookieHeader) return null;
+  if (true) return null;
 
   const cookies = cookieHeader.split(';').map(c => c.trim());
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] MethodExpression
src/handler.ts:29:52
 function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
   if (!cookieHeader) return null;
 
-  const cookies = cookieHeader.split(';').map(c => c.trim());
+  const cookies = cookieHeader.split(';').map(c => c);
   const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
   
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] ArrowFunction
src/handler.ts:29:47
 function parseStateCookie(cookieHeader: string | undefined): AuthState | null {
   if (!cookieHeader) return null;
 
-  const cookies = cookieHeader.split(';').map(c => c.trim());
+  const cookies = cookieHeader.split(';').map(() => undefined);
   const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
   
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Authentication+failed+-+please+try+again"

[Killed] MethodExpression
src/handler.ts:30:41
   if (!cookieHeader) return null;
 
   const cookies = cookieHeader.split(';').map(c => c.trim());
-  const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
+  const stateCookie = cookies.find(c => c.endsWith(`${STATE_COOKIE_NAME}=`));
   
   if (!stateCookie) return null;
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] ArrowFunction
src/handler.ts:30:36
   if (!cookieHeader) return null;
 
   const cookies = cookieHeader.split(';').map(c => c.trim());
-  const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
+  const stateCookie = cookies.find(() => undefined);
   
   if (!stateCookie) return null;
killedBy: TARA Custom Auth Integration Tests callbackHandler - Full Flow should redirect to frontend callback path on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com/auth/callback"
Received: "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] BooleanLiteral
src/handler.ts:32:7
   const cookies = cookieHeader.split(';').map(c => c.trim());
   const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
   
-  if (!stateCookie) return null;
+  if (stateCookie) return null;
 
   try {
killedBy: TARA Custom Auth Integration Tests callbackHandler - Full Flow should redirect to frontend callback path on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com/auth/callback"
Received: "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] ConditionalExpression
src/handler.ts:32:7
   const cookies = cookieHeader.split(';').map(c => c.trim());
   const stateCookie = cookies.find(c => c.startsWith(`${STATE_COOKIE_NAME}=`));
   
-  if (!stateCookie) return null;
+  if (true) return null;
 
   try {
killedBy: TARA Custom Auth Integration Tests callbackHandler - Full Flow should redirect to frontend callback path on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com/auth/callback"
Received: "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] BlockStatement
src/handler.ts:34:7
   
   if (!stateCookie) return null;
 
-  try {
-    const encoded = stateCookie.split('=')[1];
-    const decoded = Buffer.from(encoded, 'base64url').toString('utf-8');
-    return JSON.parse(decoded) as AuthState;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] StringLiteral
src/handler.ts:35:39
   if (!stateCookie) return null;
 
   try {
-    const encoded = stateCookie.split('=')[1];
+    const encoded = stateCookie.split("")[1];
     const decoded = Buffer.from(encoded, 'base64url').toString('utf-8');
     return JSON.parse(decoded) as AuthState;
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Survived] BlockStatement
src/handler.ts:38:11
     const encoded = stateCookie.split('=')[1];
     const decoded = Buffer.from(encoded, 'base64url').toString('utf-8');
     return JSON.parse(decoded) as AuthState;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/handler.ts:43:37
   }
 }
 
-function clearStateCookie(): string {
-  return `${STATE_COOKIE_NAME}=; HttpOnly; Secure; SameSite=Lax; Max-Age=0; Path=/`;
-}
+function clearStateCookie(): string {}
 
 export async function startHandler(
killedBy: handler.ts mutation kills callbackHandler error message mutations should clear state cookie on catch error
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/handler.ts:50:7
 export async function startHandler(
   _event: APIGatewayProxyEvent
 ): Promise<APIGatewayProxyResult> {
-  try {
-    const taraClient = await createTaraClient();
-
-    const state = generateRandomString(32);
-    const nonce = generateRandomString(32);
-    
-    const authState: AuthState = {
-      state,
-      nonce,
-      redirectUri: getFrontendUrl(),
-      createdAt: Date.now(),
-    };
-
-    const authUrl = taraClient.buildAuthorizationUrl(state, nonce);
-
-    return {
-      statusCode: 302,
-      headers: {
-        Location: authUrl,
-        'Set-Cookie': createStateCookie(authState),
-        'Cache-Control': 'no-store',
-      },
-      body: '',
-    };
-  } catch (error) {
+  try {} catch (error) {
     console.error('TARA start error:', error);
     return {
killedBy: handler.ts mutation kills getFrontendUrl should use prod URL when STAGE=prod
statusReason: TypeError: Cannot read properties of undefined (reading 'headers')

[Killed] StringLiteral
src/handler.ts:72:13
         'Set-Cookie': createStateCookie(authState),
         'Cache-Control': 'no-store',
       },
-      body: '',
+      body: "Stryker was here!",
     };
   } catch (error) {
killedBy: handler.ts mutation kills startHandler mutations should have empty body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/handler.ts:74:19
       },
       body: '',
     };
-  } catch (error) {
-    console.error('TARA start error:', error);
-    return {
-      statusCode: 500,
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ error: 'Failed to start TARA authentication' }),
-    };
-  }
+  } catch (error) {}
 }
 
killedBy: startHandler should return 500 when createTaraClient fails
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/handler.ts:76:12
     };
   } catch (error) {
     console.error('TARA start error:', error);
-    return {
-      statusCode: 500,
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ error: 'Failed to start TARA authentication' }),
-    };
+    return {};
   }
 }
killedBy: startHandler should return 500 when createTaraClient fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: undefined

[Killed] StringLiteral
src/handler.ts:79:37
     return {
       statusCode: 500,
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ error: 'Failed to start TARA authentication' }),
+      body: JSON.stringify({ error: "" }),
     };
   }
killedBy: startHandler should return 500 when createTaraClient fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to start TARA authentication"
Received: ""

[Killed] ConditionalExpression
src/handler.ts:90:70
   const frontendUrl = getFrontendUrl();
 
   try {
-    const { code, state: returnedState, error, error_description } = event.queryStringParameters || {};
+    const { code, state: returnedState, error, error_description } = false;
 
     // Handle TARA errors
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Missing+code+or+state"

[Killed] ConditionalExpression
src/handler.ts:90:70
   const frontendUrl = getFrontendUrl();
 
   try {
-    const { code, state: returnedState, error, error_description } = event.queryStringParameters || {};
+    const { code, state: returnedState, error, error_description } = true;
 
     // Handle TARA errors
killedBy: TARA Custom Auth Integration Tests callbackHandler - Full Flow should redirect to frontend callback path on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://hak-dev.askend-lab.com/auth/callback"
Received: "https://hak-dev.askend-lab.com/auth/callback?error=Missing+code+or+state"

[Killed] ConditionalExpression
src/handler.ts:93:9
     const { code, state: returnedState, error, error_description } = event.queryStringParameters || {};
 
     // Handle TARA errors
-    if (error) {
+    if (false) {
       console.error('TARA error:', error, error_description);
       return redirectToFrontend(frontendUrl, { error: error_description || error });
killedBy: handler.ts mutation kills callbackHandler error message mutations should include specific error_description from TARA
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=User+cancelled+auth"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Missing+code+or+state"

[Killed] ConditionalExpression
src/handler.ts:93:9
     const { code, state: returnedState, error, error_description } = event.queryStringParameters || {};
 
     // Handle TARA errors
-    if (error) {
+    if (true) {
       console.error('TARA error:', error, error_description);
       return redirectToFrontend(frontendUrl, { error: error_description || error });
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=undefined"

[Killed] LogicalOperator
src/handler.ts:95:55
     // Handle TARA errors
     if (error) {
       console.error('TARA error:', error, error_description);
-      return redirectToFrontend(frontendUrl, { error: error_description || error });
+      return redirectToFrontend(frontendUrl, { error: error_description && error });
     }
 
killedBy: handler.ts mutation kills callbackHandler error message mutations should include specific error_description from TARA
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=User+cancelled+auth"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=access_denied"

[Killed] ConditionalExpression
src/handler.ts:95:55
     // Handle TARA errors
     if (error) {
       console.error('TARA error:', error, error_description);
-      return redirectToFrontend(frontendUrl, { error: error_description || error });
+      return redirectToFrontend(frontendUrl, { error: true });
     }
 
killedBy: handler.ts mutation kills callbackHandler error message mutations should include specific error_description from TARA
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=User+cancelled+auth"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=true"

[Killed] LogicalOperator
src/handler.ts:98:9
       return redirectToFrontend(frontendUrl, { error: error_description || error });
     }
 
-    if (!code || !returnedState) {
+    if (!code && !returnedState) {
       return redirectToFrontend(frontendUrl, { error: 'Missing code or state' });
     }
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "Missing code or state" error text
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing+code+or+state"
Received string:    "https://hak-dev.askend-lab.com/auth/callback"

[Killed] BooleanLiteral
src/handler.ts:98:9
       return redirectToFrontend(frontendUrl, { error: error_description || error });
     }
 
-    if (!code || !returnedState) {
+    if (code || !returnedState) {
       return redirectToFrontend(frontendUrl, { error: 'Missing code or state' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Missing+code+or+state"

[Killed] ConditionalExpression
src/handler.ts:103:41
     }
 
     // Validate state from cookie
-    const savedState = parseStateCookie(event.headers.Cookie || event.headers.cookie);
+    const savedState = parseStateCookie(false);
     
     if (!savedState) {
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] ConditionalExpression
src/handler.ts:103:41
     }
 
     // Validate state from cookie
-    const savedState = parseStateCookie(event.headers.Cookie || event.headers.cookie);
+    const savedState = parseStateCookie(true);
     
     if (!savedState) {
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Authentication+failed+-+please+try+again"

[Killed] ConditionalExpression
src/handler.ts:105:9
     // Validate state from cookie
     const savedState = parseStateCookie(event.headers.Cookie || event.headers.cookie);
     
-    if (!savedState) {
+    if (true) {
       return redirectToFrontend(frontendUrl, { error: 'Invalid session - please try again' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Invalid+session+-+please+try+again"

[Killed] BooleanLiteral
src/handler.ts:105:9
     // Validate state from cookie
     const savedState = parseStateCookie(event.headers.Cookie || event.headers.cookie);
     
-    if (!savedState) {
+    if (savedState) {
       return redirectToFrontend(frontendUrl, { error: 'Invalid session - please try again' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Authentication+failed+-+please+try+again"

[Killed] ObjectLiteral
src/handler.ts:106:46
     const savedState = parseStateCookie(event.headers.Cookie || event.headers.cookie);
     
     if (!savedState) {
-      return redirectToFrontend(frontendUrl, { error: 'Invalid session - please try again' });
+      return redirectToFrontend(frontendUrl, {});
     }
 
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback"

[Killed] ConditionalExpression
src/handler.ts:109:9
       return redirectToFrontend(frontendUrl, { error: 'Invalid session - please try again' });
     }
 
-    if (savedState.state !== returnedState) {
+    if (true) {
       return redirectToFrontend(frontendUrl, { error: 'State mismatch - possible CSRF attack' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=State+mismatch+-+possible+CSRF+attack"

[Killed] BlockStatement
src/handler.ts:109:45
       return redirectToFrontend(frontendUrl, { error: 'Invalid session - please try again' });
     }
 
-    if (savedState.state !== returnedState) {
-      return redirectToFrontend(frontendUrl, { error: 'State mismatch - possible CSRF attack' });
-    }
+    if (savedState.state !== returnedState) {}
 
     if (Date.now() - savedState.createdAt > STATE_TTL_MS) {
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "State mismatch" error text
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "State+mismatch"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error=Authentication+failed+-+please+try+again"
