[Killed] BlockStatement
src/sqs.ts:16:15
 async function withRetry<T>(
   fn: () => Promise<T>,
   retries = MAX_RETRIES,
-): Promise<T> {
-  for (let attempt = 0; attempt < retries; attempt++) {
-    try {
-      return await fn();
-    } catch (error) {
-      if (attempt === retries - 1) throw error;
-      const delay = BASE_DELAY_MS * Math.pow(2, attempt);
-      await new Promise((resolve) => setTimeout(resolve, delay));
-    }
-  }
-  throw new Error("Retry failed");
-}
+): Promise<T> {}
 
 export async function publishToQueue(
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/sqs.ts:17:25
   fn: () => Promise<T>,
   retries = MAX_RETRIES,
 ): Promise<T> {
-  for (let attempt = 0; attempt < retries; attempt++) {
+  for (let attempt = 0; false; attempt++) {
     try {
       return await fn();
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/sqs.ts:17:55
   fn: () => Promise<T>,
   retries = MAX_RETRIES,
 ): Promise<T> {
-  for (let attempt = 0; attempt < retries; attempt++) {
-    try {
-      return await fn();
-    } catch (error) {
-      if (attempt === retries - 1) throw error;
-      const delay = BASE_DELAY_MS * Math.pow(2, attempt);
-      await new Promise((resolve) => setTimeout(resolve, delay));
-    }
-  }
+  for (let attempt = 0; attempt < retries; attempt++) {}
   throw new Error("Retry failed");
 }
killedBy: SQS Message Publishing should send SQS message with correct payload
statusReason: Error: Retry failed

[Killed] BlockStatement
src/sqs.ts:18:9
   retries = MAX_RETRIES,
 ): Promise<T> {
   for (let attempt = 0; attempt < retries; attempt++) {
-    try {
-      return await fn();
-    } catch (error) {
+    try {} catch (error) {
       if (attempt === retries - 1) throw error;
       const delay = BASE_DELAY_MS * Math.pow(2, attempt);
killedBy: SQS Message Publishing should send SQS message with correct payload
statusReason: Error: Retry failed

[Killed] BlockStatement
src/sqs.ts:20:21
   for (let attempt = 0; attempt < retries; attempt++) {
     try {
       return await fn();
-    } catch (error) {
-      if (attempt === retries - 1) throw error;
-      const delay = BASE_DELAY_MS * Math.pow(2, attempt);
-      await new Promise((resolve) => setTimeout(resolve, delay));
-    }
+    } catch (error) {}
   }
   throw new Error("Retry failed");
killedBy: SQS Message Publishing should handle publish errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Queue not found"
Received message:   "Retry failed"

      83 |       }
      84 |     }
    > 85 |     throw new Error(stryMutAct_9fa48("153") ? "" : (stryCov_9fa48("153"), "Retry failed"));

[Killed] ConditionalExpression
src/sqs.ts:21:11
     try {
       return await fn();
     } catch (error) {
-      if (attempt === retries - 1) throw error;
+      if (false) throw error;
       const delay = BASE_DELAY_MS * Math.pow(2, attempt);
       await new Promise((resolve) => setTimeout(resolve, delay));
killedBy: SQS Message Publishing should handle publish errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Queue not found"
Received message:   "Retry failed"

      83 |       }
      84 |     }
    > 85 |     throw new Error(stryMutAct_9fa48("153") ? "" : (stryCov_9fa48("153"), "Retry failed"));

[Killed] ArithmeticOperator
src/sqs.ts:21:23
     try {
       return await fn();
     } catch (error) {
-      if (attempt === retries - 1) throw error;
+      if (attempt === retries + 1) throw error;
       const delay = BASE_DELAY_MS * Math.pow(2, attempt);
       await new Promise((resolve) => setTimeout(resolve, delay));
killedBy: SQS Message Publishing should handle publish errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Queue not found"
Received message:   "Retry failed"

      83 |       }
      84 |     }
    > 85 |     throw new Error(stryMutAct_9fa48("153") ? "" : (stryCov_9fa48("153"), "Retry failed"));

[Survived] ArithmeticOperator
src/sqs.ts:22:21
       return await fn();
     } catch (error) {
       if (attempt === retries - 1) throw error;
-      const delay = BASE_DELAY_MS * Math.pow(2, attempt);
+      const delay = BASE_DELAY_MS / Math.pow(2, attempt);
       await new Promise((resolve) => setTimeout(resolve, delay));
     }

[Killed] ArrowFunction
src/sqs.ts:23:25
     } catch (error) {
       if (attempt === retries - 1) throw error;
       const delay = BASE_DELAY_MS * Math.pow(2, attempt);
-      await new Promise((resolve) => setTimeout(resolve, delay));
+      await new Promise(() => undefined);
     }
   }
killedBy: SQS Message Publishing should handle publish errors
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/sqs.ts:34:18
   queueUrl: string,
   text: string,
   hash: string,
-): Promise<void> {
-  const command = new SendMessageCommand({
-    QueueUrl: queueUrl,
-    MessageBody: JSON.stringify({ text, hash, timestamp: Date.now() }),
-  });
-  await withRetry(() => sqsClient.send(command));
-}
+): Promise<void> {}
 
 export async function publishWarmMessage(
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ObjectLiteral
src/sqs.ts:35:42
   text: string,
   hash: string,
 ): Promise<void> {
-  const command = new SendMessageCommand({
-    QueueUrl: queueUrl,
-    MessageBody: JSON.stringify({ text, hash, timestamp: Date.now() }),
-  });
+  const command = new SendMessageCommand({});
   await withRetry(() => sqsClient.send(command));
 }
killedBy: SQS Message Publishing should send SQS message with correct payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://sqs.us-east-1.amazonaws.com/123456789/test-queue"
Received: undefined

[Killed] ObjectLiteral
src/sqs.ts:37:33
 ): Promise<void> {
   const command = new SendMessageCommand({
     QueueUrl: queueUrl,
-    MessageBody: JSON.stringify({ text, hash, timestamp: Date.now() }),
+    MessageBody: JSON.stringify({}),
   });
   await withRetry(() => sqsClient.send(command));
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new-phrase"
Received: undefined

[Killed] ArrowFunction
src/sqs.ts:39:19
     QueueUrl: queueUrl,
     MessageBody: JSON.stringify({ text, hash, timestamp: Date.now() }),
   });
-  await withRetry(() => sqsClient.send(command));
+  await withRetry(() => undefined);
 }
 
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/sqs.ts:45:18
 export async function publishWarmMessage(
   sqsClient: SQSClientLike,
   queueUrl: string,
-): Promise<void> {
-  const command = new SendMessageCommand({
-    QueueUrl: queueUrl,
-    MessageBody: JSON.stringify({ type: "warm", timestamp: Date.now() }),
-  });
-  await withRetry(() => sqsClient.send(command));
-}
+): Promise<void> {}
 
killedBy: SQS Warm Message should send warm message with correct payload
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ObjectLiteral
src/sqs.ts:48:33
 ): Promise<void> {
   const command = new SendMessageCommand({
     QueueUrl: queueUrl,
-    MessageBody: JSON.stringify({ type: "warm", timestamp: Date.now() }),
+    MessageBody: JSON.stringify({}),
   });
   await withRetry(() => sqsClient.send(command));
killedBy: SQS Warm Message should send warm message with correct payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warm"
Received: undefined
