[Killed] BlockStatement
src/s3.ts:19:54
   };
 }
 
-function isS3Error(error: unknown): error is S3Error {
-  return (
-    typeof error === "object" &&
-    error !== null &&
-    ("name" in error || "$metadata" in error)
-  );
-}
+function isS3Error(error: unknown): error is S3Error {}
 
 export async function checkFileExists(
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
src/s3.ts:21:5
 
 function isS3Error(error: unknown): error is S3Error {
   return (
-    typeof error === "object" &&
-    error !== null &&
+    typeof error === "object" || error !== null &&
     ("name" in error || "$metadata" in error)
   );
killedBy: S3 Cache Check should throw on non-S3 errors (primitive)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unknown S3 error"
Received message:   "Cannot use 'in' operator to search for 'name' in string-error"

      65 |   } else {
      66 |     stryCov_9fa48("96");

[Killed] LogicalOperator
src/s3.ts:21:5
 
 function isS3Error(error: unknown): error is S3Error {
   return (
-    typeof error === "object" &&
-    error !== null &&
-    ("name" in error || "$metadata" in error)
+    typeof error === "object" && error !== null || "name" in error || "$metadata" in error
   );
 }
killedBy: S3 Cache Check should throw on non-S3 errors (primitive)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unknown S3 error"
Received message:   "Cannot use 'in' operator to search for 'name' in string-error"

      65 |   } else {
      66 |     stryCov_9fa48("96");

[Killed] ConditionalExpression
src/s3.ts:22:5
 function isS3Error(error: unknown): error is S3Error {
   return (
     typeof error === "object" &&
-    error !== null &&
+    true &&
     ("name" in error || "$metadata" in error)
   );
killedBy: S3 Cache Check should throw on null error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unknown S3 error"
Received message:   "Cannot use 'in' operator to search for 'name' in null"

      65 |   } else {
      66 |     stryCov_9fa48("96");

[Killed] EqualityOperator
src/s3.ts:22:5
 function isS3Error(error: unknown): error is S3Error {
   return (
     typeof error === "object" &&
-    error !== null &&
+    error === null &&
     ("name" in error || "$metadata" in error)
   );
killedBy: Lambda Handler - Cache Miss should send SQS message when file not in S3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] LogicalOperator
src/s3.ts:23:6
   return (
     typeof error === "object" &&
     error !== null &&
-    ("name" in error || "$metadata" in error)
+    ("name" in error && "$metadata" in error)
   );
 }
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] ConditionalExpression
src/s3.ts:23:6
   return (
     typeof error === "object" &&
     error !== null &&
-    ("name" in error || "$metadata" in error)
+    (true)
   );
 }

[Killed] BlockStatement
src/s3.ts:32:7
   bucket: string,
   key: string,
 ): Promise<boolean> {
-  try {
-    const command = new HeadObjectCommand({
-      Bucket: bucket,
-      Key: key,
-    });
-    await s3Client.send(command);
-    return true;
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     if (!isS3Error(error)) {
       throw new Error(`Unknown S3 error: ${String(error)}`);
killedBy: Lambda Handler - Cache Hit should return URL when file exists in S3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ready"
Received: "processing"

[Killed] BooleanLiteral
src/s3.ts:38:12
       Key: key,
     });
     await s3Client.send(command);
-    return true;
+    return false;
   } catch (error: unknown) {
     if (!isS3Error(error)) {
killedBy: S3 Cache Check should return true when file exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/s3.ts:40:9
     await s3Client.send(command);
     return true;
   } catch (error: unknown) {
-    if (!isS3Error(error)) {
+    if (true) {
       throw new Error(`Unknown S3 error: ${String(error)}`);
     }
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/s3.ts:40:9
     await s3Client.send(command);
     return true;
   } catch (error: unknown) {
-    if (!isS3Error(error)) {
+    if (false) {
       throw new Error(`Unknown S3 error: ${String(error)}`);
     }
killedBy: S3 Cache Check should throw on non-S3 errors (primitive)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unknown S3 error"
Received message:   "S3 error: {\"bucket\":\"test-bucket\",\"key\":\"key\"}"

      120 |           key
      121 |         }));
    > 122 |         throw new Error(stryMutAct_9fa48("138") ? `` : (stryCov_9fa48("138"), `S3 error: ${errorDetails}`));

[Killed] OptionalChaining
src/s3.ts:44:24
       throw new Error(`Unknown S3 error: ${String(error)}`);
     }
     const s3Error = error;
-    const statusCode = s3Error.$metadata?.httpStatusCode;
+    const statusCode = s3Error.$metadata.httpStatusCode;
     const errorName = s3Error.name;
     const errorMessage = s3Error.message;
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
src/s3.ts:51:7
 
     const NOT_FOUND_STATUS = 404;
     if (
-      errorName === "NotFound" ||
-      errorName === "NoSuchKey" ||
+      errorName === "NotFound" && errorName === "NoSuchKey" ||
       statusCode === NOT_FOUND_STATUS
     ) {
killedBy: Input Validation should accept text at exactly max length (1000)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
src/s3.ts:51:7
 
     const NOT_FOUND_STATUS = 404;
     if (
-      errorName === "NotFound" ||
+      errorName !== "NotFound" ||
       errorName === "NoSuchKey" ||
       statusCode === NOT_FOUND_STATUS
killedBy: S3 Cache Check should return false when file does not exist
statusReason: Error: S3 error: {"name":"NotFound","message":"Not Found","bucket":"test-bucket","key":"cache/abc123.mp3"}

[Killed] ConditionalExpression
src/s3.ts:52:7
     const NOT_FOUND_STATUS = 404;
     if (
       errorName === "NotFound" ||
-      errorName === "NoSuchKey" ||
+      false ||
       statusCode === NOT_FOUND_STATUS
     ) {
killedBy: S3 Cache Check should return false for NoSuchKey error
statusReason: Error: S3 error: {"name":"NoSuchKey","bucket":"test-bucket","key":"key"}

[Killed] EqualityOperator
src/s3.ts:52:7
     const NOT_FOUND_STATUS = 404;
     if (
       errorName === "NotFound" ||
-      errorName === "NoSuchKey" ||
+      errorName !== "NoSuchKey" ||
       statusCode === NOT_FOUND_STATUS
     ) {
killedBy: S3 Cache Check should throw error on connection errors
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: false

[Killed] EqualityOperator
src/s3.ts:53:7
     if (
       errorName === "NotFound" ||
       errorName === "NoSuchKey" ||
-      statusCode === NOT_FOUND_STATUS
+      statusCode !== NOT_FOUND_STATUS
     ) {
       return false;
killedBy: S3 Cache Check should throw error on connection errors
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: false

[Killed] ConditionalExpression
src/s3.ts:53:7
     if (
       errorName === "NotFound" ||
       errorName === "NoSuchKey" ||
-      statusCode === NOT_FOUND_STATUS
+      false
     ) {
       return false;
killedBy: S3 Cache Check should return false for 404 status code
statusReason: Error: S3 error: {"name":"SomeError","statusCode":404,"bucket":"test-bucket","key":"key"}

[Killed] BlockStatement
src/s3.ts:54:7
       errorName === "NotFound" ||
       errorName === "NoSuchKey" ||
       statusCode === NOT_FOUND_STATUS
-    ) {
-      return false;
-    }
+    ) {}
     const errorDetails = JSON.stringify({
       name: errorName,
killedBy: S3 Cache Check should return false when file does not exist
statusReason: Error: S3 error: {"name":"NotFound","message":"Not Found","bucket":"test-bucket","key":"cache/abc123.mp3"}
