[Killed] EqualityOperator
src/handler.ts:113:9
       return redirectToFrontend(frontendUrl, { error: 'State mismatch - possible CSRF attack' });
     }
 
-    if (Date.now() - savedState.createdAt > STATE_TTL_MS) {
+    if (Date.now() - savedState.createdAt <= STATE_TTL_MS) {
       return redirectToFrontend(frontendUrl, { error: 'Session expired - please try again' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Session+expired+-+please+try+again"

[Killed] ArithmeticOperator
src/handler.ts:113:9
       return redirectToFrontend(frontendUrl, { error: 'State mismatch - possible CSRF attack' });
     }
 
-    if (Date.now() - savedState.createdAt > STATE_TTL_MS) {
+    if (Date.now() + savedState.createdAt > STATE_TTL_MS) {
       return redirectToFrontend(frontendUrl, { error: 'Session expired - please try again' });
     }
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "error="
Received string:        "https://hak-dev.askend-lab.com/auth/callback?error=Session+expired+-+please+try+again"

[Killed] StringLiteral
src/handler.ts:114:55
     }
 
     if (Date.now() - savedState.createdAt > STATE_TTL_MS) {
-      return redirectToFrontend(frontendUrl, { error: 'Session expired - please try again' });
+      return redirectToFrontend(frontendUrl, { error: "" });
     }
 
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "Session expired" error text with > operator
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Session+expired"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error="

[Killed] ObjectLiteral
src/handler.ts:114:46
     }
 
     if (Date.now() - savedState.createdAt > STATE_TTL_MS) {
-      return redirectToFrontend(frontendUrl, { error: 'Session expired - please try again' });
+      return redirectToFrontend(frontendUrl, {});
     }
 
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "Session expired" error text with > operator
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Session+expired"
Received string:    "https://hak-dev.askend-lab.com/auth/callback"

[Killed] BlockStatement
src/handler.ts:136:19
     // Redirect to frontend with tokens in HttpOnly cookies
     return redirectToFrontendWithCookies(frontendUrl, cognitoTokens);
 
-  } catch (error) {
-    console.error('TARA callback error:', error);
-    return redirectToFrontend(frontendUrl, { 
-      error: 'Authentication failed - please try again' 
-    }, clearStateCookie());
-  }
+  } catch (error) {}
 }
 
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "Authentication failed" on catch error
statusReason: TypeError: Cannot read properties of undefined (reading 'headers')

[Survived] StringLiteral
src/handler.ts:137:19
     return redirectToFrontendWithCookies(frontendUrl, cognitoTokens);
 
   } catch (error) {
-    console.error('TARA callback error:', error);
+    console.error("", error);
     return redirectToFrontend(frontendUrl, { 
       error: 'Authentication failed - please try again' 

[Killed] StringLiteral
src/handler.ts:139:14
   } catch (error) {
     console.error('TARA callback error:', error);
     return redirectToFrontend(frontendUrl, { 
-      error: 'Authentication failed - please try again' 
+      error: "" 
     }, clearStateCookie());
   }
killedBy: handler.ts mutation kills callbackHandler error message mutations should include "Authentication failed" on catch error
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Authentication+failed"
Received string:    "https://hak-dev.askend-lab.com/auth/callback?error="

[Killed] BlockStatement
src/handler.ts:148:26
   baseUrl: string,
   params: Record<string, string>,
   setCookie?: string
-): APIGatewayProxyResult {
-  const url = new URL('/auth/callback', baseUrl);
-  Object.entries(params).forEach(([key, value]) => {
-    url.searchParams.set(key, value);
-  });
-
-  const headers: Record<string, string> = {
-    Location: url.toString(),
-    'Cache-Control': 'no-store',
-  };
-
-  if (setCookie) {
-    headers['Set-Cookie'] = setCookie;
-  }
-
-  return {
-    statusCode: 302,
-    headers,
-    body: '',
-  };
-}
+): APIGatewayProxyResult {}
 
 function redirectToFrontendWithCookies(
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:150:52
   setCookie?: string
 ): APIGatewayProxyResult {
   const url = new URL('/auth/callback', baseUrl);
-  Object.entries(params).forEach(([key, value]) => {
-    url.searchParams.set(key, value);
-  });
+  Object.entries(params).forEach(([key, value]) => {});
 
   const headers: Record<string, string> = {
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with no tara_auth_state
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "error=Invalid+session"
Received string:    "https://hak-dev.askend-lab.com/auth/callback"

[Killed] BlockStatement
src/handler.ts:159:18
     'Cache-Control': 'no-store',
   };
 
-  if (setCookie) {
-    headers['Set-Cookie'] = setCookie;
-  }
+  if (setCookie) {}
 
   return {
killedBy: handler.ts mutation kills callbackHandler error message mutations should clear state cookie on catch error
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/handler.ts:159:7
     'Cache-Control': 'no-store',
   };
 
-  if (setCookie) {
+  if (false) {
     headers['Set-Cookie'] = setCookie;
   }
killedBy: handler.ts mutation kills callbackHandler error message mutations should clear state cookie on catch error
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/handler.ts:177:25
   const url = new URL('/auth/callback', baseUrl);
   
   // Token cookies - HttpOnly, Secure, SameSite=Strict
-  const cookieOptions = 'HttpOnly; Secure; SameSite=Strict; Path=/';
+  const cookieOptions = "";
   const maxAge = tokens.expiresIn;
   const refreshMaxAge = 30 * 24 * 60 * 60; // 30 days for refresh token
killedBy: handler.ts mutation kills redirectToFrontendWithCookies mutations should set access_token cookie with correct value and max-age
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "SameSite=Strict"
Received string:    "access_token=acc-tok; ; Max-Age=7200"

[Killed] ArithmeticOperator
src/handler.ts:179:25
   // Token cookies - HttpOnly, Secure, SameSite=Strict
   const cookieOptions = 'HttpOnly; Secure; SameSite=Strict; Path=/';
   const maxAge = tokens.expiresIn;
-  const refreshMaxAge = 30 * 24 * 60 * 60; // 30 days for refresh token
+  const refreshMaxAge = 30 / 24 * 60 * 60; // 30 days for refresh token
 
   const cookies = [
killedBy: handler.ts mutation kills redirectToFrontendWithCookies mutations should set refresh_token cookie with 30-day max-age
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Max-Age=2592000"
Received string:    "refresh_token=ref-tok; HttpOnly; Secure; SameSite=Strict; Path=/; Max-Age=4500"

[Killed] ArithmeticOperator
src/handler.ts:179:25
   // Token cookies - HttpOnly, Secure, SameSite=Strict
   const cookieOptions = 'HttpOnly; Secure; SameSite=Strict; Path=/';
   const maxAge = tokens.expiresIn;
-  const refreshMaxAge = 30 * 24 * 60 * 60; // 30 days for refresh token
+  const refreshMaxAge = 30 * 24 / 60 * 60; // 30 days for refresh token
 
   const cookies = [
killedBy: handler.ts mutation kills redirectToFrontendWithCookies mutations should set refresh_token cookie with 30-day max-age
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Max-Age=2592000"
Received string:    "refresh_token=ref-tok; HttpOnly; Secure; SameSite=Strict; Path=/; Max-Age=720"

[Killed] StringLiteral
src/handler.ts:182:5
   const refreshMaxAge = 30 * 24 * 60 * 60; // 30 days for refresh token
 
   const cookies = [
-    `access_token=${tokens.accessToken}; ${cookieOptions}; Max-Age=${maxAge}`,
+    ``,
     `id_token=${tokens.idToken}; ${cookieOptions}; Max-Age=${maxAge}`,
     `refresh_token=${tokens.refreshToken}; ${cookieOptions}; Max-Age=${refreshMaxAge}`,
killedBy: handler.ts mutation kills redirectToFrontendWithCookies mutations should set access_token cookie with correct value and max-age
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/handler.ts:184:5
   const cookies = [
     `access_token=${tokens.accessToken}; ${cookieOptions}; Max-Age=${maxAge}`,
     `id_token=${tokens.idToken}; ${cookieOptions}; Max-Age=${maxAge}`,
-    `refresh_token=${tokens.refreshToken}; ${cookieOptions}; Max-Age=${refreshMaxAge}`,
+    ``,
     // is_authenticated is NOT HttpOnly so frontend JS can check auth state
     `is_authenticated=true; Secure; SameSite=Strict; Path=/; Max-Age=${maxAge}`,
killedBy: handler.ts mutation kills redirectToFrontendWithCookies mutations should set refresh_token cookie with 30-day max-age
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
src/handler.ts:190:10
     clearStateCookie(),
   ];
 
-  return {
-    statusCode: 302,
-    headers: {
-      Location: url.toString(),
-      'Cache-Control': 'no-store',
-    },
-    multiValueHeaders: {
-      'Set-Cookie': cookies,
-    },
-    body: '',
-  };
+  return {};
 }
 
killedBy: handler.ts mutation kills parseStateCookie mutations should handle cookie header with semicolons correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 302
Received: undefined
