[Killed] ConditionalExpression
src/tara-client.ts:11:18
 }
 
 export async function createTaraClient(): Promise<TaraClient> {
-  const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
+  const issuer = false;
   const clientId = process.env.TARA_CLIENT_ID || '';
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
killedBy: createTaraClient should create a client object with all methods
statusReason: TypeError: Invalid URL

[Killed] ConditionalExpression
src/tara-client.ts:11:18
 }
 
 export async function createTaraClient(): Promise<TaraClient> {
-  const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
+  const issuer = true;
   const clientId = process.env.TARA_CLIENT_ID || '';
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
killedBy: createTaraClient should create a client object with all methods
statusReason: TypeError: Invalid URL

[Killed] ConditionalExpression
src/tara-client.ts:12:20
 
 export async function createTaraClient(): Promise<TaraClient> {
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
-  const clientId = process.env.TARA_CLIENT_ID || '';
+  const clientId = true;
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
   const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "client_id=test-client-id"
Received string:    "https://tara-test.ria.ee/oidc/authorize?response_type=code&client_id=true&redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback&scope=openid&state=my-state&nonce=my-nonce&ui_locales=et"

[Killed] LogicalOperator
src/tara-client.ts:12:20
 
 export async function createTaraClient(): Promise<TaraClient> {
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
-  const clientId = process.env.TARA_CLIENT_ID || '';
+  const clientId = process.env.TARA_CLIENT_ID && '';
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
   const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "client_id=test-client-id"
Received string:    "https://tara-test.ria.ee/oidc/authorize?response_type=code&client_id=&redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback&scope=openid&state=my-state&nonce=my-nonce&ui_locales=et"

[Killed] ConditionalExpression
src/tara-client.ts:13:24
 export async function createTaraClient(): Promise<TaraClient> {
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
   const clientId = process.env.TARA_CLIENT_ID || '';
-  const clientSecret = process.env.TARA_CLIENT_SECRET || '';
+  const clientSecret = true;
   const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
 
killedBy: createTaraClient exchangeCodeForTokens should encode credentials as base64
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-client-id:test-secret"
Received: "test-client-id:true"

[Killed] ConditionalExpression
src/tara-client.ts:13:24
 export async function createTaraClient(): Promise<TaraClient> {
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
   const clientId = process.env.TARA_CLIENT_ID || '';
-  const clientSecret = process.env.TARA_CLIENT_SECRET || '';
+  const clientSecret = false;
   const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
 
killedBy: createTaraClient exchangeCodeForTokens should encode credentials as base64
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-client-id:test-secret"
Received: "test-client-id:false"

[Killed] ConditionalExpression
src/tara-client.ts:14:23
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
   const clientId = process.env.TARA_CLIENT_ID || '';
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
-  const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
+  const callbackUrl = true;
 
   const JWKS = jose.createRemoteJWKSet(new URL(`${issuer}/oidc/jwks`));
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback"
Received string:    "https://tara-test.ria.ee/oidc/authorize?response_type=code&client_id=test-client-id&redirect_uri=true&scope=openid&state=my-state&nonce=my-nonce&ui_locales=et"

[Killed] LogicalOperator
src/tara-client.ts:14:23
   const issuer = process.env.TARA_ISSUER || 'https://tara-test.ria.ee';
   const clientId = process.env.TARA_CLIENT_ID || '';
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
-  const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
+  const callbackUrl = process.env.TARA_CALLBACK_URL && 'https://auth.askend-lab.com/auth/tara/callback';
 
   const JWKS = jose.createRemoteJWKSet(new URL(`${issuer}/oidc/jwks`));
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback"
Received string:    "https://tara-test.ria.ee/oidc/authorize?response_type=code&client_id=test-client-id&redirect_uri=https%3A%2F%2Fauth.askend-lab.com%2Fauth%2Ftara%2Fcallback&scope=openid&state=my-state&nonce=my-nonce&ui_locales=et"

[Killed] StringLiteral
src/tara-client.ts:16:48
   const clientSecret = process.env.TARA_CLIENT_SECRET || '';
   const callbackUrl = process.env.TARA_CALLBACK_URL || 'https://auth.askend-lab.com/auth/tara/callback';
 
-  const JWKS = jose.createRemoteJWKSet(new URL(`${issuer}/oidc/jwks`));
+  const JWKS = jose.createRemoteJWKSet(new URL(``));
 
   return {
killedBy: createTaraClient should create a client object with all methods
statusReason: TypeError: Invalid URL

[Killed] BlockStatement
src/tara-client.ts:19:65
   const JWKS = jose.createRemoteJWKSet(new URL(`${issuer}/oidc/jwks`));
 
   return {
-    buildAuthorizationUrl(state: string, nonce: string): string {
-      const params = new URLSearchParams({
-        response_type: 'code',
-        client_id: clientId,
-        redirect_uri: callbackUrl,
-        scope: 'openid',
-        state,
-        nonce,
-        ui_locales: 'et',
-      });
-      return `${issuer}/oidc/authorize?${params.toString()}`;
-    },
+    buildAuthorizationUrl(state: string, nonce: string): string {},
 
     async exchangeCodeForTokens(code: string): Promise<TaraTokens> {
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/tara-client.ts:24:16
         response_type: 'code',
         client_id: clientId,
         redirect_uri: callbackUrl,
-        scope: 'openid',
+        scope: "",
         state,
         nonce,
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "scope=openid"
Received string:    "https://tara-test.ria.ee/oidc/authorize?response_type=code&client_id=test-client-id&redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback&scope=&state=my-state&nonce=my-nonce&ui_locales=et"

[Killed] StringLiteral
src/tara-client.ts:29:14
         nonce,
         ui_locales: 'et',
       });
-      return `${issuer}/oidc/authorize?${params.toString()}`;
+      return ``;
     },
 
killedBy: createTaraClient buildAuthorizationUrl should build correct authorization URL with all params
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "https://tara-test.ria.ee/oidc/authorize?"
Received string:    ""

[Killed] StringLiteral
src/tara-client.ts:33:24
     },
 
     async exchangeCodeForTokens(code: string): Promise<TaraTokens> {
-      const tokenUrl = `${issuer}/oidc/token`;
+      const tokenUrl = ``;
       const credentials = Buffer.from(`${clientId}:${clientSecret}`).toString('base64');
 
killedBy: createTaraClient exchangeCodeForTokens should call fetch with correct URL and headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://tara-test.ria.ee/oidc/token"
Received: ""

[Killed] StringLiteral
src/tara-client.ts:37:21
       const credentials = Buffer.from(`${clientId}:${clientSecret}`).toString('base64');
 
       const body = new URLSearchParams({
-        grant_type: 'authorization_code',
+        grant_type: "",
         code,
         redirect_uri: callbackUrl,
killedBy: createTaraClient exchangeCodeForTokens should call fetch with correct URL and headers
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "grant_type=authorization_code"
Received string:    "grant_type=&code=auth-code-123&redirect_uri=https%3A%2F%2Fauth.example.com%2Fcallback"

[Killed] ObjectLiteral
src/tara-client.ts:42:46
         redirect_uri: callbackUrl,
       });
 
-      const response = await fetch(tokenUrl, {
-        method: 'POST',
-        headers: {
-          'Content-Type': 'application/x-www-form-urlencoded',
-          Authorization: `Basic ${credentials}`,
-        },
-        body: body.toString(),
-      });
+      const response = await fetch(tokenUrl, {});
 
       if (!response.ok) {
killedBy: createTaraClient exchangeCodeForTokens should call fetch with correct URL and headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "POST"
Received: undefined

[Killed] ObjectLiteral
src/tara-client.ts:44:18
 
       const response = await fetch(tokenUrl, {
         method: 'POST',
-        headers: {
-          'Content-Type': 'application/x-www-form-urlencoded',
-          Authorization: `Basic ${credentials}`,
-        },
+        headers: {},
         body: body.toString(),
       });
killedBy: createTaraClient exchangeCodeForTokens should call fetch with correct URL and headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "application/x-www-form-urlencoded"
Received: undefined

[Killed] BlockStatement
src/tara-client.ts:59:87
       return response.json() as Promise<TaraTokens>;
     },
 
-    async verifyIdToken(idToken: string, expectedNonce: string): Promise<TaraIdToken> {
-      const { payload } = await jose.jwtVerify(idToken, JWKS, {
-        issuer,
-        audience: clientId,
-      });
-
-      if (payload.nonce !== expectedNonce) {
-        throw new Error('Nonce mismatch in TARA id_token');
-      }
-
-      return payload as unknown as TaraIdToken;
-    },
+    async verifyIdToken(idToken: string, expectedNonce: string): Promise<TaraIdToken> {},
   };
 }
killedBy: createTaraClient verifyIdToken should verify JWT and return payload as TaraIdToken
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"aud": "test-client-id", "iss": "https://tara-test.ria.ee", "nonce": "correct-nonce", "sub": "EE38001085718"}
Received: undefined

[Killed] ConditionalExpression
src/tara-client.ts:65:11
         audience: clientId,
       });
 
-      if (payload.nonce !== expectedNonce) {
+      if (true) {
         throw new Error('Nonce mismatch in TARA id_token');
       }
killedBy: createTaraClient verifyIdToken should verify JWT and return payload as TaraIdToken
statusReason: Error: Nonce mismatch in TARA id_token

[Killed] ConditionalExpression
src/tara-client.ts:65:11
         audience: clientId,
       });
 
-      if (payload.nonce !== expectedNonce) {
+      if (false) {
         throw new Error('Nonce mismatch in TARA id_token');
       }
killedBy: createTaraClient verifyIdToken should throw on nonce mismatch
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"nonce": "wrong-nonce", "sub": "EE38001085718"}
