[Survived] ArrayDeclaration
src/components/SentenceSynthesisItem.tsx:127:18
   openMenuId,
   onMenuOpen,
   onMenuClose,
-  rowMenuItems = [],
+  rowMenuItems = ["Stryker was here"],
   menuContent,
   onMenuOpenLegacy,

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:136:9
   const containerRef = useRef<HTMLDivElement>(null);
 
   const handleDragStartInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
+    if (true) {
       e.dataTransfer.setDragImage(
         containerRef.current,

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:143:13
         containerRef.current.offsetHeight / 2,
       );
       setTimeout(() => {
-        if (containerRef.current) {
+        if (false) {
           containerRef.current.style.opacity = "0.5";
         }

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:154:9
   };
 
   const handleDragEndInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
+    if (true) {
       containerRef.current.style.opacity = "1";
     }

[Survived] StringLiteral
src/components/SentenceSynthesisItem.tsx:155:44
 
   const handleDragEndInternal = (e: React.DragEvent): void => {
     if (containerRef.current) {
-      containerRef.current.style.opacity = "1";
+      containerRef.current.style.opacity = "";
     }
     if (onDragEnd) {

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:164:5
 
   const containerClasses = [
     "sentence-synthesis-item",
-    isDragging && "sentence-synthesis-item--dragging",
+    true,
     isDragOver && "sentence-synthesis-item--drag-over",
     className,
killedBy: SentenceSynthesisItem drag and drop applies dragging class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:165:5
   const containerClasses = [
     "sentence-synthesis-item",
     isDragging && "sentence-synthesis-item--dragging",
-    isDragOver && "sentence-synthesis-item--drag-over",
+    true,
     className,
   ]
killedBy: SentenceSynthesisItem drag and drop applies drag-over class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:227:8
       onDragLeave={onDragLeave}
       onDrop={onDrop ? (e) => onDrop(e, id) : undefined}
     >
-      {draggable && mode !== "readonly" && (
+      {draggable || mode !== "readonly" && (
         <div
           className="sentence-synthesis-item__drag-handle"
killedBy: SentenceSynthesisItem mutation kills default prop values draggable defaults to false (no drag handle)
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-label="Drag to reorder"
  class="sentence-synthesis-item__drag-handle"
  draggable="true"
>
  <span

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:246:12
         isLoading={isLoading}
         disabled={
           isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          (mode === "input" && tags.length === 0 || !currentInput.trim())
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem mutation kills PlayButton disabled logic enabled in input mode with tags
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  aria-label="Play"
  class="sentence-synthesis-item__play button button--primary button--icon-only button--circular  "
  data-onboarding-target="sentence-0-play"
  disabled=""

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:246:12
         isLoading={isLoading}
         disabled={
           isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          (mode === "input" || tags.length === 0 && !currentInput.trim())
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem mutation kills PlayButton disabled logic enabled in input mode with tags
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  aria-label="Play"
  class="sentence-synthesis-item__play button button--primary button--icon-only button--circular  "
  data-onboarding-target="sentence-0-play"
  disabled=""

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:252:8
         data-onboarding-target={`sentence-${sentenceIndex}-play`}
       />
 
-      {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
+      {onMenuOpen && rowMenuItems.length > 0 || onMenuClose && (
         <RowMenu
           id={id}
killedBy: SentenceSynthesisItem mutation kills RowMenu conditional hides RowMenu when onMenuOpen missing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-expanded="false"
  aria-haspopup="menu"
  aria-label="Rohkem valikuid"
  class="sentence-synthesis-item__menu-button"
  data-onboarding-target="sentence-0-menu"

[Killed] EqualityOperator
src/components/SentenceSynthesisItem.tsx:255:19
       {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
         <RowMenu
           id={id}
-          isOpen={openMenuId === id}
+          isOpen={openMenuId !== id}
           items={rowMenuItems}
           onOpen={onMenuOpen}
killedBy: SentenceSynthesisItem row menu open state shows open menu when openMenuId matches
statusReason: Unable to find an accessible element with the role "menu"

Here are the accessible roles:

  button:

  Name "Play":
  <button

[Survived] StringLiteral
src/components/SentenceSynthesisItem.tsx:259:35
           items={rowMenuItems}
           onOpen={onMenuOpen}
           onClose={onMenuClose}
-          data-onboarding-target={`sentence-${sentenceIndex}-menu`}
+          data-onboarding-target={``}
         />
       )}

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:263:8
         />
       )}
 
-      {onMenuOpenLegacy && (
-        <div className="sentence-synthesis-item__menu-container">
-          <button
-            className="sentence-synthesis-item__menu-button"
-            aria-label="More options"
-            onClick={(e) => onMenuOpenLegacy(e, id)}
-            data-onboarding-target={`sentence-${sentenceIndex}-menu`}
-          >
-            <MoreIcon size="2xl" />
-          </button>
-          {menuContent}
-        </div>
-      )}
+      {false}
     </div>
   );
killedBy: SentenceSynthesisItem legacy menu shows legacy menu button when onMenuOpenLegacy provided
statusReason: Unable to find a label with the text of: More options

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >
