[Killed] LogicalOperator
src/components/SynthesisView.tsx:109:5
 
 const SentenceItem = ({ sentence, sentenceIndex, p }: SentenceItemProps) => {
   const isMenuOpen =
-    p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
+    p.menuOpenId === sentence.id || p.menuAnchorEl[sentence.id];
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
killedBy: SynthesisView mutation kills does not render menu when menuOpenId matches but no anchorEl
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="menu-s1"
/> instead

[Killed] ConditionalExpression
src/components/SynthesisView.tsx:111:5
   const isMenuOpen =
     p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
   const isTagSelected =
-    (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
-    (p.variantsSelectedSentenceId === sentence.id ||
-      p.sentencePhoneticId === sentence.id);
+    true;
   return (
     <SentenceSynthesisItem
killedBy: SynthesisView mutation kills selectedTagIndex is null when sentenceId doesn't match
statusReason: expected '2' to be 'null' // Object.is equality
