[Killed] BlockStatement
src/cognito-client.ts:16:38
   private client: CognitoIdentityProviderClient;
   private config: CognitoConfig;
 
-  constructor(config: CognitoConfig) {
-    this.config = config;
-    this.client = new CognitoIdentityProviderClient({ region: config.region });
-  }
+  constructor(config: CognitoConfig) {}
 
   async findOrCreateUser(taraIdToken: TaraIdToken): Promise<string> {
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should use CUSTOM_AUTH flow instead of ADMIN_USER_PASSWORD_AUTH
statusReason: TypeError: Cannot read properties of undefined (reading 'userPoolId')

[Killed] BlockStatement
src/cognito-client.ts:21:69
     this.client = new CognitoIdentityProviderClient({ region: config.region });
   }
 
-  async findOrCreateUser(taraIdToken: TaraIdToken): Promise<string> {
-    const personalCode = taraIdToken.sub;
-
-    // 1. Try to find user by personal_code custom attribute
-    let username = await this.findUserByPersonalCode(personalCode);
-    if (username) {
-      return username;
-    }
-
-    // 2. Try to find by email if provided
-    if (taraIdToken.email) {
-      username = await this.findUserByEmail(taraIdToken.email);
-      if (username) {
-        // Link TARA to existing account by adding personal_code
-        await this.updatePersonalCode(username, personalCode);
-        return username;
-      }
-    }
-
-    // 3. Create new user
-    return this.createUser(taraIdToken);
-  }
+  async findOrCreateUser(taraIdToken: TaraIdToken): Promise<string> {}
 
   private async findUserByPersonalCode(personalCode: string): Promise<string | null> {
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "existing-user"
Received: undefined

[Killed] ConditionalExpression
src/cognito-client.ts:26:9
 
     // 1. Try to find user by personal_code custom attribute
     let username = await this.findUserByPersonalCode(personalCode);
-    if (username) {
+    if (false) {
       return username;
     }
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "existing-user"
Received: "john@example.com"

[Killed] ConditionalExpression
src/cognito-client.ts:26:9
 
     // 1. Try to find user by personal_code custom attribute
     let username = await this.findUserByPersonalCode(personalCode);
-    if (username) {
+    if (true) {
       return username;
     }
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: null

[Killed] BlockStatement
src/cognito-client.ts:31:28
     }
 
     // 2. Try to find by email if provided
-    if (taraIdToken.email) {
-      username = await this.findUserByEmail(taraIdToken.email);
-      if (username) {
-        // Link TARA to existing account by adding personal_code
-        await this.updatePersonalCode(username, personalCode);
-        return username;
-      }
-    }
+    if (taraIdToken.email) {}
 
     // 3. Create new user
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: "john@example.com"

[Killed] ConditionalExpression
src/cognito-client.ts:31:9
     }
 
     // 2. Try to find by email if provided
-    if (taraIdToken.email) {
+    if (false) {
       username = await this.findUserByEmail(taraIdToken.email);
       if (username) {
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: "john@example.com"

[Killed] ConditionalExpression
src/cognito-client.ts:33:11
     // 2. Try to find by email if provided
     if (taraIdToken.email) {
       username = await this.findUserByEmail(taraIdToken.email);
-      if (username) {
+      if (false) {
         // Link TARA to existing account by adding personal_code
         await this.updatePersonalCode(username, personalCode);
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: "john@example.com"

[Killed] ConditionalExpression
src/cognito-client.ts:33:11
     // 2. Try to find by email if provided
     if (taraIdToken.email) {
       username = await this.findUserByEmail(taraIdToken.email);
-      if (username) {
+      if (true) {
         // Link TARA to existing account by adding personal_code
         await this.updatePersonalCode(username, personalCode);
killedBy: CognitoClient findOrCreateUser should create new user when not found by personal code or email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john@example.com"
Received: null

[Killed] BlockStatement
src/cognito-client.ts:44:86
     return this.createUser(taraIdToken);
   }
 
-  private async findUserByPersonalCode(personalCode: string): Promise<string | null> {
-    try {
-      const command = new ListUsersCommand({
-        UserPoolId: this.config.userPoolId,
-        Filter: `"custom:personal_code" = "${personalCode}"`,
-        Limit: 1,
-      });
-      const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
-    } catch {
-      return null;
-    }
-  }
+  private async findUserByPersonalCode(personalCode: string): Promise<string | null> {}
 
   private async findUserByEmail(email: string): Promise<string | null> {
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/cognito-client.ts:45:9
   }
 
   private async findUserByPersonalCode(personalCode: string): Promise<string | null> {
-    try {
-      const command = new ListUsersCommand({
-        UserPoolId: this.config.userPoolId,
-        Filter: `"custom:personal_code" = "${personalCode}"`,
-        Limit: 1,
-      });
-      const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ObjectLiteral
src/cognito-client.ts:46:44
 
   private async findUserByPersonalCode(personalCode: string): Promise<string | null> {
     try {
-      const command = new ListUsersCommand({
-        UserPoolId: this.config.userPoolId,
-        Filter: `"custom:personal_code" = "${personalCode}"`,
-        Limit: 1,
-      });
+      const command = new ListUsersCommand({});
       const response = await this.client.send(command);
       return response.Users?.[0]?.Username || null;
killedBy: CognitoClient mutation kills findUserByPersonalCode mutations should use correct filter with personal_code attribute
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "Filter": "\"custom:personal_code\" = \"EE12345\"",
-   "Limit": 1,

[Killed] StringLiteral
src/cognito-client.ts:48:17
     try {
       const command = new ListUsersCommand({
         UserPoolId: this.config.userPoolId,
-        Filter: `"custom:personal_code" = "${personalCode}"`,
+        Filter: ``,
         Limit: 1,
       });
killedBy: CognitoClient mutation kills findUserByPersonalCode mutations should use correct filter with personal_code attribute
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "Filter": "\"custom:personal_code\" = \"EE12345\"",
+   "Filter": "",

[Killed] ConditionalExpression
src/cognito-client.ts:52:14
         Limit: 1,
       });
       const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
+      return false;
     } catch {
       return null;
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "existing-user"
Received: "john@example.com"

[Killed] LogicalOperator
src/cognito-client.ts:52:14
         Limit: 1,
       });
       const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
+      return response.Users?.[0]?.Username && null;
     } catch {
       return null;
killedBy: CognitoClient findOrCreateUser should return existing user found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "existing-user"
Received: "john@example.com"

[Survived] BlockStatement
src/cognito-client.ts:53:13
       });
       const response = await this.client.send(command);
       return response.Users?.[0]?.Username || null;
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
src/cognito-client.ts:58:72
     }
   }
 
-  private async findUserByEmail(email: string): Promise<string | null> {
-    try {
-      const command = new ListUsersCommand({
-        UserPoolId: this.config.userPoolId,
-        Filter: `email = "${email}"`,
-        Limit: 1,
-      });
-      const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
-    } catch {
-      return null;
-    }
-  }
+  private async findUserByEmail(email: string): Promise<string | null> {}
 
   private async updatePersonalCode(username: string, personalCode: string): Promise<void> {
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: "john@example.com"

[Killed] BlockStatement
src/cognito-client.ts:59:9
   }
 
   private async findUserByEmail(email: string): Promise<string | null> {
-    try {
-      const command = new ListUsersCommand({
-        UserPoolId: this.config.userPoolId,
-        Filter: `email = "${email}"`,
-        Limit: 1,
-      });
-      const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: "john@example.com"

[Killed] ConditionalExpression
src/cognito-client.ts:66:14
         Limit: 1,
       });
       const response = await this.client.send(command);
-      return response.Users?.[0]?.Username || null;
+      return true;
     } catch {
       return null;
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "email-user"
Received: true

[Killed] BlockStatement
src/cognito-client.ts:72:91
     }
   }
 
-  private async updatePersonalCode(username: string, personalCode: string): Promise<void> {
-    const command = new AdminUpdateUserAttributesCommand({
-      UserPoolId: this.config.userPoolId,
-      Username: username,
-      UserAttributes: [
-        { Name: 'custom:personal_code', Value: personalCode },
-      ],
-    });
-    await this.client.send(command);
-  }
+  private async updatePersonalCode(username: string, personalCode: string): Promise<void> {}
 
   buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {
killedBy: CognitoClient findOrCreateUser should find by email and update personal code when not found by personal code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] ArrayDeclaration
src/cognito-client.ts:76:23
     const command = new AdminUpdateUserAttributesCommand({
       UserPoolId: this.config.userPoolId,
       Username: username,
-      UserAttributes: [
-        { Name: 'custom:personal_code', Value: personalCode },
-      ],
+      UserAttributes: [],
     });
     await this.client.send(command);
killedBy: CognitoClient mutation kills updatePersonalCode mutations should update personal_code attribute for found email user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"UserAttributes": [{"Name": "custom:personal_code", "Value": "EE999"}], "UserPoolId": "test-pool-id", "Username": "email-user"}
Received
       1
          Object {
        -   "UserAttributes": Array [
        -     Object {

[Killed] StringLiteral
src/cognito-client.ts:77:17
       UserPoolId: this.config.userPoolId,
       Username: username,
       UserAttributes: [
-        { Name: 'custom:personal_code', Value: personalCode },
+        { Name: "", Value: personalCode },
       ],
     });
killedBy: CognitoClient mutation kills updatePersonalCode mutations should update personal_code attribute for found email user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"UserAttributes": [{"Name": "custom:personal_code", "Value": "EE999"}], "UserPoolId": "test-pool-id", "Username": "email-user"}
Received
       1
          Object {
            "UserAttributes": Array [
              Object {

[Killed] BlockStatement
src/cognito-client.ts:83:89
     await this.client.send(command);
   }
 
-  buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
-    
-    const attributes: Array<{ Name: string; Value: string }> = [
-      { Name: 'email', Value: email },
-      { Name: 'email_verified', Value: 'true' },
-      { Name: 'custom:personal_code', Value: taraIdToken.sub },
-    ];
-
-    // Add optional attributes only if they have values
-    if (taraIdToken.given_name) {
-      attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
-    }
-    if (taraIdToken.family_name) {
-      attributes.push({ Name: 'family_name', Value: taraIdToken.family_name });
-    }
-
-    return attributes;
-  }
+  buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {}
 
   private async createUser(taraIdToken: TaraIdToken): Promise<string> {
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 5 attributes when all fields provided
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] LogicalOperator
src/cognito-client.ts:84:19
   }
 
   buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
+    const email = taraIdToken.email && `${taraIdToken.sub}@tara.ee`;
     
     const attributes: Array<{ Name: string; Value: string }> = [
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 5 attributes when all fields provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] ConditionalExpression
src/cognito-client.ts:84:19
   }
 
   buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
+    const email = false;
     
     const attributes: Array<{ Name: string; Value: string }> = [
killedBy: CognitoClient buildUserAttributes should include all attributes when provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"Name": "email", "Value": "john@example.com"}
Received array: [{"Name": "email", "Value": false}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE38001085718"}, {"Name": "given_name", "Value": "John"}, {"Name": "family_name", "Value": "Doe"}]

[Killed] ArrayDeclaration
src/cognito-client.ts:86:64
   buildUserAttributes(taraIdToken: TaraIdToken): Array<{ Name: string; Value: string }> {
     const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
     
-    const attributes: Array<{ Name: string; Value: string }> = [
-      { Name: 'email', Value: email },
-      { Name: 'email_verified', Value: 'true' },
-      { Name: 'custom:personal_code', Value: taraIdToken.sub },
-    ];
+    const attributes: Array<{ Name: string; Value: string }> = [];
 
     // Add optional attributes only if they have values
killedBy: CognitoClient buildUserAttributes should include all attributes when provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"Name": "email", "Value": "john@example.com"}
Received array: [{"Name": "given_name", "Value": "John"}, {"Name": "family_name", "Value": "Doe"}]

[Killed] StringLiteral
src/cognito-client.ts:88:15
     
     const attributes: Array<{ Name: string; Value: string }> = [
       { Name: 'email', Value: email },
-      { Name: 'email_verified', Value: 'true' },
+      { Name: "", Value: 'true' },
       { Name: 'custom:personal_code', Value: taraIdToken.sub },
     ];
killedBy: CognitoClient buildUserAttributes should include all attributes when provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"Name": "email_verified", "Value": "true"}
Received array: [{"Name": "email", "Value": "john@example.com"}, {"Name": "", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE38001085718"}, {"Name": "given_name", "Value": "John"}, {"Name": "family_name", "Value": "Doe"}]

[Killed] ConditionalExpression
src/cognito-client.ts:93:9
     ];
 
     // Add optional attributes only if they have values
-    if (taraIdToken.given_name) {
+    if (true) {
       attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
     }
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 3 attributes when no names
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 4
Received array:  [{"Name": "email", "Value": "e@e.com"}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE123"}, {"Name": "given_name", "Value": undefined}]

[Killed] BlockStatement
src/cognito-client.ts:93:33
     ];
 
     // Add optional attributes only if they have values
-    if (taraIdToken.given_name) {
-      attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
-    }
+    if (taraIdToken.given_name) {}
     if (taraIdToken.family_name) {
       attributes.push({ Name: 'family_name', Value: taraIdToken.family_name });
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 5 attributes when all fields provided
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 4
Received array:  [{"Name": "email", "Value": "e@e.com"}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE123"}, {"Name": "family_name", "Value": "Doe"}]

[Killed] ConditionalExpression
src/cognito-client.ts:96:9
     if (taraIdToken.given_name) {
       attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
     }
-    if (taraIdToken.family_name) {
+    if (true) {
       attributes.push({ Name: 'family_name', Value: taraIdToken.family_name });
     }
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 3 attributes when no names
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 4
Received array:  [{"Name": "email", "Value": "e@e.com"}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE123"}, {"Name": "family_name", "Value": undefined}]

[Killed] BlockStatement
src/cognito-client.ts:96:34
     if (taraIdToken.given_name) {
       attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
     }
-    if (taraIdToken.family_name) {
-      attributes.push({ Name: 'family_name', Value: taraIdToken.family_name });
-    }
+    if (taraIdToken.family_name) {}
 
     return attributes;
killedBy: CognitoClient mutation kills buildUserAttributes mutations should return exactly 5 attributes when all fields provided
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 4
Received array:  [{"Name": "email", "Value": "e@e.com"}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE123"}, {"Name": "given_name", "Value": "John"}]

[Killed] StringLiteral
src/cognito-client.ts:97:31
       attributes.push({ Name: 'given_name', Value: taraIdToken.given_name });
     }
     if (taraIdToken.family_name) {
-      attributes.push({ Name: 'family_name', Value: taraIdToken.family_name });
+      attributes.push({ Name: "", Value: taraIdToken.family_name });
     }
 
killedBy: CognitoClient buildUserAttributes should include all attributes when provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"Name": "family_name", "Value": "Doe"}
Received array: [{"Name": "email", "Value": "john@example.com"}, {"Name": "email_verified", "Value": "true"}, {"Name": "custom:personal_code", "Value": "EE38001085718"}, {"Name": "given_name", "Value": "John"}, {"Name": "", "Value": "Doe"}]

[Killed] BlockStatement
src/cognito-client.ts:103:71
     return attributes;
   }
 
-  private async createUser(taraIdToken: TaraIdToken): Promise<string> {
-    // Cognito requires email as username (UsernameAttributes: ["email"])
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
-    const username = email;
-
-    try {
-      const createCommand = new AdminCreateUserCommand({
-        UserPoolId: this.config.userPoolId,
-        Username: username,
-        UserAttributes: this.buildUserAttributes(taraIdToken),
-        MessageAction: 'SUPPRESS', // Don't send welcome email
-      });
-      await this.client.send(createCommand);
-    } catch (error) {
-      if (!(error instanceof UsernameExistsException)) {
-        throw error;
-      }
-      // User already exists, continue
-    }
-
-    return username;
-  }
+  private async createUser(taraIdToken: TaraIdToken): Promise<string> {}
 
   async generateTokens(username: string): Promise<CognitoTokens> {
killedBy: CognitoClient findOrCreateUser should create new user when not found by personal code or email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john@example.com"
Received: undefined

[Killed] ConditionalExpression
src/cognito-client.ts:105:19
 
   private async createUser(taraIdToken: TaraIdToken): Promise<string> {
     // Cognito requires email as username (UsernameAttributes: ["email"])
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
+    const email = true;
     const username = email;
 
killedBy: CognitoClient findOrCreateUser should create new user when not found by personal code or email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john@example.com"
Received: true

[Killed] ConditionalExpression
src/cognito-client.ts:105:19
 
   private async createUser(taraIdToken: TaraIdToken): Promise<string> {
     // Cognito requires email as username (UsernameAttributes: ["email"])
-    const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
+    const email = false;
     const username = email;
 
killedBy: CognitoClient findOrCreateUser should create new user when not found by personal code or email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john@example.com"
Received: false

[Killed] BlockStatement
src/cognito-client.ts:108:9
     const email = taraIdToken.email || `${taraIdToken.sub}@tara.ee`;
     const username = email;
 
-    try {
-      const createCommand = new AdminCreateUserCommand({
-        UserPoolId: this.config.userPoolId,
-        Username: username,
-        UserAttributes: this.buildUserAttributes(taraIdToken),
-        MessageAction: 'SUPPRESS', // Don't send welcome email
-      });
-      await this.client.send(createCommand);
-    } catch (error) {
+    try {} catch (error) {
       if (!(error instanceof UsernameExistsException)) {
         throw error;
killedBy: CognitoClient mutation kills findUserByEmail mutations should skip email search when email not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ObjectLiteral
src/cognito-client.ts:109:56
     const username = email;
 
     try {
-      const createCommand = new AdminCreateUserCommand({
-        UserPoolId: this.config.userPoolId,
-        Username: username,
-        UserAttributes: this.buildUserAttributes(taraIdToken),
-        MessageAction: 'SUPPRESS', // Don't send welcome email
-      });
+      const createCommand = new AdminCreateUserCommand({});
       await this.client.send(createCommand);
     } catch (error) {
killedBy: CognitoClient mutation kills createUser mutations should call AdminCreateUserCommand with correct args
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"MessageAction": "SUPPRESS", "UserAttributes": ArrayContaining [{"Name": "email", "Value": "u@e.com"}, {"Name": "custom:personal_code", "Value": "EE123"}], "UserPoolId": "test-pool-id", "Username": "u@e.com"}
Received
       1
        - Object {
        -   "MessageAction": "SUPPRESS",
        -   "UserAttributes": ArrayContain

[Killed] StringLiteral
src/cognito-client.ts:113:24
         UserPoolId: this.config.userPoolId,
         Username: username,
         UserAttributes: this.buildUserAttributes(taraIdToken),
-        MessageAction: 'SUPPRESS', // Don't send welcome email
+        MessageAction: "", // Don't send welcome email
       });
       await this.client.send(createCommand);
killedBy: CognitoClient mutation kills createUser mutations should call AdminCreateUserCommand with correct args
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"MessageAction": "SUPPRESS", "UserAttributes": ArrayContaining [{"Name": "email", "Value": "u@e.com"}, {"Name": "custom:personal_code", "Value": "EE123"}], "UserPoolId": "test-pool-id", "Username": "u@e.com"}
Received
       1
          Object {
        -   "MessageAction": "SUPPRESS",
        -   "UserAttributes": ArrayContain

[Killed] BlockStatement
src/cognito-client.ts:116:21
         MessageAction: 'SUPPRESS', // Don't send welcome email
       });
       await this.client.send(createCommand);
-    } catch (error) {
-      if (!(error instanceof UsernameExistsException)) {
-        throw error;
-      }
-      // User already exists, continue
-    }
+    } catch (error) {}
 
     return username;
killedBy: CognitoClient findOrCreateUser should rethrow non-UsernameExistsException errors during createUser
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "john@example.com"

[Killed] BooleanLiteral
src/cognito-client.ts:117:11
       });
       await this.client.send(createCommand);
     } catch (error) {
-      if (!(error instanceof UsernameExistsException)) {
+      if (error instanceof UsernameExistsException) {
         throw error;
       }
killedBy: CognitoClient findOrCreateUser should handle UsernameExistsException during createUser
statusReason: UsernameExistsException: exists

[Killed] ConditionalExpression
src/cognito-client.ts:117:11
       });
       await this.client.send(createCommand);
     } catch (error) {
-      if (!(error instanceof UsernameExistsException)) {
+      if (false) {
         throw error;
       }
killedBy: CognitoClient findOrCreateUser should rethrow non-UsernameExistsException errors during createUser
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "john@example.com"

[Killed] ObjectLiteral
src/cognito-client.ts:135:23
       UserPoolId: this.config.userPoolId,
       ClientId: this.config.clientId,
       AuthFlow: 'CUSTOM_AUTH',
-      AuthParameters: {
-        USERNAME: username,
-      },
+      AuthParameters: {},
     });
 
killedBy: CognitoClient mutation kills generateTokens mutations should pass correct UserPoolId and ClientId to InitiateAuth
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "AuthFlow": "CUSTOM_AUTH",
-   "AuthParameters": Object {
