[Killed] BooleanLiteral
src/components/BaseModal.tsx:99:28
       const firstElement = focusableElements[0];
       const lastElement = focusableElements[focusableElements.length - 1];
 
-      if (!firstElement || !lastElement) return;
+      if (!firstElement || lastElement) return;
 
       if (e.shiftKey && document.activeElement === firstElement) {
killedBy: BaseModal mutation kills focus trap wraps from last to first on Tab
statusReason: expected <button></button> to be <button …(3)>…(1)</button> // Object.is equality

[Killed] ConditionalExpression
src/components/BaseModal.tsx:101:11
 
       if (!firstElement || !lastElement) return;
 
-      if (e.shiftKey && document.activeElement === firstElement) {
+      if (false) {
         e.preventDefault();
         lastElement.focus();
killedBy: BaseModal mutation kills focus trap wraps from first to last on Shift+Tab
statusReason: expected <button …(3)>…(1)</button> to be <button></button> // Object.is equality

[Killed] ConditionalExpression
src/components/BaseModal.tsx:104:18
       if (e.shiftKey && document.activeElement === firstElement) {
         e.preventDefault();
         lastElement.focus();
-      } else if (!e.shiftKey && document.activeElement === lastElement) {
+      } else if (false) {
         e.preventDefault();
         firstElement.focus();
killedBy: BaseModal mutation kills focus trap wraps from last to first on Tab
statusReason: expected <button></button> to be <button …(3)>…(1)</button> // Object.is equality

[Killed] OptionalChaining
src/components/BaseModal.tsx:119:7
       const firstFocusable = modalRef.current?.querySelector<HTMLElement>(
         'button:not([disabled]), [href], input:not([disabled]), select:not([disabled]), textarea:not([disabled]), [tabindex]:not([tabindex="-1"])',
       );
-      firstFocusable?.focus();
+      firstFocusable.focus();
     });
 
killedBy: BaseModal mutation kills focus trap handles zero focusable elements
statusReason: Cannot read properties of null (reading 'focus')
