[Killed] BooleanLiteral
src/cognito-client.ts:143:11
     try {
       const initiateResponse = await this.client.send(initiateCommand);
       
-      if (!initiateResponse.ChallengeName) {
+      if (initiateResponse.ChallengeName) {
         throw new Error('Expected CUSTOM_CHALLENGE from Cognito');
       }
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should use CUSTOM_AUTH flow instead of ADMIN_USER_PASSWORD_AUTH
statusReason: Error: Token generation failed: Error: Expected CUSTOM_CHALLENGE from Cognito

[Killed] ConditionalExpression
src/cognito-client.ts:143:11
     try {
       const initiateResponse = await this.client.send(initiateCommand);
       
-      if (!initiateResponse.ChallengeName) {
+      if (false) {
         throw new Error('Expected CUSTOM_CHALLENGE from Cognito');
       }
killedBy: CognitoClient mutation kills generateTokens mutations should throw Expected CUSTOM_CHALLENGE when no ChallengeName
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": "a", "expiresIn": 3600, "idToken": "i", "refreshToken": "r"}

[Killed] ObjectLiteral
src/cognito-client.ts:149:69
 
       // Respond to the custom challenge with TARA_VERIFIED
       // This tells the Cognito trigger that TARA authentication succeeded
-      const respondCommand = new AdminRespondToAuthChallengeCommand({
-        UserPoolId: this.config.userPoolId,
-        ClientId: this.config.clientId,
-        ChallengeName: 'CUSTOM_CHALLENGE',
-        Session: initiateResponse.Session,
-        ChallengeResponses: {
-          USERNAME: username,
-          ANSWER: 'TARA_VERIFIED',
-        },
-      });
+      const respondCommand = new AdminRespondToAuthChallengeCommand({});
 
       const authResponse = await this.client.send(respondCommand);
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should send TARA_VERIFIED as challenge answer
statusReason: TypeError: Cannot read properties of undefined (reading 'ANSWER')

[Killed] StringLiteral
src/cognito-client.ts:152:24
       const respondCommand = new AdminRespondToAuthChallengeCommand({
         UserPoolId: this.config.userPoolId,
         ClientId: this.config.clientId,
-        ChallengeName: 'CUSTOM_CHALLENGE',
+        ChallengeName: "",
         Session: initiateResponse.Session,
         ChallengeResponses: {
killedBy: CognitoClient mutation kills generateTokens mutations should pass Session from initiate to respond
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"ChallengeName": "CUSTOM_CHALLENGE", "ChallengeResponses": {"ANSWER": "TARA_VERIFIED", "USERNAME": "user@e.com"}, "ClientId": "test-client-id", "Session": "my-session-123", "UserPoolId": "test-pool-id"}
Received
       1
          Object {
        -   "ChallengeName": "CUSTOM_CHALLENGE",
        +   "ChallengeName": "",

[Killed] ObjectLiteral
src/cognito-client.ts:154:29
         ClientId: this.config.clientId,
         ChallengeName: 'CUSTOM_CHALLENGE',
         Session: initiateResponse.Session,
-        ChallengeResponses: {
-          USERNAME: username,
-          ANSWER: 'TARA_VERIFIED',
-        },
+        ChallengeResponses: {},
       });
 
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should send TARA_VERIFIED as challenge answer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TARA_VERIFIED"
Received: undefined

[Killed] ConditionalExpression
src/cognito-client.ts:162:11
 
       const authResponse = await this.client.send(respondCommand);
 
-      if (!authResponse.AuthenticationResult) {
+      if (true) {
         throw new Error('No authentication result from Cognito');
       }
killedBy: CognitoClient mutation kills generateTokens mutations should pass correct UserPoolId and ClientId to InitiateAuth
statusReason: Error: Token generation failed: Error: No authentication result from Cognito

[Killed] ConditionalExpression
src/cognito-client.ts:162:11
 
       const authResponse = await this.client.send(respondCommand);
 
-      if (!authResponse.AuthenticationResult) {
+      if (false) {
         throw new Error('No authentication result from Cognito');
       }
killedBy: CognitoClient mutation kills generateTokens mutations should throw No authentication result when result missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No authentication result from Cognito"
Received message:   "Token generation failed: TypeError: Cannot read properties of null (reading 'AccessToken')"

      330 |         } else {
      331 |           stryCov_9fa48("108");
    > 332 |           throw new Error(stryMutAct_9fa48("109") ? `` : (stryCov_9fa48("109"), `Token gen

[Killed] StringLiteral
src/cognito-client.ts:163:25
       const authResponse = await this.client.send(respondCommand);
 
       if (!authResponse.AuthenticationResult) {
-        throw new Error('No authentication result from Cognito');
+        throw new Error("");
       }
 
killedBy: CognitoClient mutation kills generateTokens mutations should throw No authentication result when result missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No authentication result from Cognito"
Received message:   "Token generation failed: Error"

      330 |         } else {
      331 |           stryCov_9fa48("108");
    > 332 |           throw new Error(stryMutAct_9fa48("109") ? `` : (stryCov_9fa48("109"), `Token generation failed: ${error}`));

[Killed] ConditionalExpression
src/cognito-client.ts:167:22
       }
 
       return {
-        accessToken: authResponse.AuthenticationResult.AccessToken || '',
+        accessToken: true,
         idToken: authResponse.AuthenticationResult.IdToken || '',
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
killedBy: CognitoClient mutation kills generateTokens mutations should return exact token values from AuthenticationResult
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "accessToken": "at-1",
+   "accessToken": true,

[Killed] LogicalOperator
src/cognito-client.ts:167:22
       }
 
       return {
-        accessToken: authResponse.AuthenticationResult.AccessToken || '',
+        accessToken: authResponse.AuthenticationResult.AccessToken && '',
         idToken: authResponse.AuthenticationResult.IdToken || '',
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should use CUSTOM_AUTH flow instead of ADMIN_USER_PASSWORD_AUTH
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-access-token"
Received: ""

[Killed] ConditionalExpression
src/cognito-client.ts:168:18
 
       return {
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
-        idToken: authResponse.AuthenticationResult.IdToken || '',
+        idToken: true,
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
         expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
killedBy: CognitoClient mutation kills generateTokens mutations should return exact token values from AuthenticationResult
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "accessToken": "at-1",
    "expiresIn": 999,

[Killed] ConditionalExpression
src/cognito-client.ts:168:18
 
       return {
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
-        idToken: authResponse.AuthenticationResult.IdToken || '',
+        idToken: false,
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
         expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
killedBy: CognitoClient mutation kills generateTokens mutations should return exact token values from AuthenticationResult
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "accessToken": "at-1",
    "expiresIn": 999,

[Killed] ConditionalExpression
src/cognito-client.ts:169:23
       return {
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
         idToken: authResponse.AuthenticationResult.IdToken || '',
-        refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
+        refreshToken: false,
         expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
       };
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should use CUSTOM_AUTH flow instead of ADMIN_USER_PASSWORD_AUTH
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-refresh-token"
Received: false

[Killed] ConditionalExpression
src/cognito-client.ts:169:23
       return {
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
         idToken: authResponse.AuthenticationResult.IdToken || '',
-        refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
+        refreshToken: true,
         expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
       };
killedBy: CognitoClient mutation kills generateTokens mutations should return exact token values from AuthenticationResult
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "accessToken": "at-1",
    "expiresIn": 999,

[Killed] LogicalOperator
src/cognito-client.ts:170:20
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
         idToken: authResponse.AuthenticationResult.IdToken || '',
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
-        expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
+        expiresIn: authResponse.AuthenticationResult.ExpiresIn && 3600,
       };
     } catch (error) {
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should return empty strings for missing token fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3600
Received: undefined

[Killed] ConditionalExpression
src/cognito-client.ts:170:20
         accessToken: authResponse.AuthenticationResult.AccessToken || '',
         idToken: authResponse.AuthenticationResult.IdToken || '',
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
-        expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
+        expiresIn: true,
       };
     } catch (error) {
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should return empty strings for missing token fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3600
Received: true

[Killed] BlockStatement
src/cognito-client.ts:172:21
         refreshToken: authResponse.AuthenticationResult.RefreshToken || '',
         expiresIn: authResponse.AuthenticationResult.ExpiresIn || 3600,
       };
-    } catch (error) {
-      throw new Error(`Token generation failed: ${error}`);
-    }
+    } catch (error) {}
   }
 }
killedBy: CognitoClient generateTokens with CUSTOM_AUTH should throw when no ChallengeName returned
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/cognito-client.ts:178:54
   }
 }
 
-export function createCognitoClient(): CognitoClient {
-  const config: CognitoConfig = {
-    userPoolId: process.env.COGNITO_USER_POOL_ID || '',
-    clientId: process.env.COGNITO_CLIENT_ID || '',
-    region: process.env.AWS_REGION || 'eu-west-1',
-  };
-
-  if (!config.userPoolId || !config.clientId) {
-    throw new Error('COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set');
-  }
-
-  return new CognitoClient(config);
-}
+export function createCognitoClient(): CognitoClient {}
 
killedBy: CognitoClient mutation kills createCognitoClient factory mutations should use AWS_REGION from env
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CognitoClient

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
src/cognito-client.ts:180:17
 
 export function createCognitoClient(): CognitoClient {
   const config: CognitoConfig = {
-    userPoolId: process.env.COGNITO_USER_POOL_ID || '',
+    userPoolId: false,
     clientId: process.env.COGNITO_CLIENT_ID || '',
     region: process.env.AWS_REGION || 'eu-west-1',
killedBy: CognitoClient mutation kills createCognitoClient factory mutations should use AWS_REGION from env
statusReason: Error: COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set

[Killed] LogicalOperator
src/cognito-client.ts:180:17
 
 export function createCognitoClient(): CognitoClient {
   const config: CognitoConfig = {
-    userPoolId: process.env.COGNITO_USER_POOL_ID || '',
+    userPoolId: process.env.COGNITO_USER_POOL_ID && '',
     clientId: process.env.COGNITO_CLIENT_ID || '',
     region: process.env.AWS_REGION || 'eu-west-1',
killedBy: CognitoClient mutation kills createCognitoClient factory mutations should use AWS_REGION from env
statusReason: Error: COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set

[Killed] LogicalOperator
src/cognito-client.ts:181:15
 export function createCognitoClient(): CognitoClient {
   const config: CognitoConfig = {
     userPoolId: process.env.COGNITO_USER_POOL_ID || '',
-    clientId: process.env.COGNITO_CLIENT_ID || '',
+    clientId: process.env.COGNITO_CLIENT_ID && '',
     region: process.env.AWS_REGION || 'eu-west-1',
   };
killedBy: CognitoClient mutation kills createCognitoClient factory mutations should use AWS_REGION from env
statusReason: Error: COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set

[Killed] ConditionalExpression
src/cognito-client.ts:181:15
 export function createCognitoClient(): CognitoClient {
   const config: CognitoConfig = {
     userPoolId: process.env.COGNITO_USER_POOL_ID || '',
-    clientId: process.env.COGNITO_CLIENT_ID || '',
+    clientId: false,
     region: process.env.AWS_REGION || 'eu-west-1',
   };
killedBy: CognitoClient mutation kills createCognitoClient factory mutations should use AWS_REGION from env
statusReason: Error: COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set

[Survived] LogicalOperator
src/cognito-client.ts:182:13
   const config: CognitoConfig = {
     userPoolId: process.env.COGNITO_USER_POOL_ID || '',
     clientId: process.env.COGNITO_CLIENT_ID || '',
-    region: process.env.AWS_REGION || 'eu-west-1',
+    region: process.env.AWS_REGION && 'eu-west-1',
   };
 

[Survived] ConditionalExpression
src/cognito-client.ts:182:13
   const config: CognitoConfig = {
     userPoolId: process.env.COGNITO_USER_POOL_ID || '',
     clientId: process.env.COGNITO_CLIENT_ID || '',
-    region: process.env.AWS_REGION || 'eu-west-1',
+    region: true,
   };
 

[Killed] BooleanLiteral
src/cognito-client.ts:185:7
     region: process.env.AWS_REGION || 'eu-west-1',
   };
 
-  if (!config.userPoolId || !config.clientId) {
+  if (config.userPoolId || !config.clientId) {
     throw new Error('COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set');
   }
killedBy: CognitoClient createCognitoClient should create client when env vars are set
statusReason: Error: COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set

[Killed] ConditionalExpression
src/cognito-client.ts:185:7
     region: process.env.AWS_REGION || 'eu-west-1',
   };
 
-  if (!config.userPoolId || !config.clientId) {
+  if (false) {
     throw new Error('COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set');
   }
killedBy: CognitoClient createCognitoClient should throw when COGNITO_USER_POOL_ID is missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "COGNITO_USER_POOL_ID and COGNITO_CLIENT_ID must be set"

Received function did not throw
