[Killed] LogicalOperator
src/components/BuildInfo.tsx:86:16
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,
       message: runtimeInfo.message || buildTimeInfo.commitMessage,
-      builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,
+      builtAt: runtimeInfo.builtAt && buildTimeInfo.buildTime,
       deployedAt: runtimeInfo.deployedAt,
       environment: runtimeInfo.environment,
killedBy: BuildInfo mutation kills formatDateTime formats a valid date
statusReason: expected 0 to be greater than 0
