[Killed] BlockStatement
src/cognito-triggers.ts:9:45
 
 export async function handleDefineAuthChallenge(
   event: DefineAuthChallengeTriggerEvent
-): Promise<DefineAuthChallengeTriggerEvent> {
-  const session = event.request.session;
-
-  if (session.length === 0) {
-    // First attempt - issue CUSTOM_CHALLENGE
-    event.response.challengeName = 'CUSTOM_CHALLENGE';
-    event.response.issueTokens = false;
-    event.response.failAuthentication = false;
-  } else {
-    const lastChallenge = session[session.length - 1];
-    
-    if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
-      // Challenge passed - issue tokens
-      event.response.issueTokens = true;
-      event.response.failAuthentication = false;
-    } else {
-      // Challenge failed
-      event.response.issueTokens = false;
-      event.response.failAuthentication = true;
-    }
-  }
-
-  return event;
-}
+): Promise<DefineAuthChallengeTriggerEvent> {}
 
 export async function handleCreateAuthChallenge(
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue CUSTOM_CHALLENGE on first auth attempt
statusReason: TypeError: Cannot read properties of undefined (reading 'response')

[Killed] ConditionalExpression
src/cognito-triggers.ts:12:7
 ): Promise<DefineAuthChallengeTriggerEvent> {
   const session = event.request.session;
 
-  if (session.length === 0) {
+  if (true) {
     // First attempt - issue CUSTOM_CHALLENGE
     event.response.challengeName = 'CUSTOM_CHALLENGE';
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue tokens after successful CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/cognito-triggers.ts:12:7
 ): Promise<DefineAuthChallengeTriggerEvent> {
   const session = event.request.session;
 
-  if (session.length === 0) {
+  if (false) {
     // First attempt - issue CUSTOM_CHALLENGE
     event.response.challengeName = 'CUSTOM_CHALLENGE';
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue CUSTOM_CHALLENGE on first auth attempt
statusReason: TypeError: Cannot read properties of undefined (reading 'challengeName')

[Killed] BooleanLiteral
src/cognito-triggers.ts:15:34
   if (session.length === 0) {
     // First attempt - issue CUSTOM_CHALLENGE
     event.response.challengeName = 'CUSTOM_CHALLENGE';
-    event.response.issueTokens = false;
+    event.response.issueTokens = true;
     event.response.failAuthentication = false;
   } else {
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue CUSTOM_CHALLENGE on first auth attempt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/cognito-triggers.ts:16:41
     // First attempt - issue CUSTOM_CHALLENGE
     event.response.challengeName = 'CUSTOM_CHALLENGE';
     event.response.issueTokens = false;
-    event.response.failAuthentication = false;
+    event.response.failAuthentication = true;
   } else {
     const lastChallenge = session[session.length - 1];
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue CUSTOM_CHALLENGE on first auth attempt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/cognito-triggers.ts:17:10
     event.response.challengeName = 'CUSTOM_CHALLENGE';
     event.response.issueTokens = false;
     event.response.failAuthentication = false;
-  } else {
-    const lastChallenge = session[session.length - 1];
-    
-    if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
-      // Challenge passed - issue tokens
-      event.response.issueTokens = true;
-      event.response.failAuthentication = false;
-    } else {
-      // Challenge failed
-      event.response.issueTokens = false;
-      event.response.failAuthentication = true;
-    }
-  }
+  } else {}
 
   return event;
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue tokens after successful CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/cognito-triggers.ts:18:35
     event.response.issueTokens = false;
     event.response.failAuthentication = false;
   } else {
-    const lastChallenge = session[session.length - 1];
+    const lastChallenge = session[session.length + 1];
     
     if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue tokens after successful CUSTOM_CHALLENGE
statusReason: TypeError: Cannot read properties of undefined (reading 'challengeName')

[Killed] ConditionalExpression
src/cognito-triggers.ts:20:9
   } else {
     const lastChallenge = session[session.length - 1];
     
-    if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
+    if (true && lastChallenge.challengeResult) {
       // Challenge passed - issue tokens
       event.response.issueTokens = true;
killedBy: cognito-triggers mutation kills DefineAuthChallenge - L20 && operator should fail when challengeName is not CUSTOM_CHALLENGE even if result is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/cognito-triggers.ts:20:9
   } else {
     const lastChallenge = session[session.length - 1];
     
-    if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
+    if (true) {
       // Challenge passed - issue tokens
       event.response.issueTokens = true;
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should fail authentication after failed CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/cognito-triggers.ts:22:36
     
     if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
       // Challenge passed - issue tokens
-      event.response.issueTokens = true;
+      event.response.issueTokens = false;
       event.response.failAuthentication = false;
     } else {
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue tokens after successful CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/cognito-triggers.ts:23:43
     if (lastChallenge.challengeName === 'CUSTOM_CHALLENGE' && lastChallenge.challengeResult) {
       // Challenge passed - issue tokens
       event.response.issueTokens = true;
-      event.response.failAuthentication = false;
+      event.response.failAuthentication = true;
     } else {
       // Challenge failed
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should issue tokens after successful CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/cognito-triggers.ts:24:12
       // Challenge passed - issue tokens
       event.response.issueTokens = true;
       event.response.failAuthentication = false;
-    } else {
-      // Challenge failed
-      event.response.issueTokens = false;
-      event.response.failAuthentication = true;
-    }
+    } else {}
   }
 
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should fail authentication after failed CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/cognito-triggers.ts:26:36
       event.response.failAuthentication = false;
     } else {
       // Challenge failed
-      event.response.issueTokens = false;
+      event.response.issueTokens = true;
       event.response.failAuthentication = true;
     }
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should fail authentication after failed CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/cognito-triggers.ts:27:43
     } else {
       // Challenge failed
       event.response.issueTokens = false;
-      event.response.failAuthentication = true;
+      event.response.failAuthentication = false;
     }
   }
killedBy: Cognito Custom Auth Triggers DefineAuthChallenge should fail authentication after failed CUSTOM_CHALLENGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/cognito-triggers.ts:36:45
 
 export async function handleCreateAuthChallenge(
   event: CreateAuthChallengeTriggerEvent
-): Promise<CreateAuthChallengeTriggerEvent> {
-  event.response.publicChallengeParameters = {
-    type: 'TARA',
-  };
-  event.response.privateChallengeParameters = {};
-  event.response.challengeMetadata = 'TARA_AUTH';
-
-  return event;
-}
+): Promise<CreateAuthChallengeTriggerEvent> {}
 
 export async function handleVerifyAuthChallengeResponse(
killedBy: Cognito Custom Auth Triggers CreateAuthChallenge should create a challenge with metadata
statusReason: TypeError: Cannot read properties of undefined (reading 'response')

[Killed] StringLiteral
src/cognito-triggers.ts:38:11
   event: CreateAuthChallengeTriggerEvent
 ): Promise<CreateAuthChallengeTriggerEvent> {
   event.response.publicChallengeParameters = {
-    type: 'TARA',
+    type: "",
   };
   event.response.privateChallengeParameters = {};
killedBy: cognito-triggers mutation kills CreateAuthChallenge - L37 ObjectLiteral, L38 StringLiteral should set publicChallengeParameters with type=TARA
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "type": "TARA",
+   "type": "",

[Killed] StringLiteral
src/cognito-triggers.ts:41:38
     type: 'TARA',
   };
   event.response.privateChallengeParameters = {};
-  event.response.challengeMetadata = 'TARA_AUTH';
+  event.response.challengeMetadata = "";
 
   return event;
killedBy: Cognito Custom Auth Triggers CreateAuthChallenge should create a challenge with metadata
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TARA_AUTH"
Received: ""

[Killed] BlockStatement
src/cognito-triggers.ts:48:53
 
 export async function handleVerifyAuthChallengeResponse(
   event: VerifyAuthChallengeResponseTriggerEvent
-): Promise<VerifyAuthChallengeResponseTriggerEvent> {
-  // TARA Lambda sends 'TARA_VERIFIED' as challenge answer after successful TARA authentication
-  event.response.answerCorrect = event.request.challengeAnswer === 'TARA_VERIFIED';
-
-  return event;
-}
+): Promise<VerifyAuthChallengeResponseTriggerEvent> {}
 
 // Main handler that routes based on triggerSource
killedBy: Cognito Custom Auth Triggers VerifyAuthChallengeResponse should verify TARA challenge answer as valid
statusReason: TypeError: Cannot read properties of undefined (reading 'response')

[Killed] EqualityOperator
src/cognito-triggers.ts:50:34
   event: VerifyAuthChallengeResponseTriggerEvent
 ): Promise<VerifyAuthChallengeResponseTriggerEvent> {
   // TARA Lambda sends 'TARA_VERIFIED' as challenge answer after successful TARA authentication
-  event.response.answerCorrect = event.request.challengeAnswer === 'TARA_VERIFIED';
+  event.response.answerCorrect = event.request.challengeAnswer !== 'TARA_VERIFIED';
 
   return event;
killedBy: Cognito Custom Auth Triggers VerifyAuthChallengeResponse should verify TARA challenge answer as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/cognito-triggers.ts:50:34
   event: VerifyAuthChallengeResponseTriggerEvent
 ): Promise<VerifyAuthChallengeResponseTriggerEvent> {
   // TARA Lambda sends 'TARA_VERIFIED' as challenge answer after successful TARA authentication
-  event.response.answerCorrect = event.request.challengeAnswer === 'TARA_VERIFIED';
+  event.response.answerCorrect = false;
 
   return event;
killedBy: cognito-triggers mutation kills VerifyAuthChallengeResponse - exact answer matching should accept exactly "TARA_VERIFIED" as answer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/cognito-triggers.ts:58:124
 // Main handler that routes based on triggerSource
 export const handler = async (
   event: DefineAuthChallengeTriggerEvent | CreateAuthChallengeTriggerEvent | VerifyAuthChallengeResponseTriggerEvent
-): Promise<DefineAuthChallengeTriggerEvent | CreateAuthChallengeTriggerEvent | VerifyAuthChallengeResponseTriggerEvent> => {
-  const triggerSource = event.triggerSource;
-  
-  switch (triggerSource) {
-    case 'DefineAuthChallenge_Authentication':
-      return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
-    case 'CreateAuthChallenge_Authentication':
-      return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
-    case 'VerifyAuthChallengeResponse_Authentication':
-      return handleVerifyAuthChallengeResponse(event as VerifyAuthChallengeResponseTriggerEvent);
-    default:
-      throw new Error(`Unknown trigger source: ${triggerSource}`);
-  }
-};
+): Promise<DefineAuthChallengeTriggerEvent | CreateAuthChallengeTriggerEvent | VerifyAuthChallengeResponseTriggerEvent> => {};
 
killedBy: Cognito Custom Auth Triggers handler routing should route DefineAuthChallenge_Authentication
statusReason: TypeError: Cannot read properties of undefined (reading 'response')

[Killed] ConditionalExpression
src/cognito-triggers.ts:62:5
   const triggerSource = event.triggerSource;
   
   switch (triggerSource) {
-    case 'DefineAuthChallenge_Authentication':
-      return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
+    case 'DefineAuthChallenge_Authentication':
     case 'CreateAuthChallenge_Authentication':
       return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
killedBy: Cognito Custom Auth Triggers handler routing should route DefineAuthChallenge_Authentication
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "challengeName"

Expected value: "CUSTOM_CHALLENGE"
Received value: ""

[Killed] StringLiteral
src/cognito-triggers.ts:62:10
   const triggerSource = event.triggerSource;
   
   switch (triggerSource) {
-    case 'DefineAuthChallenge_Authentication':
+    case "":
       return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
     case 'CreateAuthChallenge_Authentication':
killedBy: Cognito Custom Auth Triggers handler routing should route DefineAuthChallenge_Authentication
statusReason: Error: Unknown trigger source: DefineAuthChallenge_Authentication

[Killed] ConditionalExpression
src/cognito-triggers.ts:64:5
   switch (triggerSource) {
     case 'DefineAuthChallenge_Authentication':
       return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
-    case 'CreateAuthChallenge_Authentication':
-      return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
+    case 'CreateAuthChallenge_Authentication':
     case 'VerifyAuthChallengeResponse_Authentication':
       return handleVerifyAuthChallengeResponse(event as VerifyAuthChallengeResponseTriggerEvent);
killedBy: Cognito Custom Auth Triggers handler routing should route CreateAuthChallenge_Authentication
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "challengeMetadata"

Expected value: "TARA_AUTH"
Received value: ""

[Killed] StringLiteral
src/cognito-triggers.ts:64:10
   switch (triggerSource) {
     case 'DefineAuthChallenge_Authentication':
       return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
-    case 'CreateAuthChallenge_Authentication':
+    case "":
       return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
     case 'VerifyAuthChallengeResponse_Authentication':
killedBy: Cognito Custom Auth Triggers handler routing should route CreateAuthChallenge_Authentication
statusReason: Error: Unknown trigger source: CreateAuthChallenge_Authentication

[Killed] ConditionalExpression
src/cognito-triggers.ts:66:5
       return handleDefineAuthChallenge(event as DefineAuthChallengeTriggerEvent);
     case 'CreateAuthChallenge_Authentication':
       return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
-    case 'VerifyAuthChallengeResponse_Authentication':
-      return handleVerifyAuthChallengeResponse(event as VerifyAuthChallengeResponseTriggerEvent);
+    case 'VerifyAuthChallengeResponse_Authentication':
     default:
       throw new Error(`Unknown trigger source: ${triggerSource}`);
killedBy: Cognito Custom Auth Triggers handler routing should route VerifyAuthChallengeResponse_Authentication
statusReason: Error: Unknown trigger source: VerifyAuthChallengeResponse_Authentication

[Killed] ConditionalExpression
src/cognito-triggers.ts:68:5
       return handleCreateAuthChallenge(event as CreateAuthChallengeTriggerEvent);
     case 'VerifyAuthChallengeResponse_Authentication':
       return handleVerifyAuthChallengeResponse(event as VerifyAuthChallengeResponseTriggerEvent);
-    default:
-      throw new Error(`Unknown trigger source: ${triggerSource}`);
+    default:
   }
 };
killedBy: Cognito Custom Auth Triggers handler routing should throw for unknown trigger source
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/cognito-triggers.ts:69:23
     case 'VerifyAuthChallengeResponse_Authentication':
       return handleVerifyAuthChallengeResponse(event as VerifyAuthChallengeResponseTriggerEvent);
     default:
-      throw new Error(`Unknown trigger source: ${triggerSource}`);
+      throw new Error(``);
   }
 };
killedBy: Cognito Custom Auth Triggers handler routing should throw for unknown trigger source
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unknown trigger source: UnknownTrigger"
Received message:   ""

      143 |         if (stryMutAct_9fa48("169")) {} else {
      144 |           stryCov_9fa48("169");
    > 145 |           throw new Error(stryMutAct_9fa48("170") ? `` : (stryCov_9fa48("170"), `Unknown trigger source: ${triggerSource}`));
