[Killed] ArrowFunction
src/components/AddEntryModal.tsx:38:19
         id="entry-title"
         type="text"
         value={title}
-        onChange={(e) => onTitleChange(e.target.value)}
+        onChange={() => undefined}
         className="add-entry-modal__input"
         placeholder="Pealkiri (Kohustuslik)"
killedBy: AddEntryModal input handling enables submit button when title entered
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="button button--primary"
  disabled=""
  type="submit"
/>

[Killed] ArrowFunction
src/components/AddEntryModal.tsx:51:19
       <textarea
         id="entry-description"
         value={description}
-        onChange={(e) => onDescChange(e.target.value)}
+        onChange={() => undefined}
         className="add-entry-modal__textarea"
         placeholder="Kirjeldus"
killedBy: AddEntryModal input handling allows entering description
statusReason: expect(element).toHaveValue(Test description)

Expected the element to have value:
  Test description
Received:

[Killed] ConditionalExpression
src/components/AddEntryModal.tsx:58:6
         disabled={isSubmitting}
       />
     </div>
-    {error && (
-      <div className="add-entry-modal__error" role="alert">
-        <p>{error}</p>
-      </div>
-    )}
+    {true}
     <div className="add-entry-modal__actions">
       <button
killedBy: AddEntryModal error handling shows error on submission failure
statusReason: Unable to find an element with the text: Failed to add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/components/AddEntryModal.tsx:58:6
         disabled={isSubmitting}
       />
     </div>
-    {error && (
-      <div className="add-entry-modal__error" role="alert">
-        <p>{error}</p>
-      </div>
-    )}
+    {false}
     <div className="add-entry-modal__actions">
       <button
killedBy: AddEntryModal error handling shows error on submission failure
statusReason: Unable to find an element with the text: Failed to add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/components/AddEntryModal.tsx:67:35
       <button
         type="submit"
         className="button button--primary"
-        disabled={isSubmitting || !title.trim()}
+        disabled={isSubmitting || title.trim()}
       >
         {isSubmitting ? "Lisaan..." : "Lisa"}
killedBy: AddEntryModal rendering renders submit button disabled initially
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="button button--primary"
  type="submit"
/>

[Killed] MethodExpression
src/components/AddEntryModal.tsx:67:36
       <button
         type="submit"
         className="button button--primary"
-        disabled={isSubmitting || !title.trim()}
+        disabled={isSubmitting || !title}
       >
         {isSubmitting ? "Lisaan..." : "Lisa"}
killedBy: AddEntryModal input handling disables submit with whitespace-only title
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="button button--primary"
  type="submit"
/>

[Killed] StringLiteral
src/components/AddEntryModal.tsx:69:39
         className="button button--primary"
         disabled={isSubmitting || !title.trim()}
       >
-        {isSubmitting ? "Lisaan..." : "Lisa"}
+        {isSubmitting ? "Lisaan..." : ""}
       </button>
     </div>
killedBy: AddEntryModal rendering renders submit button disabled initially
statusReason: Unable to find an accessible element with the role "button" and name "Lisa"

Here are the accessible roles:

  dialog:

  Name "Lisa ülesanne":
  <div

[Killed] BooleanLiteral
src/components/AddEntryModal.tsx:82:52
 }: AddEntryModalProps) {
   const [title, setTitle] = useState("");
   const [description, setDescription] = useState("");
-  const [isSubmitting, setIsSubmitting] = useState(false);
+  const [isSubmitting, setIsSubmitting] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const resetForm = () => {
killedBy: AddEntryModal rendering renders submit button disabled initially
statusReason: Unable to find an accessible element with the role "button" and name "Lisa"

Here are the accessible roles:

  dialog:

  Name "Lisa ülesanne":
  <div

[Killed] BlockStatement
src/components/AddEntryModal.tsx:84:27
   const [description, setDescription] = useState("");
   const [isSubmitting, setIsSubmitting] = useState(false);
   const [error, setError] = useState<string | null>(null);
-  const resetForm = () => {
-    setTitle("");
-    setDescription("");
-    setError(null);
-  };
+  const resetForm = () => {};
   const handleClose = () => {
     if (!isSubmitting) {
killedBy: AddEntryModal form submission resets form after successful submit
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Test Title

[Killed] StringLiteral
src/components/AddEntryModal.tsx:85:14
   const [isSubmitting, setIsSubmitting] = useState(false);
   const [error, setError] = useState<string | null>(null);
   const resetForm = () => {
-    setTitle("");
+    setTitle("Stryker was here!");
     setDescription("");
     setError(null);
killedBy: AddEntryModal form submission resets form after successful submit
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[NoCoverage] BlockStatement
src/components/AddEntryModal.tsx:89:29
     setDescription("");
     setError(null);
   };
-  const handleClose = () => {
-    if (!isSubmitting) {
-      resetForm();
-      onClose();
-    }
-  };
+  const handleClose = () => {};
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();

[NoCoverage] BlockStatement
src/components/AddEntryModal.tsx:90:24
     setError(null);
   };
   const handleClose = () => {
-    if (!isSubmitting) {
-      resetForm();
-      onClose();
-    }
+    if (!isSubmitting) {}
   };
   const handleSubmit = async (e: React.FormEvent) => {

[NoCoverage] ConditionalExpression
src/components/AddEntryModal.tsx:90:9
     setError(null);
   };
   const handleClose = () => {
-    if (!isSubmitting) {
+    if (false) {
       resetForm();
       onClose();

[Killed] BlockStatement
src/components/AddEntryModal.tsx:95:54
       onClose();
     }
   };
-  const handleSubmit = async (e: React.FormEvent) => {
-    e.preventDefault();
-    if (!title.trim()) {
-      setError("Pealkiri on kohustuslik");
-      return;
-    }
-    setIsSubmitting(true);
-    setError(null);
-    try {
-      await onAdd(title.trim(), description.trim());
-      resetForm();
-      onClose();
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Viga ülesande lisamisel");
-    } finally {
-      setIsSubmitting(false);
-    }
-  };
+  const handleSubmit = async (e: React.FormEvent) => {};
   if (!isOpen) return null;
   return (
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/AddEntryModal.tsx:97:9
   };
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
-    if (!title.trim()) {
+    if (true) {
       setError("Pealkiri on kohustuslik");
       return;
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/components/AddEntryModal.tsx:97:9
   };
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
-    if (!title.trim()) {
+    if (title.trim()) {
       setError("Pealkiri on kohustuslik");
       return;
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/components/AddEntryModal.tsx:101:21
       setError("Pealkiri on kohustuslik");
       return;
     }
-    setIsSubmitting(true);
+    setIsSubmitting(false);
     setError(null);
     try {
killedBy: AddEntryModal form submission shows loading state during submission
statusReason: Unable to find an element with the text: Lisaan.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] BlockStatement
src/components/AddEntryModal.tsx:103:9
     }
     setIsSubmitting(true);
     setError(null);
-    try {
-      await onAdd(title.trim(), description.trim());
-      resetForm();
-      onClose();
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : "Viga ülesande lisamisel");
     } finally {
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] MethodExpression
src/components/AddEntryModal.tsx:104:19
     setIsSubmitting(true);
     setError(null);
     try {
-      await onAdd(title.trim(), description.trim());
+      await onAdd(title, description.trim());
       resetForm();
       onClose();
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Received: 

  1st vi.fn() call:

  [
-   "Test Title",

[Killed] MethodExpression
src/components/AddEntryModal.tsx:104:33
     setIsSubmitting(true);
     setError(null);
     try {
-      await onAdd(title.trim(), description.trim());
+      await onAdd(title.trim(), description);
       resetForm();
       onClose();
killedBy: AddEntryModal form submission calls onAdd with trimmed values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test Title', 'Test Description' ]

Received: 

  1st vi.fn() call:

  [
    "Test Title",

[Killed] BlockStatement
src/components/AddEntryModal.tsx:107:19
       await onAdd(title.trim(), description.trim());
       resetForm();
       onClose();
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Viga ülesande lisamisel");
-    } finally {
+    } catch (err) {} finally {
       setIsSubmitting(false);
     }
killedBy: AddEntryModal error handling shows error on submission failure
statusReason: Unable to find an element with the text: Failed to add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Survived] BlockStatement
src/components/AddEntryModal.tsx:109:15
       onClose();
     } catch (err) {
       setError(err instanceof Error ? err.message : "Viga ülesande lisamisel");
-    } finally {
-      setIsSubmitting(false);
-    }
+    } finally {}
   };
   if (!isOpen) return null;

[Survived] BooleanLiteral
src/components/AddEntryModal.tsx:110:23
     } catch (err) {
       setError(err instanceof Error ? err.message : "Viga ülesande lisamisel");
     } finally {
-      setIsSubmitting(false);
+      setIsSubmitting(true);
     }
   };

[Killed] ConditionalExpression
src/components/AddEntryModal.tsx:113:7
       setIsSubmitting(false);
     }
   };
-  if (!isOpen) return null;
+  if (true) return null;
   return (
     <BaseModal
killedBy: AddEntryModal rendering renders when open
statusReason: Unable to find an element with the placeholder text of: Pealkiri (Kohustuslik)

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/AddEntryModal.tsx:113:7
       setIsSubmitting(false);
     }
   };
-  if (!isOpen) return null;
+  if (isOpen) return null;
   return (
     <BaseModal
killedBy: AddEntryModal rendering renders when open
statusReason: Unable to find an element with the placeholder text of: Pealkiri (Kohustuslik)

Ignored nodes: comments, script, style
<body>
  <div />
</body>
