[Killed] ConditionalExpression
src/components/LoginModal.tsx:96:9
   };
 
   const handleClose = () => {
-    if (!isLoading) {
+    if (true) {
       setError(null);
       onClose();
killedBy: LoginModal mutation kills handleClose does not call onClose while loading
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []
