[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:30:7
   filteredTasks: TaskSummary[];
   searchQuery: string;
   onSelect: (id: string, name: string) => void;
-}) => {
-  if (isLoading)
-    return (
-      <div className="add-to-task-loading">
-        <div className="loader-spinner"></div>
-      </div>
-    );
-  if (filteredTasks.length === 0 && searchQuery)
-    return <div className="add-to-task-empty">Ülesandeid ei leitud</div>;
-  return (
-    <>
-      {filteredTasks.map((task) => (
-        <button
-          key={task.id}
-          className="add-to-task-item"
-          onClick={() => onSelect(task.id, task.name)}
-        >
-          <span className="add-to-task-item-name">{task.name}</span>
-        </button>
-      ))}
-    </>
-  );
-};
+}) => {};
 
 export default function AddToTaskDropdown({

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:31:7
   searchQuery: string;
   onSelect: (id: string, name: string) => void;
 }) => {
-  if (isLoading)
+  if (false)
     return (
       <div className="add-to-task-loading">

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:31:7
   searchQuery: string;
   onSelect: (id: string, name: string) => void;
 }) => {
-  if (isLoading)
+  if (true)
     return (
       <div className="add-to-task-loading">

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:37:7
         <div className="loader-spinner"></div>
       </div>
     );
-  if (filteredTasks.length === 0 && searchQuery)
+  if (true)
     return <div className="add-to-task-empty">Ülesandeid ei leitud</div>;
   return (

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:37:7
         <div className="loader-spinner"></div>
       </div>
     );
-  if (filteredTasks.length === 0 && searchQuery)
+  if (true && searchQuery)
     return <div className="add-to-task-empty">Ülesandeid ei leitud</div>;
   return (

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:41:26
     return <div className="add-to-task-empty">Ülesandeid ei leitud</div>;
   return (
     <>
-      {filteredTasks.map((task) => (
-        <button
-          key={task.id}
-          className="add-to-task-item"
-          onClick={() => onSelect(task.id, task.name)}
-        >
-          <span className="add-to-task-item-name">{task.name}</span>
-        </button>
-      ))}
+      {filteredTasks.map(() => undefined)}
     </>
   );

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:45:20
         <button
           key={task.id}
           className="add-to-task-item"
-          onClick={() => onSelect(task.id, task.name)}
+          onClick={() => undefined}
         >
           <span className="add-to-task-item-name">{task.name}</span>

[NoCoverage] BooleanLiteral
src/components/AddToTaskDropdown.tsx:64:46
   const { user } = useAuth();
   const [searchQuery, setSearchQuery] = useState("");
   const [tasks, setTasks] = useState<TaskSummary[]>([]);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const dropdownRef = useRef<HTMLDivElement>(null);
   const searchInputRef = useRef<HTMLInputElement>(null);

[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:67:19
   const [isLoading, setIsLoading] = useState(false);
   const dropdownRef = useRef<HTMLDivElement>(null);
   const searchInputRef = useRef<HTMLInputElement>(null);
-  useEffect(() => {
-    if (!isOpen || !user) return;
-    setIsLoading(true);
-    DataService.getInstance()
-      .getUserTasks(user.id)
-      .then(setTasks)
-      .catch((e) => console.error("Failed to load tasks:", e))
-      .finally(() => setIsLoading(false));
-  }, [isOpen, user]);
+  useEffect(() => {}, [isOpen, user]);
   useEffect(() => {
     if (isOpen && searchInputRef.current)

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:68:9
   const dropdownRef = useRef<HTMLDivElement>(null);
   const searchInputRef = useRef<HTMLInputElement>(null);
   useEffect(() => {
-    if (!isOpen || !user) return;
+    if (false) return;
     setIsLoading(true);
     DataService.getInstance()

[NoCoverage] BooleanLiteral
src/components/AddToTaskDropdown.tsx:68:9
   const dropdownRef = useRef<HTMLDivElement>(null);
   const searchInputRef = useRef<HTMLInputElement>(null);
   useEffect(() => {
-    if (!isOpen || !user) return;
+    if (isOpen || !user) return;
     setIsLoading(true);
     DataService.getInstance()

[NoCoverage] BooleanLiteral
src/components/AddToTaskDropdown.tsx:69:18
   const searchInputRef = useRef<HTMLInputElement>(null);
   useEffect(() => {
     if (!isOpen || !user) return;
-    setIsLoading(true);
+    setIsLoading(false);
     DataService.getInstance()
       .getUserTasks(user.id)

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:73:14
     DataService.getInstance()
       .getUserTasks(user.id)
       .then(setTasks)
-      .catch((e) => console.error("Failed to load tasks:", e))
+      .catch(() => undefined)
       .finally(() => setIsLoading(false));
   }, [isOpen, user]);

[NoCoverage] BooleanLiteral
src/components/AddToTaskDropdown.tsx:74:35
       .getUserTasks(user.id)
       .then(setTasks)
       .catch((e) => console.error("Failed to load tasks:", e))
-      .finally(() => setIsLoading(false));
+      .finally(() => setIsLoading(true));
   }, [isOpen, user]);
   useEffect(() => {

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:74:16
       .getUserTasks(user.id)
       .then(setTasks)
       .catch((e) => console.error("Failed to load tasks:", e))
-      .finally(() => setIsLoading(false));
+      .finally(() => undefined);
   }, [isOpen, user]);
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:76:19
       .catch((e) => console.error("Failed to load tasks:", e))
       .finally(() => setIsLoading(false));
   }, [isOpen, user]);
-  useEffect(() => {
-    if (isOpen && searchInputRef.current)
-      setTimeout(() => searchInputRef.current?.focus(), 100);
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
   useEffect(() => {
     if (!isOpen) setSearchQuery("");

[NoCoverage] LogicalOperator
src/components/AddToTaskDropdown.tsx:77:9
       .finally(() => setIsLoading(false));
   }, [isOpen, user]);
   useEffect(() => {
-    if (isOpen && searchInputRef.current)
+    if (isOpen || searchInputRef.current)
       setTimeout(() => searchInputRef.current?.focus(), 100);
   }, [isOpen]);

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:77:9
       .finally(() => setIsLoading(false));
   }, [isOpen, user]);
   useEffect(() => {
-    if (isOpen && searchInputRef.current)
+    if (false)
       setTimeout(() => searchInputRef.current?.focus(), 100);
   }, [isOpen]);

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:78:18
   }, [isOpen, user]);
   useEffect(() => {
     if (isOpen && searchInputRef.current)
-      setTimeout(() => searchInputRef.current?.focus(), 100);
+      setTimeout(() => undefined, 100);
   }, [isOpen]);
   useEffect(() => {

[NoCoverage] OptionalChaining
src/components/AddToTaskDropdown.tsx:78:24
   }, [isOpen, user]);
   useEffect(() => {
     if (isOpen && searchInputRef.current)
-      setTimeout(() => searchInputRef.current?.focus(), 100);
+      setTimeout(() => searchInputRef.current.focus(), 100);
   }, [isOpen]);
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:80:19
     if (isOpen && searchInputRef.current)
       setTimeout(() => searchInputRef.current?.focus(), 100);
   }, [isOpen]);
-  useEffect(() => {
-    if (!isOpen) setSearchQuery("");
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
   const filteredTasks = tasks.filter((t) =>
     t.name.toLowerCase().includes(searchQuery.toLowerCase()),

[NoCoverage] ConditionalExpression
src/components/AddToTaskDropdown.tsx:81:9
       setTimeout(() => searchInputRef.current?.focus(), 100);
   }, [isOpen]);
   useEffect(() => {
-    if (!isOpen) setSearchQuery("");
+    if (true) setSearchQuery("");
   }, [isOpen]);
   const filteredTasks = tasks.filter((t) =>

[NoCoverage] BooleanLiteral
src/components/AddToTaskDropdown.tsx:81:9
       setTimeout(() => searchInputRef.current?.focus(), 100);
   }, [isOpen]);
   useEffect(() => {
-    if (!isOpen) setSearchQuery("");
+    if (isOpen) setSearchQuery("");
   }, [isOpen]);
   const filteredTasks = tasks.filter((t) =>

[NoCoverage] ArrowFunction
src/components/AddToTaskDropdown.tsx:83:38
   useEffect(() => {
     if (!isOpen) setSearchQuery("");
   }, [isOpen]);
-  const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(searchQuery.toLowerCase()),
+  const filteredTasks = tasks.filter(() => undefined,
   );
   const handleSelect = (id: string, name: string) => {

[NoCoverage] MethodExpression
src/components/AddToTaskDropdown.tsx:83:25
   useEffect(() => {
     if (!isOpen) setSearchQuery("");
   }, [isOpen]);
-  const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(searchQuery.toLowerCase()),
-  );
+  const filteredTasks = tasks;
   const handleSelect = (id: string, name: string) => {
     onSelectTask(id, name);

[NoCoverage] MethodExpression
src/components/AddToTaskDropdown.tsx:84:5
     if (!isOpen) setSearchQuery("");
   }, [isOpen]);
   const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(searchQuery.toLowerCase()),
+    t.name.toUpperCase().includes(searchQuery.toLowerCase()),
   );
   const handleSelect = (id: string, name: string) => {

[NoCoverage] MethodExpression
src/components/AddToTaskDropdown.tsx:84:35
     if (!isOpen) setSearchQuery("");
   }, [isOpen]);
   const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(searchQuery.toLowerCase()),
+    t.name.toLowerCase().includes(searchQuery.toUpperCase()),
   );
   const handleSelect = (id: string, name: string) => {

[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:86:54
   const filteredTasks = tasks.filter((t) =>
     t.name.toLowerCase().includes(searchQuery.toLowerCase()),
   );
-  const handleSelect = (id: string, name: string) => {
-    onSelectTask(id, name);
-    onClose();
-  };
+  const handleSelect = (id: string, name: string) => {};
   const handleCreate = () => {
     onCreateNew();

[NoCoverage] BlockStatement
src/components/AddToTaskDropdown.tsx:90:30
     onSelectTask(id, name);
     onClose();
   };
-  const handleCreate = () => {
-    onCreateNew();
-    onClose();
-  };
+  const handleCreate = () => {};
   if (!isOpen) return null;
   return (
