[Killed] ArrowFunction
src/components/LoginModal.tsx:17:20
   message?: string;
 }
 
-const LoginIntro = () => (
-  <div className="login-modal__intro">
-    <img src="/icons/logo.png" alt="Logo" className="login-modal__intro-logo" />
-    <h2 className="login-modal__intro-title">Logi sisse</h2>
-    <p className="login-modal__intro-description">
-      Sisene oma Google kontoga, et luua ja hallata ülesandeid
-    </p>
-  </div>
-);
+const LoginIntro = () => undefined;
 
 const ErrorDisplay = ({ error }: { error: string }) => (
killedBy: LoginModal rendering renders when open
statusReason: Unable to find an element with the text: Logi sisse. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] ArrowFunction
src/components/LoginModal.tsx:27:22
   </div>
 );
 
-const ErrorDisplay = ({ error }: { error: string }) => (
-  <div className="login-modal__error" role="alert">
-    <ErrorIcon size="md" />
-    <p>{error}</p>
-  </div>
-);
+const ErrorDisplay = () => undefined;
 
 const GoogleIcon = () => (
killedBy: LoginModal login flow shows error on login failure with alert role
statusReason: Unable to find an element with the text: Login failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Survived] ArrowFunction
src/components/LoginModal.tsx:34:20
   </div>
 );
 
-const GoogleIcon = () => (
-  <svg width="20" height="20" viewBox="0 0 24 24" fill="none">
-    <path
-      d="M22.56 12.25c0-.78-.07-1.53-.2-2.25H12v4.26h5.92c-.26 1.37-1.04 2.53-2.21 3.31v2.77h3.57c2.08-1.92 3.28-4.74 3.28-8.09z"
-      fill="#4285F4"
-    />
-    <path
-      d="M12 23c2.97 0 5.46-.98 7.28-2.66l-3.57-2.77c-.98.66-2.23 1.06-3.71 1.06-2.86 0-5.29-1.93-6.16-4.53H2.18v2.84C3.99 20.53 7.7 23 12 23z"
-      fill="#34A853"
-    />
-    <path
-      d="M5.84 14.09c-.22-.66-.35-1.36-.35-2.09s.13-1.43.35-2.09V7.07H2.18C1.43 8.55 1 10.22 1 12s.43 3.45 1.18 4.93l2.85-2.22.81-.62z"
-      fill="#FBBC05"
-    />
-    <path
-      d="M12 5.38c1.62 0 3.06.56 4.21 1.64l3.15-3.15C17.45 2.09 14.97 1 12 1 7.7 1 3.99 3.47 2.18 7.07l3.66 2.84c.87-2.6 3.3-4.53 6.16-4.53z"
-      fill="#EA4335"
-    />
-  </svg>
-);
+const GoogleIcon = () => undefined;
 
 const TaraIcon = () => (

[Survived] ArrowFunction
src/components/LoginModal.tsx:55:18
   </svg>
 );
 
-const TaraIcon = () => (
-  <svg width="20" height="20" viewBox="0 0 24 24" fill="none">
-    <rect width="24" height="24" rx="4" fill="#0066CC" />
-    <text
-      x="12"
-      y="16"
-      textAnchor="middle"
-      fill="white"
-      fontSize="10"
-      fontWeight="bold"
-    >
-      EE
-    </text>
-  </svg>
-);
+const TaraIcon = () => undefined;
 
 export default function LoginModal({ isOpen, onClose }: LoginModalProps) {

[Killed] BlockStatement
src/components/LoginModal.tsx:76:41
   const [error, setError] = useState<string | null>(null);
   const [isLoading, setIsLoading] = useState(false);
 
-  const handleGoogleLogin = async () => {
-    setError(null);
-    setIsLoading(true);
-    try {
-      await login();
-    } catch (err) {
-      setError(
-        err instanceof Error ? err.message : "Sisselogimine ebaõnnestus",
-      );
-      setIsLoading(false);
-    }
-  };
+  const handleGoogleLogin = async () => {};
 
   const handleTaraLogin = () => {
killedBy: LoginModal login flow calls login when Google button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/LoginModal.tsx:79:9
   const handleGoogleLogin = async () => {
     setError(null);
     setIsLoading(true);
-    try {
-      await login();
-    } catch (err) {
+    try {} catch (err) {
       setError(
         err instanceof Error ? err.message : "Sisselogimine ebaõnnestus",
killedBy: LoginModal login flow calls login when Google button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/LoginModal.tsx:81:19
     setIsLoading(true);
     try {
       await login();
-    } catch (err) {
-      setError(
-        err instanceof Error ? err.message : "Sisselogimine ebaõnnestus",
-      );
-      setIsLoading(false);
-    }
+    } catch (err) {}
   };
 
killedBy: LoginModal login flow shows error on login failure with alert role
statusReason: Unable to find an element with the text: Login failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/components/LoginModal.tsx:85:20
       setError(
         err instanceof Error ? err.message : "Sisselogimine ebaõnnestus",
       );
-      setIsLoading(false);
+      setIsLoading(true);
     }
   };
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/LoginModal.tsx:89:33
     }
   };
 
-  const handleTaraLogin = () => {
-    setError(null);
-    setIsLoading(true);
-    loginWithTara();
-  };
+  const handleTaraLogin = () => {};
 
   const handleClose = () => {
killedBy: LoginModal TARA login calls loginWithTara when TARA button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/LoginModal.tsx:95:29
     loginWithTara();
   };
 
-  const handleClose = () => {
-    if (!isLoading) {
-      setError(null);
-      onClose();
-    }
-  };
+  const handleClose = () => {};
 
   if (!isOpen) return null;
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/components/LoginModal.tsx:96:9
   };
 
   const handleClose = () => {
-    if (!isLoading) {
+    if (isLoading) {
       setError(null);
       onClose();
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/LoginModal.tsx:96:9
   };
 
   const handleClose = () => {
-    if (!isLoading) {
+    if (false) {
       setError(null);
       onClose();
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/components/LoginModal.tsx:108:24
     <BaseModal
       isOpen={isOpen}
       onClose={handleClose}
-      showCloseButton={true}
+      showCloseButton={false}
       size="medium"
       className="login-modal"
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  dialog:

  Name "":
  <div

[Killed] ConditionalExpression
src/components/LoginModal.tsx:114:10
     >
       <LoginIntro />
       <div className="login-modal__form">
-        {error && <ErrorDisplay error={error} />}
+        {true}
         <div className="login-modal__actions">
           <button
killedBy: LoginModal login flow shows error on login failure with alert role
statusReason: Unable to find an element with the text: Login failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] LogicalOperator
src/components/LoginModal.tsx:114:10
     >
       <LoginIntro />
       <div className="login-modal__form">
-        {error && <ErrorDisplay error={error} />}
+        {error || <ErrorDisplay error={error} />}
         <div className="login-modal__actions">
           <button
killedBy: LoginModal login flow shows error on login failure with alert role
statusReason: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  dialog:

  Name "":
  <div

[Killed] StringLiteral
src/components/LoginModal.tsx:124:40
             style={{ marginBottom: "0.75rem" }}
           >
             <TaraIcon />
-            {isLoading ? "Suunan..." : "Logi sisse TARA-ga"}
+            {isLoading ? "Suunan..." : ""}
           </button>
           <div
killedBy: LoginModal rendering renders TARA button with correct classes
statusReason: Unable to find an element with the text: /Logi sisse TARA/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Survived] ObjectLiteral
src/components/LoginModal.tsx:128:20
           </button>
           <div
             className="login-modal__divider"
-            style={{
-              display: "flex",
-              alignItems: "center",
-              gap: "1rem",
-              margin: "0.5rem 0",
-            }}
+            style={{}}
           >
             <hr

[Survived] StringLiteral
src/components/LoginModal.tsx:131:20
             style={{
               display: "flex",
               alignItems: "center",
-              gap: "1rem",
+              gap: "",
               margin: "0.5rem 0",
             }}

[Survived] StringLiteral
src/components/LoginModal.tsx:132:23
               display: "flex",
               alignItems: "center",
               gap: "1rem",
-              margin: "0.5rem 0",
+              margin: "",
             }}
           >

[Survived] ObjectLiteral
src/components/LoginModal.tsx:151:22
               või
             </span>
             <hr
-              style={{
-                flex: 1,
-                border: "none",
-                borderTop: "1px solid var(--color-border, #e0e0e0)",
-              }}
+              style={{}}
             />
           </div>

[Survived] StringLiteral
src/components/LoginModal.tsx:154:28
               style={{
                 flex: 1,
                 border: "none",
-                borderTop: "1px solid var(--color-border, #e0e0e0)",
+                borderTop: "",
               }}
             />
