[Killed] ConditionalExpression
src/components/AppModals.tsx:88:8
         onUseVariant={onUseVariant}
         customPhoneticForm={variants.variantsCustomPhonetic}
       />
-      {variants.sentencePhoneticId && (
-        <SentencePhoneticPanel
-          sentenceText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.text || ""
-          }
-          phoneticText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.phoneticText || null
-          }
-          isOpen={variants.showSentencePhoneticPanel}
-          onClose={variants.handleCloseSentencePhonetic}
-          onApply={(newPhoneticText) => {
-            synthesis.handleSentencePhoneticApply(
-              variants.sentencePhoneticId!,
-              newPhoneticText,
-            );
-            showNotification("success", "Lause uus häälduskuju rakendatud");
-          }}
-        />
-      )}
+      {true}
       <AddEntryModal
         isOpen={taskHandlers.showAddTaskModal}
killedBy: AppModals renders phonetic panel and applies changes
statusReason: Unable to find an element with the text: Apply. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/AppModals.tsx:88:8
         onUseVariant={onUseVariant}
         customPhoneticForm={variants.variantsCustomPhonetic}
       />
-      {variants.sentencePhoneticId && (
-        <SentencePhoneticPanel
-          sentenceText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.text || ""
-          }
-          phoneticText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.phoneticText || null
-          }
-          isOpen={variants.showSentencePhoneticPanel}
-          onClose={variants.handleCloseSentencePhonetic}
-          onApply={(newPhoneticText) => {
-            synthesis.handleSentencePhoneticApply(
-              variants.sentencePhoneticId!,
-              newPhoneticText,
-            );
-            showNotification("success", "Lause uus häälduskuju rakendatud");
-          }}
-        />
-      )}
+      {false}
       <AddEntryModal
         isOpen={taskHandlers.showAddTaskModal}
killedBy: AppModals renders phonetic panel and applies changes
statusReason: Unable to find an element with the text: Apply. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ConditionalExpression
src/components/AppModals.tsx:91:13
       {variants.sentencePhoneticId && (
         <SentencePhoneticPanel
           sentenceText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.text || ""
+            true
           }
           phoneticText={

[Survived] LogicalOperator
src/components/AppModals.tsx:91:13
       {variants.sentencePhoneticId && (
         <SentencePhoneticPanel
           sentenceText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.text || ""
+            synthesis.sentences.find(s => s.id === variants.sentencePhoneticId)?.text && ""
           }
           phoneticText={

[Survived] ArrowFunction
src/components/AppModals.tsx:92:15
         <SentencePhoneticPanel
           sentenceText={
             synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
+              () => undefined,
             )?.text || ""
           }

[Survived] ConditionalExpression
src/components/AppModals.tsx:92:22
         <SentencePhoneticPanel
           sentenceText={
             synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
+              (s) => false,
             )?.text || ""
           }

[Survived] ConditionalExpression
src/components/AppModals.tsx:96:13
             )?.text || ""
           }
           phoneticText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.phoneticText || null
+            true
           }
           isOpen={variants.showSentencePhoneticPanel}

[Survived] ConditionalExpression
src/components/AppModals.tsx:96:13
             )?.text || ""
           }
           phoneticText={
-            synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
-            )?.phoneticText || null
+            false
           }
           isOpen={variants.showSentencePhoneticPanel}

[Survived] EqualityOperator
src/components/AppModals.tsx:97:22
           }
           phoneticText={
             synthesis.sentences.find(
-              (s) => s.id === variants.sentencePhoneticId,
+              (s) => s.id !== variants.sentencePhoneticId,
             )?.phoneticText || null
           }

[Killed] BlockStatement
src/components/AppModals.tsx:102:41
           }
           isOpen={variants.showSentencePhoneticPanel}
           onClose={variants.handleCloseSentencePhonetic}
-          onApply={(newPhoneticText) => {
-            synthesis.handleSentencePhoneticApply(
-              variants.sentencePhoneticId!,
-              newPhoneticText,
-            );
-            showNotification("success", "Lause uus häälduskuju rakendatud");
-          }}
+          onApply={(newPhoneticText) => {}}
         />
       )}
killedBy: AppModals renders phonetic panel and applies changes
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', 'te`re' ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/AppModals.tsx:113:57
       )}
       <AddEntryModal
         isOpen={taskHandlers.showAddTaskModal}
-        onClose={() => taskHandlers.setShowAddTaskModal(false)}
+        onClose={() => taskHandlers.setShowAddTaskModal(true)}
         onAdd={taskHandlers.handleAddTask}
       />
killedBy: AppModals closes add modal
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[Killed] ArrowFunction
src/components/AppModals.tsx:113:18
       )}
       <AddEntryModal
         isOpen={taskHandlers.showAddTaskModal}
-        onClose={() => taskHandlers.setShowAddTaskModal(false)}
+        onClose={() => undefined}
         onAdd={taskHandlers.handleAddTask}
       />
killedBy: AppModals closes add modal
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/AppModals.tsx:116:8
         onClose={() => taskHandlers.setShowAddTaskModal(false)}
         onAdd={taskHandlers.handleAddTask}
       />
-      {taskHandlers.taskToEdit && (
-        <TaskEditModal
-          isOpen={taskHandlers.showTaskEditModal}
-          task={taskHandlers.taskToEdit}
-          onClose={() => {
-            taskHandlers.setShowTaskEditModal(false);
-            taskHandlers.setTaskToEdit(null);
-          }}
-          onSave={async (updatedTask) => {
-            await taskHandlers.handleTaskUpdated(updatedTask);
-          }}
-          setTaskToEdit={taskHandlers.setTaskToEdit}
-        />
-      )}
+      {true}
       {taskHandlers.taskToShare && (
         <ShareTaskModal
killedBy: AppModals renders edit modal when taskToEdit and showTaskEditModal
statusReason: Unable to find an element by: [data-testid="edit-modal"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/AppModals.tsx:116:8
         onClose={() => taskHandlers.setShowAddTaskModal(false)}
         onAdd={taskHandlers.handleAddTask}
       />
-      {taskHandlers.taskToEdit && (
-        <TaskEditModal
-          isOpen={taskHandlers.showTaskEditModal}
-          task={taskHandlers.taskToEdit}
-          onClose={() => {
-            taskHandlers.setShowTaskEditModal(false);
-            taskHandlers.setTaskToEdit(null);
-          }}
-          onSave={async (updatedTask) => {
-            await taskHandlers.handleTaskUpdated(updatedTask);
-          }}
-          setTaskToEdit={taskHandlers.setTaskToEdit}
-        />
-      )}
+      {false}
       {taskHandlers.taskToShare && (
         <ShareTaskModal
killedBy: AppModals renders edit modal when taskToEdit and showTaskEditModal
statusReason: Unable to find an element by: [data-testid="edit-modal"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/AppModals.tsx:120:26
         <TaskEditModal
           isOpen={taskHandlers.showTaskEditModal}
           task={taskHandlers.taskToEdit}
-          onClose={() => {
-            taskHandlers.setShowTaskEditModal(false);
-            taskHandlers.setTaskToEdit(null);
-          }}
+          onClose={() => {}}
           onSave={async (updatedTask) => {
             await taskHandlers.handleTaskUpdated(updatedTask);
killedBy: AppModals closes edit modal and clears taskToEdit
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/AppModals.tsx:121:47
           isOpen={taskHandlers.showTaskEditModal}
           task={taskHandlers.taskToEdit}
           onClose={() => {
-            taskHandlers.setShowTaskEditModal(false);
+            taskHandlers.setShowTaskEditModal(true);
             taskHandlers.setTaskToEdit(null);
           }}
killedBy: AppModals closes edit modal and clears taskToEdit
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[NoCoverage] BlockStatement
src/components/AppModals.tsx:124:42
             taskHandlers.setShowTaskEditModal(false);
             taskHandlers.setTaskToEdit(null);
           }}
-          onSave={async (updatedTask) => {
-            await taskHandlers.handleTaskUpdated(updatedTask);
-          }}
+          onSave={async (updatedTask) => {}}
           setTaskToEdit={taskHandlers.setTaskToEdit}
         />

[Killed] ConditionalExpression
src/components/AppModals.tsx:130:8
           setTaskToEdit={taskHandlers.setTaskToEdit}
         />
       )}
-      {taskHandlers.taskToShare && (
-        <ShareTaskModal
-          isOpen={taskHandlers.showShareTaskModal}
-          shareToken={taskHandlers.taskToShare.shareToken || ""}
-          taskName={taskHandlers.taskToShare.name}
-          onClose={() => {
-            taskHandlers.setShowShareTaskModal(false);
-            taskHandlers.setTaskToShare(null);
-          }}
-        />
-      )}
+      {true}
       <LoginModal
         isOpen={showLoginModal}
killedBy: AppModals closes share modal and clears taskToShare
statusReason: Unable to find an element with the text: Close Share. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/AppModals.tsx:130:8
           setTaskToEdit={taskHandlers.setTaskToEdit}
         />
       )}
-      {taskHandlers.taskToShare && (
-        <ShareTaskModal
-          isOpen={taskHandlers.showShareTaskModal}
-          shareToken={taskHandlers.taskToShare.shareToken || ""}
-          taskName={taskHandlers.taskToShare.name}
-          onClose={() => {
-            taskHandlers.setShowShareTaskModal(false);
-            taskHandlers.setTaskToShare(null);
-          }}
-        />
-      )}
+      {false}
       <LoginModal
         isOpen={showLoginModal}
killedBy: AppModals closes share modal and clears taskToShare
statusReason: Unable to find an element with the text: Close Share. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ConditionalExpression
src/components/AppModals.tsx:133:23
       {taskHandlers.taskToShare && (
         <ShareTaskModal
           isOpen={taskHandlers.showShareTaskModal}
-          shareToken={taskHandlers.taskToShare.shareToken || ""}
+          shareToken={true}
           taskName={taskHandlers.taskToShare.name}
           onClose={() => {

[Survived] LogicalOperator
src/components/AppModals.tsx:133:23
       {taskHandlers.taskToShare && (
         <ShareTaskModal
           isOpen={taskHandlers.showShareTaskModal}
-          shareToken={taskHandlers.taskToShare.shareToken || ""}
+          shareToken={taskHandlers.taskToShare.shareToken && ""}
           taskName={taskHandlers.taskToShare.name}
           onClose={() => {

[Killed] BlockStatement
src/components/AppModals.tsx:135:26
           isOpen={taskHandlers.showShareTaskModal}
           shareToken={taskHandlers.taskToShare.shareToken || ""}
           taskName={taskHandlers.taskToShare.name}
-          onClose={() => {
-            taskHandlers.setShowShareTaskModal(false);
-            taskHandlers.setTaskToShare(null);
-          }}
+          onClose={() => {}}
         />
       )}
killedBy: AppModals closes share modal and clears taskToShare
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/AppModals.tsx:136:48
           shareToken={taskHandlers.taskToShare.shareToken || ""}
           taskName={taskHandlers.taskToShare.name}
           onClose={() => {
-            taskHandlers.setShowShareTaskModal(false);
+            taskHandlers.setShowShareTaskModal(true);
             taskHandlers.setTaskToShare(null);
           }}
killedBy: AppModals closes share modal and clears taskToShare
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[Killed] BooleanLiteral
src/components/AppModals.tsx:143:42
       )}
       <LoginModal
         isOpen={showLoginModal}
-        onClose={() => setShowLoginModal(false)}
+        onClose={() => setShowLoginModal(true)}
         message="Sisene, et luua ja hallata ülesandeid"
       />
killedBy: AppModals closes login modal
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[Killed] ArrowFunction
src/components/AppModals.tsx:143:18
       )}
       <LoginModal
         isOpen={showLoginModal}
-        onClose={() => setShowLoginModal(false)}
+        onClose={() => undefined}
         message="Sisene, et luua ja hallata ülesandeid"
       />
killedBy: AppModals closes login modal
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] OptionalChaining
src/components/AppModals.tsx:149:58
       <ConfirmationModal
         isOpen={taskHandlers.showDeleteConfirmation}
         title="Kustuta ülesanne"
-        message={`Kas oled kindel, et soovid ülesande "${taskHandlers.taskToDelete?.name}" kustutada?`}
+        message={`Kas oled kindel, et soovid ülesande "${taskHandlers.taskToDelete.name}" kustutada?`}
         confirmText="Kustuta"
         cancelText="Tühista"
killedBy: AppModals renders nothing visible by default
statusReason: Cannot read properties of null (reading 'name')

[Killed] LogicalOperator
src/components/AppModals.tsx:156:8
         onCancel={taskHandlers.handleCancelDelete}
         variant="danger"
       />
-      {isWizardActive && <OnboardingWizard />}
+      {isWizardActive || <OnboardingWizard />}
     </>
   );
killedBy: AppModals renders nothing visible by default
statusReason: expected '<div data-testid="wizard">Wizard</div>' to be '' // Object.is equality

[Killed] ConditionalExpression
src/components/AppModals.tsx:156:8
         onCancel={taskHandlers.handleCancelDelete}
         variant="danger"
       />
-      {isWizardActive && <OnboardingWizard />}
+      {false}
     </>
   );
killedBy: AppModals renders wizard when isWizardActive
statusReason: Unable to find an element by: [data-testid="wizard"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
