[Killed] BlockStatement
src/validation.ts:16:19
 export function createResponse(
   statusCode: number,
   body: object,
-): LambdaResponse {
-  return {
-    statusCode,
-    body: JSON.stringify(body),
-    headers: {
-      "Content-Type": "application/json",
-      "Access-Control-Allow-Origin": "*",
-      "Access-Control-Allow-Headers": "Content-Type,Authorization",
-      "Access-Control-Allow-Methods": "GET,POST,OPTIONS",
-    },
-  };
-}
+): LambdaResponse {}
 
 export function ensureInitialized(): void {
killedBy: analyzeHandler should return 400 if body is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/validation.ts:29:43
   };
 }
 
-export function ensureInitialized(): void {
-  if (!isInitialized()) initVmetajson(VMETAJSON_PATH, DICT_PATH);
-}
+export function ensureInitialized(): void {}
 
 export function parseJsonBody(eventBody: string | null): unknown {
killedBy: analyzeHandler should initialize vmetajson if not initialized
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/validation.ts:30:7
 }
 
 export function ensureInitialized(): void {
-  if (!isInitialized()) initVmetajson(VMETAJSON_PATH, DICT_PATH);
+  if (isInitialized()) initVmetajson(VMETAJSON_PATH, DICT_PATH);
 }
 
killedBy: analyzeHandler should initialize vmetajson if not initialized
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/validation.ts:30:7
 }
 
 export function ensureInitialized(): void {
-  if (!isInitialized()) initVmetajson(VMETAJSON_PATH, DICT_PATH);
+  if (false) initVmetajson(VMETAJSON_PATH, DICT_PATH);
 }
 
killedBy: analyzeHandler should initialize vmetajson if not initialized
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/validation.ts:33:66
   if (!isInitialized()) initVmetajson(VMETAJSON_PATH, DICT_PATH);
 }
 
-export function parseJsonBody(eventBody: string | null): unknown {
-  if (eventBody === null) return null;
-
-  try {
-    return JSON.parse(eventBody);
-  } catch {
-    return null;
-  }
-}
+export function parseJsonBody(eventBody: string | null): unknown {}
 
 export function getFieldError(
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] EqualityOperator
src/validation.ts:34:7
 }
 
 export function parseJsonBody(eventBody: string | null): unknown {
-  if (eventBody === null) return null;
+  if (eventBody !== null) return null;
 
   try {
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Invalid JSON"

[Killed] ConditionalExpression
src/validation.ts:34:7
 }
 
 export function parseJsonBody(eventBody: string | null): unknown {
-  if (eventBody === null) return null;
+  if (true) return null;
 
   try {
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Invalid JSON"

[Killed] BlockStatement
src/validation.ts:36:7
 export function parseJsonBody(eventBody: string | null): unknown {
   if (eventBody === null) return null;
 
-  try {
-    return JSON.parse(eventBody);
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/validation.ts:38:11
 
   try {
     return JSON.parse(eventBody);
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: analyzeHandler should return 400 for invalid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/validation.ts:47:18
   fieldValue: unknown,
   fieldName: string,
   maxLength?: number,
-): string | null {
-  if (fieldValue === null || typeof fieldValue !== "string")
-    return `Missing '${fieldName}' field in request body`;
-
-  if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
-
-  if (maxLength != null && fieldValue.length > maxLength)
-    return `Text is too long (max ${String(maxLength)} characters)`;
-  return null;
-}
+): string | null {}
 
 export function validateField(
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/validation.ts:48:30
   fieldName: string,
   maxLength?: number,
 ): string | null {
-  if (fieldValue === null || typeof fieldValue !== "string")
+  if (fieldValue === null || false)
     return `Missing '${fieldName}' field in request body`;
 
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/validation.ts:48:7
   fieldName: string,
   maxLength?: number,
 ): string | null {
-  if (fieldValue === null || typeof fieldValue !== "string")
+  if (false)
     return `Missing '${fieldName}' field in request body`;
 
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/validation.ts:51:7
   if (fieldValue === null || typeof fieldValue !== "string")
     return `Missing '${fieldName}' field in request body`;
 
-  if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
+  if (true) return `'${fieldName}' must be a non-empty string`;
 
   if (maxLength != null && fieldValue.length > maxLength)
killedBy: validation getFieldError should return error for string exceeding maxLength
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "too long"
Received string:    "'text' must be a non-empty string"

[Killed] MethodExpression
src/validation.ts:51:8
   if (fieldValue === null || typeof fieldValue !== "string")
     return `Missing '${fieldName}' field in request body`;
 
-  if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
+  if (!fieldValue) return `'${fieldName}' must be a non-empty string`;
 
   if (maxLength != null && fieldValue.length > maxLength)
killedBy: analyzeHandler should return 400 if text is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] EqualityOperator
src/validation.ts:53:28
 
   if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
 
-  if (maxLength != null && fieldValue.length > maxLength)
+  if (maxLength != null && fieldValue.length >= maxLength)
     return `Text is too long (max ${String(maxLength)} characters)`;
   return null;
killedBy: validation getFieldError should return null for string at exactly maxLength
statusReason: Error: expect(received).toBeNull()

Received: "Text is too long (max 10 characters)"

[Killed] EqualityOperator
src/validation.ts:53:7
 
   if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
 
-  if (maxLength != null && fieldValue.length > maxLength)
+  if (maxLength == null && fieldValue.length > maxLength)
     return `Text is too long (max ${String(maxLength)} characters)`;
   return null;
killedBy: validation getFieldError should return error for string exceeding maxLength
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] StringLiteral
src/validation.ts:54:12
   if (!fieldValue.trim()) return `'${fieldName}' must be a non-empty string`;
 
   if (maxLength != null && fieldValue.length > maxLength)
-    return `Text is too long (max ${String(maxLength)} characters)`;
+    return ``;
   return null;
 }
killedBy: validation getFieldError should return error for string exceeding maxLength
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "too long"
Received string:    ""

[Killed] BlockStatement
src/validation.ts:62:42
   body: Record<string, unknown>,
   fieldName: string,
   maxLength?: number,
-): { value: string } | { error: string } {
-  const error = getFieldError(body[fieldName], fieldName, maxLength);
-  if (error !== null) return { error };
-  return { value: (body[fieldName] as string).trim() };
-}
+): { value: string } | { error: string } {}
 
killedBy: validation validateField should return value for valid field
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"value": "hello"}
Received: undefined

[Killed] EqualityOperator
src/validation.ts:64:7
   maxLength?: number,
 ): { value: string } | { error: string } {
   const error = getFieldError(body[fieldName], fieldName, maxLength);
-  if (error !== null) return { error };
+  if (error === null) return { error };
   return { value: (body[fieldName] as string).trim() };
 }
killedBy: validation validateField should return value for valid field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": "hello",
+   "error": null,

[Killed] ConditionalExpression
src/validation.ts:64:7
   maxLength?: number,
 ): { value: string } | { error: string } {
   const error = getFieldError(body[fieldName], fieldName, maxLength);
-  if (error !== null) return { error };
+  if (true) return { error };
   return { value: (body[fieldName] as string).trim() };
 }
killedBy: validation validateField should return value for valid field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": "hello",
+   "error": null,

[Killed] MethodExpression
src/validation.ts:65:19
 ): { value: string } | { error: string } {
   const error = getFieldError(body[fieldName], fieldName, maxLength);
   if (error !== null) return { error };
-  return { value: (body[fieldName] as string).trim() };
+  return { value: body[fieldName] as string };
 }
 
killedBy: validation validateField should trim the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": "hello",
+   "value": "  hello  ",
