[Killed] LogicalOperator
src/components/BaseModal.tsx:36:6
   titleId: string;
 }) => (
   <div className={headerClasses}>
-    {title && (
-      <h2 id={titleId} className="base-modal__title">
-        {title}
-      </h2>
-    )}
+    {title || <h2 id={titleId} className="base-modal__title">
+        {title}
+      </h2>}
     {showCloseButton && (
       <button
killedBy: BaseModal renders without title
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h2
  class="base-modal__title"
  id="_r_5_"
/> instead

[Killed] ConditionalExpression
src/components/BaseModal.tsx:36:6
   titleId: string;
 }) => (
   <div className={headerClasses}>
-    {title && (
-      <h2 id={titleId} className="base-modal__title">
-        {title}
-      </h2>
-    )}
+    {true}
     {showCloseButton && (
       <button
killedBy: TaskEditModal rendering renders when open with task
statusReason: Unable to find an element with the text: Muuda ülesannet. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/components/BaseModal.tsx:41:6
         {title}
       </h2>
     )}
-    {showCloseButton && (
-      <button
-        onClick={onClose}
-        className="base-modal__close"
-        aria-label="Sulge"
-        type="button"
-      >
-        <CloseIcon size="2xl" />
-      </button>
-    )}
+    {false}
   </div>
 );
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  dialog:

  Name "":
  <div

[Killed] LogicalOperator
src/components/BaseModal.tsx:41:6
         {title}
       </h2>
     )}
-    {showCloseButton && (
-      <button
-        onClick={onClose}
-        className="base-modal__close"
-        aria-label="Sulge"
-        type="button"
-      >
-        <CloseIcon size="2xl" />
-      </button>
-    )}
+    {showCloseButton || <button onClick={onClose} className="base-modal__close" aria-label="Sulge" type="button">
+        <CloseIcon size="2xl" />
+      </button>}
   </div>
 );
killedBy: LoginModal handleClose closes when not loading and clears error
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  dialog:

  Name "":
  <div

[Killed] BooleanLiteral
src/components/BaseModal.tsx:58:21
   isOpen,
   onClose,
   title,
-  showCloseButton = true,
+  showCloseButton = false,
   size = "medium",
   children,
killedBy: BaseModal calls onClose via close button and backdrop but not content click
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  dialog:

  Name "Test Modal":
  <div

[Killed] StringLiteral
src/components/BaseModal.tsx:59:10
   onClose,
   title,
   showCloseButton = true,
-  size = "medium",
+  size = "",
   children,
   className = "",
killedBy: BaseModal applies size classes and defaults to medium
statusReason: expected null to be truthy

[Survived] StringLiteral
src/components/BaseModal.tsx:62:21
   size = "medium",
   children,
   className = "",
-  headerClassName = "",
+  headerClassName = "Stryker was here!",
   contentClassName = "",
   preventBackdropClose = false,

[Killed] BooleanLiteral
src/components/BaseModal.tsx:64:26
   className = "",
   headerClassName = "",
   contentClassName = "",
-  preventBackdropClose = false,
+  preventBackdropClose = true,
 }: BaseModalProps) {
   const modalRef = useRef<HTMLDivElement>(null);
killedBy: BaseModal calls onClose via close button and backdrop but not content click
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] BlockStatement
src/components/BaseModal.tsx:72:19
   const titleId = useId();
 
   // Keep the onClose ref updated to avoid stale closures
-  useEffect(() => {
-    onCloseRef.current = onClose;
-  }, [onClose]);
+  useEffect(() => {}, [onClose]);
 
   useEffect(() => {

[Killed] ConditionalExpression
src/components/BaseModal.tsx:77:9
   }, [onClose]);
 
   useEffect(() => {
-    if (!isOpen) return;
+    if (false) return;
 
     // Store the previously focused element
killedBy: BaseModal restores body overflow to unset on close, backdrop has aria-hidden
statusReason: expected 'hidden' to be 'unset' // Object.is equality

[Killed] ConditionalExpression
src/components/BaseModal.tsx:77:9
   }, [onClose]);
 
   useEffect(() => {
-    if (!isOpen) return;
+    if (true) return;
 
     // Store the previously focused element
killedBy: BaseModal closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/BaseModal.tsx:82:48
     // Store the previously focused element
     previousFocusRef.current = document.activeElement as HTMLElement;
 
-    const handleEscape = (e: KeyboardEvent) => {
-      if (e.key === "Escape") onCloseRef.current();
-    };
+    const handleEscape = (e: KeyboardEvent) => {};
 
     // Focus trap - keep focus within modal
killedBy: BaseModal closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/components/BaseModal.tsx:83:11
     previousFocusRef.current = document.activeElement as HTMLElement;
 
     const handleEscape = (e: KeyboardEvent) => {
-      if (e.key === "Escape") onCloseRef.current();
+      if (e.key !== "Escape") onCloseRef.current();
     };
 
killedBy: BaseModal closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/BaseModal.tsx:83:11
     previousFocusRef.current = document.activeElement as HTMLElement;
 
     const handleEscape = (e: KeyboardEvent) => {
-      if (e.key === "Escape") onCloseRef.current();
+      if (false) onCloseRef.current();
     };
 
killedBy: BaseModal closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/components/BaseModal.tsx:87:48
     };
 
     // Focus trap - keep focus within modal
-    const handleTabKey = (e: KeyboardEvent) => {
-      if (e.key !== "Tab" || !modalRef.current) return;
-
-      const focusableElements = modalRef.current.querySelectorAll<HTMLElement>(
-        'button:not([disabled]), [href], input:not([disabled]), select:not([disabled]), textarea:not([disabled]), [tabindex]:not([tabindex="-1"])',
-      );
-
-      if (focusableElements.length === 0) return;
-
-      const firstElement = focusableElements[0];
-      const lastElement = focusableElements[focusableElements.length - 1];
-
-      if (!firstElement || !lastElement) return;
-
-      if (e.shiftKey && document.activeElement === firstElement) {
-        e.preventDefault();
-        lastElement.focus();
-      } else if (!e.shiftKey && document.activeElement === lastElement) {
-        e.preventDefault();
-        firstElement.focus();
-      }
-    };
+    const handleTabKey = (e: KeyboardEvent) => {};
 
     document.addEventListener("keydown", handleEscape);

[Killed] EqualityOperator
src/components/BaseModal.tsx:88:11
 
     // Focus trap - keep focus within modal
     const handleTabKey = (e: KeyboardEvent) => {
-      if (e.key !== "Tab" || !modalRef.current) return;
+      if (e.key === "Tab" || !modalRef.current) return;
 
       const focusableElements = modalRef.current.querySelectorAll<HTMLElement>(
killedBy: AddEntryModal input handling allows entering description
statusReason: expect(element).toHaveValue(Test description)

Expected the element to have value:
  Test description
Received:

[Killed] ConditionalExpression
src/components/BaseModal.tsx:88:11
 
     // Focus trap - keep focus within modal
     const handleTabKey = (e: KeyboardEvent) => {
-      if (e.key !== "Tab" || !modalRef.current) return;
+      if (false) return;
 
       const focusableElements = modalRef.current.querySelectorAll<HTMLElement>(
killedBy: AddEntryModal input handling allows entering description
statusReason: expect(element).toHaveValue(Test description)

Expected the element to have value:
  Test description
Received:

[Survived] EqualityOperator
src/components/BaseModal.tsx:94:11
         'button:not([disabled]), [href], input:not([disabled]), select:not([disabled]), textarea:not([disabled]), [tabindex]:not([tabindex="-1"])',
       );
 
-      if (focusableElements.length === 0) return;
+      if (focusableElements.length !== 0) return;
 
       const firstElement = focusableElements[0];

[Survived] ConditionalExpression
src/components/BaseModal.tsx:94:11
         'button:not([disabled]), [href], input:not([disabled]), select:not([disabled]), textarea:not([disabled]), [tabindex]:not([tabindex="-1"])',
       );
 
-      if (focusableElements.length === 0) return;
+      if (true) return;
 
       const firstElement = focusableElements[0];

[Survived] ArithmeticOperator
src/components/BaseModal.tsx:97:45
       if (focusableElements.length === 0) return;
 
       const firstElement = focusableElements[0];
-      const lastElement = focusableElements[focusableElements.length - 1];
+      const lastElement = focusableElements[focusableElements.length + 1];
 
       if (!firstElement || !lastElement) return;

[Survived] LogicalOperator
src/components/BaseModal.tsx:99:11
       const firstElement = focusableElements[0];
       const lastElement = focusableElements[focusableElements.length - 1];
 
-      if (!firstElement || !lastElement) return;
+      if (!firstElement && !lastElement) return;
 
       if (e.shiftKey && document.activeElement === firstElement) {

[Survived] ConditionalExpression
src/components/BaseModal.tsx:99:11
       const firstElement = focusableElements[0];
       const lastElement = focusableElements[focusableElements.length - 1];
 
-      if (!firstElement || !lastElement) return;
+      if (true) return;
 
       if (e.shiftKey && document.activeElement === firstElement) {

[Survived] LogicalOperator
src/components/BaseModal.tsx:101:11
 
       if (!firstElement || !lastElement) return;
 
-      if (e.shiftKey && document.activeElement === firstElement) {
+      if (e.shiftKey || document.activeElement === firstElement) {
         e.preventDefault();
         lastElement.focus();

[NoCoverage] BlockStatement
src/components/BaseModal.tsx:101:66
 
       if (!firstElement || !lastElement) return;
 
-      if (e.shiftKey && document.activeElement === firstElement) {
-        e.preventDefault();
-        lastElement.focus();
-      } else if (!e.shiftKey && document.activeElement === lastElement) {
+      if (e.shiftKey && document.activeElement === firstElement) {} else if (!e.shiftKey && document.activeElement === lastElement) {
         e.preventDefault();
         firstElement.focus();

[Survived] ConditionalExpression
src/components/BaseModal.tsx:104:18
       if (e.shiftKey && document.activeElement === firstElement) {
         e.preventDefault();
         lastElement.focus();
-      } else if (!e.shiftKey && document.activeElement === lastElement) {
+      } else if (true) {
         e.preventDefault();
         firstElement.focus();

[Survived] EqualityOperator
src/components/BaseModal.tsx:104:33
       if (e.shiftKey && document.activeElement === firstElement) {
         e.preventDefault();
         lastElement.focus();
-      } else if (!e.shiftKey && document.activeElement === lastElement) {
+      } else if (!e.shiftKey && document.activeElement !== lastElement) {
         e.preventDefault();
         firstElement.focus();

[Killed] StringLiteral
src/components/BaseModal.tsx:112:36
 
     document.addEventListener("keydown", handleEscape);
     document.addEventListener("keydown", handleTabKey);
-    document.body.style.overflow = "hidden";
+    document.body.style.overflow = "";
 
     // Focus the modal or first focusable element
killedBy: BaseModal has correct aria attributes and body overflow
statusReason: expected '' to be 'hidden' // Object.is equality

[Survived] BlockStatement
src/components/BaseModal.tsx:115:33
     document.body.style.overflow = "hidden";
 
     // Focus the modal or first focusable element
-    requestAnimationFrame(() => {
-      const firstFocusable = modalRef.current?.querySelector<HTMLElement>(
-        'button:not([disabled]), [href], input:not([disabled]), select:not([disabled]), textarea:not([disabled]), [tabindex]:not([tabindex="-1"])',
-      );
-      firstFocusable?.focus();
-    });
+    requestAnimationFrame(() => {});
 
     return () => {

[Killed] BlockStatement
src/components/BaseModal.tsx:122:18
       firstFocusable?.focus();
     });
 
-    return () => {
-      document.removeEventListener("keydown", handleEscape);
-      document.removeEventListener("keydown", handleTabKey);
-      document.body.style.overflow = "unset";
-
-      // Restore focus to previously focused element
-      previousFocusRef.current?.focus();
-    };
+    return () => {};
   }, [isOpen]);
 
killedBy: BaseModal restores body overflow to unset on close, backdrop has aria-hidden
statusReason: expected 'hidden' to be 'unset' // Object.is equality

[Survived] StringLiteral
src/components/BaseModal.tsx:123:36
     });
 
     return () => {
-      document.removeEventListener("keydown", handleEscape);
+      document.removeEventListener("", handleEscape);
       document.removeEventListener("keydown", handleTabKey);
       document.body.style.overflow = "unset";

[Survived] OptionalChaining
src/components/BaseModal.tsx:128:7
       document.body.style.overflow = "unset";
 
       // Restore focus to previously focused element
-      previousFocusRef.current?.focus();
+      previousFocusRef.current.focus();
     };
   }, [isOpen]);

[Killed] ArrayDeclaration
src/components/BaseModal.tsx:130:6
       // Restore focus to previously focused element
       previousFocusRef.current?.focus();
     };
-  }, [isOpen]);
+  }, []);
 
   if (!isOpen) return null;
killedBy: BaseModal restores body overflow to unset on close, backdrop has aria-hidden
statusReason: expected 'hidden' to be 'unset' // Object.is equality

[Killed] BooleanLiteral
src/components/BaseModal.tsx:132:7
     };
   }, [isOpen]);
 
-  if (!isOpen) return null;
+  if (isOpen) return null;
   const handleBackdropClick = (e: React.MouseEvent) => {
     if (!preventBackdropClose && e.target === e.currentTarget) onClose();
killedBy: AddEntryModal rendering renders when open
statusReason: Unable to find an element with the placeholder text of: Pealkiri (Kohustuslik)

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div />
</body>

[Killed] ConditionalExpression
src/components/BaseModal.tsx:132:7
     };
   }, [isOpen]);
 
-  if (!isOpen) return null;
+  if (true) return null;
   const handleBackdropClick = (e: React.MouseEvent) => {
     if (!preventBackdropClose && e.target === e.currentTarget) onClose();
killedBy: AddEntryModal rendering renders when open
statusReason: Unable to find an element with the placeholder text of: Pealkiri (Kohustuslik)

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div />
</body>

[Killed] BlockStatement
src/components/BaseModal.tsx:133:56
   }, [isOpen]);
 
   if (!isOpen) return null;
-  const handleBackdropClick = (e: React.MouseEvent) => {
-    if (!preventBackdropClose && e.target === e.currentTarget) onClose();
-  };
+  const handleBackdropClick = (e: React.MouseEvent) => {};
   const modalClasses = `base-modal base-modal--${size} ${className}`.trim();
 
killedBy: BaseModal calls onClose via close button and backdrop but not content click
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/components/BaseModal.tsx:134:9
 
   if (!isOpen) return null;
   const handleBackdropClick = (e: React.MouseEvent) => {
-    if (!preventBackdropClose && e.target === e.currentTarget) onClose();
+    if (true) onClose();
   };
   const modalClasses = `base-modal base-modal--${size} ${className}`.trim();
killedBy: BaseModal prevents backdrop close when preventBackdropClose is true
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] LogicalOperator
src/components/BaseModal.tsx:134:9
 
   if (!isOpen) return null;
   const handleBackdropClick = (e: React.MouseEvent) => {
-    if (!preventBackdropClose && e.target === e.currentTarget) onClose();
+    if (!preventBackdropClose || e.target === e.currentTarget) onClose();
   };
   const modalClasses = `base-modal base-modal--${size} ${className}`.trim();
killedBy: BaseModal prevents backdrop close when preventBackdropClose is true
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Survived] MethodExpression
src/components/BaseModal.tsx:136:24
   const handleBackdropClick = (e: React.MouseEvent) => {
     if (!preventBackdropClose && e.target === e.currentTarget) onClose();
   };
-  const modalClasses = `base-modal base-modal--${size} ${className}`.trim();
+  const modalClasses = `base-modal base-modal--${size} ${className}`;
 
   return (

[Killed] StringLiteral
src/components/BaseModal.tsx:136:24
   const handleBackdropClick = (e: React.MouseEvent) => {
     if (!preventBackdropClose && e.target === e.currentTarget) onClose();
   };
-  const modalClasses = `base-modal base-modal--${size} ${className}`.trim();
+  const modalClasses = ``.trim();
 
   return (
killedBy: BaseModal applies size classes and defaults to medium
statusReason: expected null to be truthy

[Killed] ConditionalExpression
src/components/BaseModal.tsx:152:10
         aria-modal="true"
         aria-labelledby={title ? titleId : undefined}
       >
-        {(title !== null || showCloseButton) && (
-          <ModalHeader
-            title={title}
-            showCloseButton={showCloseButton}
-            onClose={onClose}
-            headerClasses={`base-modal__header ${headerClassName}`.trim()}
-            titleId={titleId}
-          />
-        )}
+        {true}
         <div className={`base-modal__content ${contentClassName}`.trim()}>
           {children}
killedBy: BaseModal renders nothing when closed, renders content when open
statusReason: Unable to find an element with the text: Test Modal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] EqualityOperator
src/components/BaseModal.tsx:152:11
         aria-modal="true"
         aria-labelledby={title ? titleId : undefined}
       >
-        {(title !== null || showCloseButton) && (
+        {(title === null || showCloseButton) && (
           <ModalHeader
             title={title}
killedBy: BaseModal header visibility depends on title and showCloseButton
statusReason: expected <div class="base-modal__header"></div> to be null

[Survived] MethodExpression
src/components/BaseModal.tsx:157:28
             title={title}
             showCloseButton={showCloseButton}
             onClose={onClose}
-            headerClasses={`base-modal__header ${headerClassName}`.trim()}
+            headerClasses={`base-modal__header ${headerClassName}`}
             titleId={titleId}
           />

[Survived] MethodExpression
src/components/BaseModal.tsx:161:25
             titleId={titleId}
           />
         )}
-        <div className={`base-modal__content ${contentClassName}`.trim()}>
+        <div className={`base-modal__content ${contentClassName}`}>
           {children}
         </div>
