[NoCoverage] BlockStatement
src/components/Dashboard.tsx:19:61
   timestamp: Date;
 }
 
-function MetricCard({ metric }: { metric: ActivityMetric }) {
-  return (
-    <div className="dashboard__metric-card">
-      <div className="dashboard__metric-icon">{metric.icon}</div>
-      <div className="dashboard__metric-content">
-        <span className="dashboard__metric-value">{metric.value}</span>
-        <span className="dashboard__metric-label">{metric.label}</span>
-      </div>
-    </div>
-  );
-}
+function MetricCard({ metric }: { metric: ActivityMetric }) {}
 
 function ActivityItem({ activity }: { activity: RecentActivity }) {

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:31:67
   );
 }
 
-function ActivityItem({ activity }: { activity: RecentActivity }) {
-  return (
-    <div className="dashboard__activity-item">
-      <div className="dashboard__activity-dot"></div>
-      <div className="dashboard__activity-content">
-        <span className="dashboard__activity-description">
-          {activity.description}
-        </span>
-        <span className="dashboard__activity-time">
-          {activity.timestamp.toLocaleTimeString("et-EE", {
-            hour: "2-digit",
-            minute: "2-digit",
-          })}
-        </span>
-      </div>
-    </div>
-  );
-}
+function ActivityItem({ activity }: { activity: RecentActivity }) {}
 
 function QuickLinks() {

[NoCoverage] ObjectLiteral
src/components/Dashboard.tsx:40:59
           {activity.description}
         </span>
         <span className="dashboard__activity-time">
-          {activity.timestamp.toLocaleTimeString("et-EE", {
-            hour: "2-digit",
-            minute: "2-digit",
-          })}
+          {activity.timestamp.toLocaleTimeString("et-EE", {})}
         </span>
       </div>

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:50:23
   );
 }
 
-function QuickLinks() {
-  return (
-    <div className="dashboard__section">
-      <h2 className="dashboard__section-title">Kiirlingid</h2>
-      <div className="dashboard__quick-links">
-        <button className="dashboard__quick-link">
-          <span className="dashboard__quick-link-icon">🎤</span>
-          <span>Uus süntees</span>
-        </button>
-        <button className="dashboard__quick-link">
-          <span className="dashboard__quick-link-icon">📋</span>
-          <span>Loo ülesanne</span>
-        </button>
-      </div>
-    </div>
-  );
-}
+function QuickLinks() {}
 
 function ActivitySection({

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:72:4
   recentActivity,
 }: {
   recentActivity: RecentActivity[];
-}) {
-  return (
-    <div className="dashboard__section">
-      <h2 className="dashboard__section-title">Hiljutine tegevus</h2>
-      <div className="dashboard__activity-list">
-        {recentActivity.length > 0 ? (
-          recentActivity.map((a) => <ActivityItem key={a.id} activity={a} />)
-        ) : (
-          <p className="dashboard__empty">Tegevust pole veel</p>
-        )}
-      </div>
-    </div>
-  );
-}
+}) {}
 
 function useDashboardData() {

[NoCoverage] ConditionalExpression
src/components/Dashboard.tsx:77:10
     <div className="dashboard__section">
       <h2 className="dashboard__section-title">Hiljutine tegevus</h2>
       <div className="dashboard__activity-list">
-        {recentActivity.length > 0 ? (
+        {true ? (
           recentActivity.map((a) => <ActivityItem key={a.id} activity={a} />)
         ) : (

[NoCoverage] ConditionalExpression
src/components/Dashboard.tsx:77:10
     <div className="dashboard__section">
       <h2 className="dashboard__section-title">Hiljutine tegevus</h2>
       <div className="dashboard__activity-list">
-        {recentActivity.length > 0 ? (
+        {false ? (
           recentActivity.map((a) => <ActivityItem key={a.id} activity={a} />)
         ) : (

[NoCoverage] ArrowFunction
src/components/Dashboard.tsx:78:30
       <h2 className="dashboard__section-title">Hiljutine tegevus</h2>
       <div className="dashboard__activity-list">
         {recentActivity.length > 0 ? (
-          recentActivity.map((a) => <ActivityItem key={a.id} activity={a} />)
+          recentActivity.map(() => undefined)
         ) : (
           <p className="dashboard__empty">Tegevust pole veel</p>

[NoCoverage] ArrayDeclaration
src/components/Dashboard.tsx:89:60
 
 function useDashboardData() {
   const { user, isAuthenticated } = useAuth();
-  const [metrics, setMetrics] = useState<ActivityMetric[]>([]);
+  const [metrics, setMetrics] = useState<ActivityMetric[]>(["Stryker was here"]);
   const [recentActivity, setRecentActivity] = useState<RecentActivity[]>([]);
   const [isLoading, setIsLoading] = useState(true);

[NoCoverage] BooleanLiteral
src/components/Dashboard.tsx:91:46
   const { user, isAuthenticated } = useAuth();
   const [metrics, setMetrics] = useState<ActivityMetric[]>([]);
   const [recentActivity, setRecentActivity] = useState<RecentActivity[]>([]);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const loadData = useCallback(async () => {
     setIsLoading(true);

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:92:44
   const [metrics, setMetrics] = useState<ActivityMetric[]>([]);
   const [recentActivity, setRecentActivity] = useState<RecentActivity[]>([]);
   const [isLoading, setIsLoading] = useState(true);
-  const loadData = useCallback(async () => {
-    setIsLoading(true);
-    const dataService = DataService.getInstance();
-    let taskCount = 0,
-      entryCount = 0;
-    if (isAuthenticated && user) {
-      const tasks = await dataService.getUserTasks(user.id);
-      taskCount = tasks.length;
-      entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
-    }
-    setMetrics([
-      { label: "Ülesanded", value: taskCount, icon: "📋" },
-      { label: "Kirjed", value: entryCount, icon: "📝" },
-      { label: "Sünteesid", value: 0, icon: "🔊" },
-      { label: "Sessioone", value: 1, icon: "👤" },
-    ]);
-    setRecentActivity([
-      { id: "1", description: "Sisselogimine", timestamp: new Date() },
-    ]);
-    setIsLoading(false);
-  }, [isAuthenticated, user]);
+  const loadData = useCallback(async () => {}, [isAuthenticated, user]);
   useEffect(() => {
     loadData();

[NoCoverage] BooleanLiteral
src/components/Dashboard.tsx:93:18
   const [recentActivity, setRecentActivity] = useState<RecentActivity[]>([]);
   const [isLoading, setIsLoading] = useState(true);
   const loadData = useCallback(async () => {
-    setIsLoading(true);
+    setIsLoading(false);
     const dataService = DataService.getInstance();
     let taskCount = 0,

[NoCoverage] LogicalOperator
src/components/Dashboard.tsx:97:9
     const dataService = DataService.getInstance();
     let taskCount = 0,
       entryCount = 0;
-    if (isAuthenticated && user) {
+    if (isAuthenticated || user) {
       const tasks = await dataService.getUserTasks(user.id);
       taskCount = tasks.length;

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:97:34
     const dataService = DataService.getInstance();
     let taskCount = 0,
       entryCount = 0;
-    if (isAuthenticated && user) {
-      const tasks = await dataService.getUserTasks(user.id);
-      taskCount = tasks.length;
-      entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
-    }
+    if (isAuthenticated && user) {}
     setMetrics([
       { label: "Ülesanded", value: taskCount, icon: "📋" },

[NoCoverage] ArithmeticOperator
src/components/Dashboard.tsx:100:48
     if (isAuthenticated && user) {
       const tasks = await dataService.getUserTasks(user.id);
       taskCount = tasks.length;
-      entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
+      entryCount = tasks.reduce((sum, task) => sum - task.entryCount, 0);
     }
     setMetrics([

[NoCoverage] ArrowFunction
src/components/Dashboard.tsx:100:33
     if (isAuthenticated && user) {
       const tasks = await dataService.getUserTasks(user.id);
       taskCount = tasks.length;
-      entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
+      entryCount = tasks.reduce(() => undefined, 0);
     }
     setMetrics([

[NoCoverage] ArrayDeclaration
src/components/Dashboard.tsx:102:16
       taskCount = tasks.length;
       entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
     }
-    setMetrics([
-      { label: "Ülesanded", value: taskCount, icon: "📋" },
-      { label: "Kirjed", value: entryCount, icon: "📝" },
-      { label: "Sünteesid", value: 0, icon: "🔊" },
-      { label: "Sessioone", value: 1, icon: "👤" },
-    ]);
+    setMetrics([]);
     setRecentActivity([
       { id: "1", description: "Sisselogimine", timestamp: new Date() },

[NoCoverage] StringLiteral
src/components/Dashboard.tsx:103:16
       entryCount = tasks.reduce((sum, task) => sum + task.entryCount, 0);
     }
     setMetrics([
-      { label: "Ülesanded", value: taskCount, icon: "📋" },
+      { label: "", value: taskCount, icon: "📋" },
       { label: "Kirjed", value: entryCount, icon: "📝" },
       { label: "Sünteesid", value: 0, icon: "🔊" },

[NoCoverage] StringLiteral
src/components/Dashboard.tsx:106:16
       { label: "Ülesanded", value: taskCount, icon: "📋" },
       { label: "Kirjed", value: entryCount, icon: "📝" },
       { label: "Sünteesid", value: 0, icon: "🔊" },
-      { label: "Sessioone", value: 1, icon: "👤" },
+      { label: "", value: 1, icon: "👤" },
     ]);
     setRecentActivity([

[NoCoverage] ObjectLiteral
src/components/Dashboard.tsx:109:7
       { label: "Sessioone", value: 1, icon: "👤" },
     ]);
     setRecentActivity([
-      { id: "1", description: "Sisselogimine", timestamp: new Date() },
+      {},
     ]);
     setIsLoading(false);

[NoCoverage] BooleanLiteral
src/components/Dashboard.tsx:111:18
     setRecentActivity([
       { id: "1", description: "Sisselogimine", timestamp: new Date() },
     ]);
-    setIsLoading(false);
+    setIsLoading(true);
   }, [isAuthenticated, user]);
   useEffect(() => {

[NoCoverage] ArrayDeclaration
src/components/Dashboard.tsx:112:6
       { id: "1", description: "Sisselogimine", timestamp: new Date() },
     ]);
     setIsLoading(false);
-  }, [isAuthenticated, user]);
+  }, []);
   useEffect(() => {
     loadData();

[NoCoverage] BlockStatement
src/components/Dashboard.tsx:113:19
     ]);
     setIsLoading(false);
   }, [isAuthenticated, user]);
-  useEffect(() => {
-    loadData();
-  }, [loadData]);
+  useEffect(() => {}, [loadData]);
   return { metrics, recentActivity, isLoading, isAuthenticated };
 }

[NoCoverage] ArrayDeclaration
src/components/Dashboard.tsx:115:6
   }, [isAuthenticated, user]);
   useEffect(() => {
     loadData();
-  }, [loadData]);
+  }, []);
   return { metrics, recentActivity, isLoading, isAuthenticated };
 }

[NoCoverage] ConditionalExpression
src/components/Dashboard.tsx:122:7
 export default function Dashboard() {
   const { metrics, recentActivity, isLoading, isAuthenticated } =
     useDashboardData();
-  if (isLoading)
+  if (true)
     return (
       <div className="dashboard">

[NoCoverage] ConditionalExpression
src/components/Dashboard.tsx:122:7
 export default function Dashboard() {
   const { metrics, recentActivity, isLoading, isAuthenticated } =
     useDashboardData();
-  if (isLoading)
+  if (false)
     return (
       <div className="dashboard">

[NoCoverage] ArrowFunction
src/components/Dashboard.tsx:137:22
         <p className="dashboard__subtitle">Rakenduse aktiivsuse ülevaade</p>
       </div>
       <div className="dashboard__metrics">
-        {metrics.map((m, i) => (
-          <MetricCard key={i} metric={m} />
-        ))}
+        {metrics.map(() => undefined)}
       </div>
       <div className="dashboard__sections">

[NoCoverage] ConditionalExpression
src/components/Dashboard.tsx:145:8
         <ActivitySection recentActivity={recentActivity} />
         <QuickLinks />
       </div>
-      {!isAuthenticated && (
-        <div className="dashboard__auth-prompt">
-          <p>Logi sisse, et näha oma aktiivsust ja statistikat.</p>
-        </div>
-      )}
+      {true}
     </div>
   );

[NoCoverage] LogicalOperator
src/components/Dashboard.tsx:145:8
         <ActivitySection recentActivity={recentActivity} />
         <QuickLinks />
       </div>
-      {!isAuthenticated && (
-        <div className="dashboard__auth-prompt">
-          <p>Logi sisse, et näha oma aktiivsust ja statistikat.</p>
-        </div>
-      )}
+      {!isAuthenticated || <div className="dashboard__auth-prompt">
+          <p>Logi sisse, et näha oma aktiivsust ja statistikat.</p>
+        </div>}
     </div>
   );
