[Killed] BlockStatement
src/components/ErrorBoundary.tsx:17:29
 }
 
 export class ErrorBoundary extends Component<Props, State> {
-  constructor(props: Props) {
-    super(props);
-    this.state = { hasError: false, error: null };
-  }
+  constructor(props: Props) {}
 
   static getDerivedStateFromError(error: Error): State {
killedBy: ErrorBoundary renders children when no error
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BooleanLiteral
src/components/ErrorBoundary.tsx:19:30
 export class ErrorBoundary extends Component<Props, State> {
   constructor(props: Props) {
     super(props);
-    this.state = { hasError: false, error: null };
+    this.state = { hasError: true, error: null };
   }
 
killedBy: ErrorBoundary renders children when no error
statusReason: Unable to find an element with the text: Child content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center;"
    >

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:22:56
     this.state = { hasError: false, error: null };
   }
 
-  static getDerivedStateFromError(error: Error): State {
-    return { hasError: true, error };
-  }
+  static getDerivedStateFromError(error: Error): State {}
 
   override componentDidCatch(error: Error, errorInfo: ErrorInfo): void {
killedBy: ErrorBoundary renders error UI when error is thrown
statusReason: Test error message

[Killed] BooleanLiteral
src/components/ErrorBoundary.tsx:23:24
   }
 
   static getDerivedStateFromError(error: Error): State {
-    return { hasError: true, error };
+    return { hasError: false, error };
   }
 
killedBy: ErrorBoundary renders error UI when error is thrown
statusReason: Test error message

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:26:72
     return { hasError: true, error };
   }
 
-  override componentDidCatch(error: Error, errorInfo: ErrorInfo): void {
-    console.error("[ErrorBoundary] Uncaught error:", error, errorInfo);
-  }
+  override componentDidCatch(error: Error, errorInfo: ErrorInfo): void {}
 
   override render(): ReactNode {
killedBy: ErrorBoundary logs error to console with error info
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received: 

  1st vi.fn() call:

  [
-   "[ErrorBoundary] Uncaught error:",

[Killed] StringLiteral
src/components/ErrorBoundary.tsx:27:19
   }
 
   override componentDidCatch(error: Error, errorInfo: ErrorInfo): void {
-    console.error("[ErrorBoundary] Uncaught error:", error, errorInfo);
+    console.error("", error, errorInfo);
   }
 
killedBy: ErrorBoundary logs error to console with error info
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received: 

  1st vi.fn() call:

  [
-   "[ErrorBoundary] Uncaught error:",

[Killed] ConditionalExpression
src/components/ErrorBoundary.tsx:31:9
   }
 
   override render(): ReactNode {
-    if (this.state.hasError) {
+    if (false) {
       if (this.props.fallback) {
         return this.props.fallback;
killedBy: ErrorBoundary renders error UI when error is thrown
statusReason: Test error message

[Killed] ConditionalExpression
src/components/ErrorBoundary.tsx:31:9
   }
 
   override render(): ReactNode {
-    if (this.state.hasError) {
+    if (true) {
       if (this.props.fallback) {
         return this.props.fallback;
killedBy: ErrorBoundary renders children when no error
statusReason: Unable to find an element with the text: Child content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center;"
    >

[Killed] ConditionalExpression
src/components/ErrorBoundary.tsx:32:11
 
   override render(): ReactNode {
     if (this.state.hasError) {
-      if (this.props.fallback) {
+      if (false) {
         return this.props.fallback;
       }
killedBy: ErrorBoundary renders custom fallback when provided
statusReason: Unable to find an element with the text: Custom fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center;"
    >

[Killed] BlockStatement
src/components/ErrorBoundary.tsx:32:32
 
   override render(): ReactNode {
     if (this.state.hasError) {
-      if (this.props.fallback) {
-        return this.props.fallback;
-      }
+      if (this.props.fallback) {}
 
       return (
killedBy: ErrorBoundary renders custom fallback when provided
statusReason: Unable to find an element with the text: Custom fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center;"
    >

[Killed] ObjectLiteral
src/components/ErrorBoundary.tsx:39:21
       return (
         <div style={{ padding: "2rem", textAlign: "center" }}>
           <h2>Midagi läks valesti</h2>
-          <p style={{ color: "#666", marginTop: "0.5rem" }}>
+          <p style={{}}>
             {this.state.error?.message ?? "Tekkis ootamatu viga"}
           </p>
killedBy: ErrorBoundary error message paragraph has correct style
statusReason: expected '' to be '#666' // Object.is equality

[Killed] LogicalOperator
src/components/ErrorBoundary.tsx:40:14
         <div style={{ padding: "2rem", textAlign: "center" }}>
           <h2>Midagi läks valesti</h2>
           <p style={{ color: "#666", marginTop: "0.5rem" }}>
-            {this.state.error?.message ?? "Tekkis ootamatu viga"}
+            {this.state.error?.message && "Tekkis ootamatu viga"}
           </p>
           <button
killedBy: ErrorBoundary renders error UI when error is thrown
statusReason: Unable to find an element with the text: Test error message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="padding: 2rem; text-align: center;"
    >

[Survived] OptionalChaining
src/components/ErrorBoundary.tsx:40:14
         <div style={{ padding: "2rem", textAlign: "center" }}>
           <h2>Midagi läks valesti</h2>
           <p style={{ color: "#666", marginTop: "0.5rem" }}>
-            {this.state.error?.message ?? "Tekkis ootamatu viga"}
+            {this.state.error.message ?? "Tekkis ootamatu viga"}
           </p>
           <button

[Survived] ArrowFunction
src/components/ErrorBoundary.tsx:43:22
             {this.state.error?.message ?? "Tekkis ootamatu viga"}
           </p>
           <button
-            onClick={() => this.setState({ hasError: false, error: null })}
+            onClick={() => undefined}
             style={{
               marginTop: "1rem",

[Survived] BooleanLiteral
src/components/ErrorBoundary.tsx:43:54
             {this.state.error?.message ?? "Tekkis ootamatu viga"}
           </p>
           <button
-            onClick={() => this.setState({ hasError: false, error: null })}
+            onClick={() => this.setState({ hasError: true, error: null })}
             style={{
               marginTop: "1rem",

[Killed] ObjectLiteral
src/components/ErrorBoundary.tsx:44:20
           </p>
           <button
             onClick={() => this.setState({ hasError: false, error: null })}
-            style={{
-              marginTop: "1rem",
-              padding: "0.5rem 1rem",
-              borderRadius: "0.5rem",
-              border: "1px solid #ccc",
-              cursor: "pointer",
-              background: "#fff",
-            }}
+            style={{}}
           >
             Proovi uuesti
killedBy: ErrorBoundary retry button has correct styles
statusReason: expected '' to be '1rem' // Object.is equality

[Killed] StringLiteral
src/components/ErrorBoundary.tsx:47:29
             style={{
               marginTop: "1rem",
               padding: "0.5rem 1rem",
-              borderRadius: "0.5rem",
+              borderRadius: "",
               border: "1px solid #ccc",
               cursor: "pointer",
killedBy: ErrorBoundary retry button has correct styles
statusReason: expected '' to be '0.5rem' // Object.is equality

[Survived] StringLiteral
src/components/ErrorBoundary.tsx:48:23
               marginTop: "1rem",
               padding: "0.5rem 1rem",
               borderRadius: "0.5rem",
-              border: "1px solid #ccc",
+              border: "",
               cursor: "pointer",
               background: "#fff",

[Killed] StringLiteral
src/components/ErrorBoundary.tsx:49:23
               padding: "0.5rem 1rem",
               borderRadius: "0.5rem",
               border: "1px solid #ccc",
-              cursor: "pointer",
+              cursor: "",
               background: "#fff",
             }}
killedBy: ErrorBoundary retry button has correct styles
statusReason: expected '' to be 'pointer' // Object.is equality
