[Survived] ArrayDeclaration
src/components/NotificationContainer.tsx:35:74
 }
 
 const NotificationContainer = forwardRef<NotificationRef>((_, ref) => {
-  const [notifications, setNotifications] = useState<NotificationData[]>([]);
+  const [notifications, setNotifications] = useState<NotificationData[]>(["Stryker was here"]);
 
   const removeNotification = useCallback((id: string) => {

[NoCoverage] BlockStatement
src/components/NotificationContainer.tsx:37:58
 const NotificationContainer = forwardRef<NotificationRef>((_, ref) => {
   const [notifications, setNotifications] = useState<NotificationData[]>([]);
 
-  const removeNotification = useCallback((id: string) => {
-    setNotifications((prev) => prev.filter((n) => n.id !== id));
-  }, []);
+  const removeNotification = useCallback((id: string) => {}, []);
 
   const show = useCallback(

[NoCoverage] MethodExpression
src/components/NotificationContainer.tsx:38:32
   const [notifications, setNotifications] = useState<NotificationData[]>([]);
 
   const removeNotification = useCallback((id: string) => {
-    setNotifications((prev) => prev.filter((n) => n.id !== id));
+    setNotifications((prev) => prev);
   }, []);
 

[NoCoverage] ConditionalExpression
src/components/NotificationContainer.tsx:38:51
   const [notifications, setNotifications] = useState<NotificationData[]>([]);
 
   const removeNotification = useCallback((id: string) => {
-    setNotifications((prev) => prev.filter((n) => n.id !== id));
+    setNotifications((prev) => prev.filter((n) => false));
   }, []);
 

[Killed] BlockStatement
src/components/NotificationContainer.tsx:49:10
       duration?: number,
       color?: NotificationColor,
       action?: NotificationAction,
-    ) => {
-      const id = `notification-${Date.now()}-${Math.random()}`;
-      const notification: NotificationData = {
-        id,
-        type,
-        color,
-        message,
-        description,
-        action,
-        duration,
-      };
-
-      setNotifications((prev) => [...prev, notification]);
-    },
+    ) => {},
     [],
   );
killedBy: NotificationContainer show notification shows notification when show is called
statusReason: Unable to find an element with the text: Test message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="notification-container"
    />

[Survived] StringLiteral
src/components/NotificationContainer.tsx:50:18
       color?: NotificationColor,
       action?: NotificationAction,
     ) => {
-      const id = `notification-${Date.now()}-${Math.random()}`;
+      const id = ``;
       const notification: NotificationData = {
         id,

[Killed] ObjectLiteral
src/components/NotificationContainer.tsx:51:46
       action?: NotificationAction,
     ) => {
       const id = `notification-${Date.now()}-${Math.random()}`;
-      const notification: NotificationData = {
-        id,
-        type,
-        color,
-        message,
-        description,
-        action,
-        duration,
-      };
+      const notification: NotificationData = {};
 
       setNotifications((prev) => [...prev, notification]);
killedBy: NotificationContainer show notification shows notification when show is called
statusReason: Unable to find an element with the text: Test message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="notification-container"
    >

[Killed] ArrowFunction
src/components/NotificationContainer.tsx:61:24
         duration,
       };
 
-      setNotifications((prev) => [...prev, notification]);
+      setNotifications(() => undefined);
     },
     [],
killedBy: NotificationContainer show notification shows notification when show is called
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/components/NotificationContainer.tsx:68:5
 
   useImperativeHandle(
     ref,
-    () => ({
-      show,
-    }),
+    () => undefined,
     [show],
   );
killedBy: NotificationContainer show notification shows notification when show is called
statusReason: Unable to find an element with the text: Test message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="notification-container"
    />

[Killed] ArrowFunction
src/components/NotificationContainer.tsx:76:26
 
   return (
     <div className="notification-container">
-      {notifications.map((notification) => (
-        <Notification
-          key={notification.id}
-          type={notification.type}
-          color={notification.color ?? undefined}
-          message={notification.message}
-          description={notification.description ?? undefined}
-          action={notification.action ?? undefined}
-          duration={notification.duration ?? undefined}
-          onClose={() => removeNotification(notification.id)}
-        />
-      ))}
+      {notifications.map(() => undefined)}
     </div>
   );
killedBy: NotificationContainer show notification shows notification when show is called
statusReason: Unable to find an element with the text: Test message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="notification-container"
    />

[Survived] LogicalOperator
src/components/NotificationContainer.tsx:80:18
         <Notification
           key={notification.id}
           type={notification.type}
-          color={notification.color ?? undefined}
+          color={notification.color && undefined}
           message={notification.message}
           description={notification.description ?? undefined}

[Killed] LogicalOperator
src/components/NotificationContainer.tsx:82:24
           type={notification.type}
           color={notification.color ?? undefined}
           message={notification.message}
-          description={notification.description ?? undefined}
+          description={notification.description && undefined}
           action={notification.action ?? undefined}
           duration={notification.duration ?? undefined}
killedBy: NotificationContainer show notification shows notification with description
statusReason: Unable to find an element with the text: Description text. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="notification-container"
    >

[Survived] LogicalOperator
src/components/NotificationContainer.tsx:83:19
           color={notification.color ?? undefined}
           message={notification.message}
           description={notification.description ?? undefined}
-          action={notification.action ?? undefined}
+          action={notification.action && undefined}
           duration={notification.duration ?? undefined}
           onClose={() => removeNotification(notification.id)}

[Survived] LogicalOperator
src/components/NotificationContainer.tsx:84:21
           message={notification.message}
           description={notification.description ?? undefined}
           action={notification.action ?? undefined}
-          duration={notification.duration ?? undefined}
+          duration={notification.duration && undefined}
           onClose={() => removeNotification(notification.id)}
         />

[Survived] ArrowFunction
src/components/NotificationContainer.tsx:85:20
           description={notification.description ?? undefined}
           action={notification.action ?? undefined}
           duration={notification.duration ?? undefined}
-          onClose={() => removeNotification(notification.id)}
+          onClose={() => undefined}
         />
       ))}
