[Survived] ArrowFunction
src/components/SentencePhoneticPanel.tsx:23:20
   onApply: (newPhoneticText: string) => void;
 }
 
-const MarkerItem = ({ m }: { m: (typeof markers)[0] }) => (
-  <div className="sentence-phonetic-panel__marker-item">
-    <div className="sentence-phonetic-panel__marker-symbol">
-      <code>{m.symbol}</code>
-      <span className="sentence-phonetic-panel__marker-name">{m.name}</span>
-    </div>
-    <div className="sentence-phonetic-panel__marker-rule">{m.rule}</div>
-    <div className="sentence-phonetic-panel__marker-examples">
-      {m.examples.map((ex, i) => (
-        <span key={i} className="sentence-phonetic-panel__marker-tag">
-          {ex}
-        </span>
-      ))}
-    </div>
-  </div>
-);
+const MarkerItem = () => undefined;
 
 const GuideView = ({

[Survived] ArrowFunction
src/components/SentencePhoneticPanel.tsx:31:23
     </div>
     <div className="sentence-phonetic-panel__marker-rule">{m.rule}</div>
     <div className="sentence-phonetic-panel__marker-examples">
-      {m.examples.map((ex, i) => (
-        <span key={i} className="sentence-phonetic-panel__marker-tag">
-          {ex}
-        </span>
-      ))}
+      {m.examples.map(() => undefined)}
     </div>
   </div>

[Survived] ArrowFunction
src/components/SentencePhoneticPanel.tsx:72:20
         Hääldusmärgid aitavad täpsustada lause hääldust. Klõpsa märgil, et
         lisada see kursori asukohta.
       </p>
-      {markers.map((m, i) => (
-        <MarkerItem key={i} m={m} />
-      ))}
+      {markers.map(() => undefined)}
     </div>
   </div>

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:87:46
   onApply,
 }: SentencePhoneticPanelProps) {
   const [editedText, setEditedText] = useState("");
-  const [isPlaying, setIsPlaying] = useState(false);
+  const [isPlaying, setIsPlaying] = useState(true);
   const [isLoading, setIsLoading] = useState(false);
   const [showGuide, setShowGuide] = useState(false);

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:88:46
 }: SentencePhoneticPanelProps) {
   const [editedText, setEditedText] = useState("");
   const [isPlaying, setIsPlaying] = useState(false);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [showGuide, setShowGuide] = useState(false);
   const inputRef = useRef<HTMLTextAreaElement>(null);
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:89:46
   const [editedText, setEditedText] = useState("");
   const [isPlaying, setIsPlaying] = useState(false);
   const [isLoading, setIsLoading] = useState(false);
-  const [showGuide, setShowGuide] = useState(false);
+  const [showGuide, setShowGuide] = useState(true);
   const inputRef = useRef<HTMLTextAreaElement>(null);
   const audioRef = useRef<HTMLAudioElement | null>(null);
killedBy: SentencePhoneticPanel renders when open
statusReason: Unable to find an accessible element with the role "button" and name `/rakenda/i`

Here are the accessible roles:

  button:

  Name "Tagasi":
  <button

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:93:19
   const inputRef = useRef<HTMLTextAreaElement>(null);
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
-  useEffect(() => {
-    if (isOpen && phoneticText) {
-      setEditedText(transformToUI(phoneticText) || "");
-    } else if (isOpen && sentenceText && !phoneticText) {
-      setEditedText(sentenceText);
-    }
-  }, [isOpen, phoneticText, sentenceText]);
+  useEffect(() => {}, [isOpen, phoneticText, sentenceText]);
 
   useEffect(() => {
killedBy: SentencePhoneticPanel displays phonetic text
statusReason: Unable to find an element with the display value: Héllo wórld.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:94:9
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
   useEffect(() => {
-    if (isOpen && phoneticText) {
+    if (false) {
       setEditedText(transformToUI(phoneticText) || "");
     } else if (isOpen && sentenceText && !phoneticText) {
killedBy: SentencePhoneticPanel displays phonetic text
statusReason: Unable to find an element with the display value: Héllo wórld.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:94:9
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
   useEffect(() => {
-    if (isOpen && phoneticText) {
+    if (true) {
       setEditedText(transformToUI(phoneticText) || "");
     } else if (isOpen && sentenceText && !phoneticText) {
killedBy: SentencePhoneticPanel uses sentenceText when phoneticText is null
statusReason: Unable to find an element with the display value: Hello world.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:95:21
 
   useEffect(() => {
     if (isOpen && phoneticText) {
-      setEditedText(transformToUI(phoneticText) || "");
+      setEditedText(true);
     } else if (isOpen && sentenceText && !phoneticText) {
       setEditedText(sentenceText);
killedBy: SentencePhoneticPanel renders when open
statusReason: editedText.trim is not a function

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:95:21
 
   useEffect(() => {
     if (isOpen && phoneticText) {
-      setEditedText(transformToUI(phoneticText) || "");
+      setEditedText(false);
     } else if (isOpen && sentenceText && !phoneticText) {
       setEditedText(sentenceText);
killedBy: SentencePhoneticPanel renders when open
statusReason: editedText.trim is not a function

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:96:57
   useEffect(() => {
     if (isOpen && phoneticText) {
       setEditedText(transformToUI(phoneticText) || "");
-    } else if (isOpen && sentenceText && !phoneticText) {
-      setEditedText(sentenceText);
-    }
+    } else if (isOpen && sentenceText && !phoneticText) {}
   }, [isOpen, phoneticText, sentenceText]);
 
killedBy: SentencePhoneticPanel uses sentenceText when phoneticText is null
statusReason: Unable to find an element with the display value: Hello world.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:96:16
   useEffect(() => {
     if (isOpen && phoneticText) {
       setEditedText(transformToUI(phoneticText) || "");
-    } else if (isOpen && sentenceText && !phoneticText) {
+    } else if (false) {
       setEditedText(sentenceText);
     }
killedBy: SentencePhoneticPanel uses sentenceText when phoneticText is null
statusReason: Unable to find an element with the display value: Hello world.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:101:19
     }
   }, [isOpen, phoneticText, sentenceText]);
 
-  useEffect(() => {
-    if (isOpen && inputRef.current) {
-      inputRef.current.focus();
-      inputRef.current.setSelectionRange(
-        inputRef.current.value.length,
-        inputRef.current.value.length,
-      );
-    }
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
 
   useEffect(() => {

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:102:9
   }, [isOpen, phoneticText, sentenceText]);
 
   useEffect(() => {
-    if (isOpen && inputRef.current) {
+    if (true) {
       inputRef.current.focus();
       inputRef.current.setSelectionRange(
killedBy: SentencePhoneticPanel returns null when not open
statusReason: Cannot read properties of null (reading 'focus')

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:102:37
   }, [isOpen, phoneticText, sentenceText]);
 
   useEffect(() => {
-    if (isOpen && inputRef.current) {
-      inputRef.current.focus();
-      inputRef.current.setSelectionRange(
-        inputRef.current.value.length,
-        inputRef.current.value.length,
-      );
-    }
+    if (isOpen && inputRef.current) {}
   }, [isOpen]);
 

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:111:19
     }
   }, [isOpen]);
 
-  useEffect(() => {
-    return () => {
-      if (audioRef.current) {
-        audioRef.current.pause();
-        audioRef.current = null;
-      }
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   const insertMarkerAtCursor = (marker: string) => {

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:112:18
   }, [isOpen]);
 
   useEffect(() => {
-    return () => {
-      if (audioRef.current) {
-        audioRef.current.pause();
-        audioRef.current = null;
-      }
-    };
+    return () => {};
   }, []);
 

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:113:11
 
   useEffect(() => {
     return () => {
-      if (audioRef.current) {
+      if (true) {
         audioRef.current.pause();
         audioRef.current = null;
killedBy: SentencePhoneticPanel returns null when not open
statusReason: Cannot read properties of null (reading 'pause')

[NoCoverage] BlockStatement
src/components/SentencePhoneticPanel.tsx:113:29
 
   useEffect(() => {
     return () => {
-      if (audioRef.current) {
-        audioRef.current.pause();
-        audioRef.current = null;
-      }
+      if (audioRef.current) {}
     };
   }, []);

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:120:52
     };
   }, []);
 
-  const insertMarkerAtCursor = (marker: string) => {
-    const ta = inputRef.current;
-    if (!ta) return;
-    const s = ta.selectionStart || 0;
-    const e = ta.selectionEnd || 0;
-    setEditedText(
-      editedText.substring(0, s) + marker + editedText.substring(e),
-    );
-    setTimeout(() => {
-      ta.focus();
-      ta.setSelectionRange(s + marker.length, s + marker.length);
-    }, 0);
-  };
+  const insertMarkerAtCursor = (marker: string) => {};
 
   const handlePlay = async () => {
killedBy: SentencePhoneticPanel text editing inserts marker when marker button clicked
statusReason: expected 'test' to contain '`'

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:122:9
 
   const insertMarkerAtCursor = (marker: string) => {
     const ta = inputRef.current;
-    if (!ta) return;
+    if (true) return;
     const s = ta.selectionStart || 0;
     const e = ta.selectionEnd || 0;
killedBy: SentencePhoneticPanel text editing inserts marker when marker button clicked
statusReason: expected 'test' to contain '`'

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:122:9
 
   const insertMarkerAtCursor = (marker: string) => {
     const ta = inputRef.current;
-    if (!ta) return;
+    if (ta) return;
     const s = ta.selectionStart || 0;
     const e = ta.selectionEnd || 0;
killedBy: SentencePhoneticPanel text editing inserts marker when marker button clicked
statusReason: expected 'test' to contain '`'

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:123:15
   const insertMarkerAtCursor = (marker: string) => {
     const ta = inputRef.current;
     if (!ta) return;
-    const s = ta.selectionStart || 0;
+    const s = false;
     const e = ta.selectionEnd || 0;
     setEditedText(

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:123:15
   const insertMarkerAtCursor = (marker: string) => {
     const ta = inputRef.current;
     if (!ta) return;
-    const s = ta.selectionStart || 0;
+    const s = true;
     const e = ta.selectionEnd || 0;
     setEditedText(

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:124:15
     const ta = inputRef.current;
     if (!ta) return;
     const s = ta.selectionStart || 0;
-    const e = ta.selectionEnd || 0;
+    const e = true;
     setEditedText(
       editedText.substring(0, s) + marker + editedText.substring(e),

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:124:15
     const ta = inputRef.current;
     if (!ta) return;
     const s = ta.selectionStart || 0;
-    const e = ta.selectionEnd || 0;
+    const e = false;
     setEditedText(
       editedText.substring(0, s) + marker + editedText.substring(e),

[Killed] ArithmeticOperator
src/components/SentencePhoneticPanel.tsx:126:7
     const s = ta.selectionStart || 0;
     const e = ta.selectionEnd || 0;
     setEditedText(
-      editedText.substring(0, s) + marker + editedText.substring(e),
+      editedText.substring(0, s) - marker + editedText.substring(e),
     );
     setTimeout(() => {
killedBy: SentencePhoneticPanel text editing inserts marker when marker button clicked
statusReason: expected 'NaN' to contain '`'

[Killed] ArithmeticOperator
src/components/SentencePhoneticPanel.tsx:126:7
     const s = ta.selectionStart || 0;
     const e = ta.selectionEnd || 0;
     setEditedText(
-      editedText.substring(0, s) + marker + editedText.substring(e),
+      editedText.substring(0, s) + marker - editedText.substring(e),
     );
     setTimeout(() => {
killedBy: SentencePhoneticPanel text editing inserts marker when marker button clicked
statusReason: editedText.trim is not a function

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:128:22
     setEditedText(
       editedText.substring(0, s) + marker + editedText.substring(e),
     );
-    setTimeout(() => {
-      ta.focus();
-      ta.setSelectionRange(s + marker.length, s + marker.length);
-    }, 0);
+    setTimeout(() => {}, 0);
   };
 

[Survived] ArithmeticOperator
src/components/SentencePhoneticPanel.tsx:130:28
     );
     setTimeout(() => {
       ta.focus();
-      ta.setSelectionRange(s + marker.length, s + marker.length);
+      ta.setSelectionRange(s - marker.length, s + marker.length);
     }, 0);
   };

[Survived] ArithmeticOperator
src/components/SentencePhoneticPanel.tsx:130:47
     );
     setTimeout(() => {
       ta.focus();
-      ta.setSelectionRange(s + marker.length, s + marker.length);
+      ta.setSelectionRange(s + marker.length, s - marker.length);
     }, 0);
   };

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:135:9
   };
 
   const handlePlay = async () => {
-    if (!editedText.trim()) return;
+    if (true) return;
     if (audioRef.current) {
       audioRef.current.pause();
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:135:9
   };
 
   const handlePlay = async () => {
-    if (!editedText.trim()) return;
+    if (editedText.trim()) return;
     if (audioRef.current) {
       audioRef.current.pause();
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:136:9
 
   const handlePlay = async () => {
     if (!editedText.trim()) return;
-    if (audioRef.current) {
+    if (true) {
       audioRef.current.pause();
       audioRef.current = null;
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[NoCoverage] BlockStatement
src/components/SentencePhoneticPanel.tsx:136:27
 
   const handlePlay = async () => {
     if (!editedText.trim()) return;
-    if (audioRef.current) {
-      audioRef.current.pause();
-      audioRef.current = null;
-    }
+    if (audioRef.current) {}
     setIsLoading(true);
     setIsPlaying(false);

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:140:18
       audioRef.current.pause();
       audioRef.current = null;
     }
-    setIsLoading(true);
+    setIsLoading(false);
     setIsPlaying(false);
     try {

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:141:18
       audioRef.current = null;
     }
     setIsLoading(true);
-    setIsPlaying(false);
+    setIsPlaying(true);
     try {
       const vt = transformToVabamorf(editedText);

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:142:9
     }
     setIsLoading(true);
     setIsPlaying(false);
-    try {
-      const vt = transformToVabamorf(editedText);
-      const url = await synthesizeWithPolling(
-        vt || "",
-        getVoiceModel(vt || ""),
-      );
-      const { audio } = createAudioPlayer(url, {
-        onLoaded: () => {
-          setIsLoading(false);
-          setIsPlaying(true);
-        },
-        onEnded: () => {
-          setIsPlaying(false);
-          setIsLoading(false);
-          audioRef.current = null;
-        },
-        onError: () => {
-          setIsPlaying(false);
-          setIsLoading(false);
-          audioRef.current = null;
-        },
-      });
-      audioRef.current = audio;
-      await audio.play();
-    } catch (e) {
+    try {} catch (e) {
       console.error("Failed to play:", e);
       setIsPlaying(false);
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:145:9
     try {
       const vt = transformToVabamorf(editedText);
       const url = await synthesizeWithPolling(
-        vt || "",
+        true,
         getVoiceModel(vt || ""),
       );

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:145:9
     try {
       const vt = transformToVabamorf(editedText);
       const url = await synthesizeWithPolling(
-        vt || "",
+        false,
         getVoiceModel(vt || ""),
       );

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:146:23
       const vt = transformToVabamorf(editedText);
       const url = await synthesizeWithPolling(
         vt || "",
-        getVoiceModel(vt || ""),
+        getVoiceModel(true),
       );
       const { audio } = createAudioPlayer(url, {

[Survived] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:146:23
       const vt = transformToVabamorf(editedText);
       const url = await synthesizeWithPolling(
         vt || "",
-        getVoiceModel(vt || ""),
+        getVoiceModel(false),
       );
       const { audio } = createAudioPlayer(url, {

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:149:25
         getVoiceModel(vt || ""),
       );
       const { audio } = createAudioPlayer(url, {
-        onLoaded: () => {
-          setIsLoading(false);
-          setIsPlaying(true);
-        },
+        onLoaded: () => {},
         onEnded: () => {
           setIsPlaying(false);

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:150:24
       );
       const { audio } = createAudioPlayer(url, {
         onLoaded: () => {
-          setIsLoading(false);
+          setIsLoading(true);
           setIsPlaying(true);
         },

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:151:24
       const { audio } = createAudioPlayer(url, {
         onLoaded: () => {
           setIsLoading(false);
-          setIsPlaying(true);
+          setIsPlaying(false);
         },
         onEnded: () => {

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:153:24
           setIsLoading(false);
           setIsPlaying(true);
         },
-        onEnded: () => {
-          setIsPlaying(false);
-          setIsLoading(false);
-          audioRef.current = null;
-        },
+        onEnded: () => {},
         onError: () => {
           setIsPlaying(false);

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:154:24
           setIsPlaying(true);
         },
         onEnded: () => {
-          setIsPlaying(false);
+          setIsPlaying(true);
           setIsLoading(false);
           audioRef.current = null;

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:155:24
         },
         onEnded: () => {
           setIsPlaying(false);
-          setIsLoading(false);
+          setIsLoading(true);
           audioRef.current = null;
         },

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:158:24
           setIsLoading(false);
           audioRef.current = null;
         },
-        onError: () => {
-          setIsPlaying(false);
-          setIsLoading(false);
-          audioRef.current = null;
-        },
+        onError: () => {},
       });
       audioRef.current = audio;

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:159:24
           audioRef.current = null;
         },
         onError: () => {
-          setIsPlaying(false);
+          setIsPlaying(true);
           setIsLoading(false);
           audioRef.current = null;

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:166:17
       });
       audioRef.current = audio;
       await audio.play();
-    } catch (e) {
-      console.error("Failed to play:", e);
-      setIsPlaying(false);
-      setIsLoading(false);
-    }
+    } catch (e) {}
   };
 
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:168:20
       await audio.play();
     } catch (e) {
       console.error("Failed to play:", e);
-      setIsPlaying(false);
+      setIsPlaying(true);
       setIsLoading(false);
     }

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:173:29
     }
   };
 
-  const handleApply = () => {
-    if (!editedText.trim()) return;
-    onApply(transformToVabamorf(editedText) || "");
-    onClose();
-  };
+  const handleApply = () => {};
 
   const handleClose = () => {
killedBy: SentencePhoneticPanel calls onApply when apply button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Héllo wórld' ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:174:9
   };
 
   const handleApply = () => {
-    if (!editedText.trim()) return;
+    if (editedText.trim()) return;
     onApply(transformToVabamorf(editedText) || "");
     onClose();
killedBy: SentencePhoneticPanel calls onApply when apply button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Héllo wórld' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:174:9
   };
 
   const handleApply = () => {
-    if (!editedText.trim()) return;
+    if (true) return;
     onApply(transformToVabamorf(editedText) || "");
     onClose();
killedBy: SentencePhoneticPanel calls onApply when apply button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Héllo wórld' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:175:13
 
   const handleApply = () => {
     if (!editedText.trim()) return;
-    onApply(transformToVabamorf(editedText) || "");
+    onApply(true);
     onClose();
   };
killedBy: SentencePhoneticPanel calls onApply when apply button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Héllo wórld' ]

Received: 

  1st vi.fn() call:

  [
-   "Héllo wórld",

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:175:13
 
   const handleApply = () => {
     if (!editedText.trim()) return;
-    onApply(transformToVabamorf(editedText) || "");
+    onApply(false);
     onClose();
   };
killedBy: SentencePhoneticPanel calls onApply when apply button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'Héllo wórld' ]

Received: 

  1st vi.fn() call:

  [
-   "Héllo wórld",

[Killed] BlockStatement
src/components/SentencePhoneticPanel.tsx:179:29
     onClose();
   };
 
-  const handleClose = () => {
-    if (audioRef.current) {
-      audioRef.current.pause();
-      audioRef.current = null;
-    }
-    setIsPlaying(false);
-    setIsLoading(false);
-    onClose();
-  };
+  const handleClose = () => {};
 
   if (!isOpen) return null;
killedBy: SentencePhoneticPanel calls onClose when close button is clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:180:9
   };
 
   const handleClose = () => {
-    if (audioRef.current) {
+    if (true) {
       audioRef.current.pause();
       audioRef.current = null;
killedBy: SentencePhoneticPanel calls onClose when close button is clicked
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/components/SentencePhoneticPanel.tsx:180:27
   };
 
   const handleClose = () => {
-    if (audioRef.current) {
-      audioRef.current.pause();
-      audioRef.current = null;
-    }
+    if (audioRef.current) {}
     setIsPlaying(false);
     setIsLoading(false);

[Survived] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:184:18
       audioRef.current.pause();
       audioRef.current = null;
     }
-    setIsPlaying(false);
+    setIsPlaying(true);
     setIsLoading(false);
     onClose();

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:189:7
     onClose();
   };
 
-  if (!isOpen) return null;
+  if (false) return null;
 
   return (
killedBy: SentencePhoneticPanel rendering returns null when not open
statusReason: expected <div …(1)>…(2)</div> to be null

[Killed] ConditionalExpression
src/components/SentencePhoneticPanel.tsx:193:8
 
   return (
     <div className="sentence-phonetic-panel">
-      {!showGuide && (
-        <div className="sentence-phonetic-panel__header">
-          <div className="sentence-phonetic-panel__title-section">
-            <h3 className="sentence-phonetic-panel__title">
-              Muuda häälduskuju
-            </h3>
-          </div>
-          <div className="sentence-phonetic-panel__header-actions">
-            <button
-              onClick={handleClose}
-              className="sentence-phonetic-panel__close"
-              aria-label="Sulge"
-            >
-              <CloseIcon size="2xl" />
-            </button>
-          </div>
-        </div>
-      )}
+      {false}
       <div className="sentence-phonetic-panel__content">
         {showGuide ? (
killedBy: SentencePhoneticPanel calls onClose when close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  paragraph:

  Name "":
  <p

[Killed] LogicalOperator
src/components/SentencePhoneticPanel.tsx:193:8
 
   return (
     <div className="sentence-phonetic-panel">
-      {!showGuide && (
-        <div className="sentence-phonetic-panel__header">
-          <div className="sentence-phonetic-panel__title-section">
-            <h3 className="sentence-phonetic-panel__title">
-              Muuda häälduskuju
-            </h3>
-          </div>
-          <div className="sentence-phonetic-panel__header-actions">
-            <button
-              onClick={handleClose}
-              className="sentence-phonetic-panel__close"
-              aria-label="Sulge"
-            >
-              <CloseIcon size="2xl" />
-            </button>
-          </div>
-        </div>
-      )}
+      {!showGuide || <div className="sentence-phonetic-panel__header">
+          <div className="sentence-phonetic-panel__title-section">
+            <h3 className="sentence-phonetic-panel__title">
+              Muuda häälduskuju
+            </h3>
+          </div>
+          <div className="sentence-phonetic-panel__header-actions">
+            <button onClick={handleClose} className="sentence-phonetic-panel__close" aria-label="Sulge">
+              <CloseIcon size="2xl" />
+            </button>
+          </div>
+        </div>}
       <div className="sentence-phonetic-panel__content">
         {showGuide ? (
killedBy: SentencePhoneticPanel calls onClose when close button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/sulge/i`

Here are the accessible roles:

  paragraph:

  Name "":
  <p

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:213:49
       )}
       <div className="sentence-phonetic-panel__content">
         {showGuide ? (
-          <GuideView onBack={() => setShowGuide(false)} onClose={handleClose} />
+          <GuideView onBack={() => setShowGuide(true)} onClose={handleClose} />
         ) : (
           <div className="sentence-phonetic-panel__edit-section">
killedBy: SentencePhoneticPanel markers guide box returns to edit view when back button clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h4>
  Hääldusmärkide juhend
</h4> instead
