[Killed] ArrowFunction
src/components/SentencePhoneticPanel.tsx:213:30
       )}
       <div className="sentence-phonetic-panel__content">
         {showGuide ? (
-          <GuideView onBack={() => setShowGuide(false)} onClose={handleClose} />
+          <GuideView onBack={() => undefined} onClose={handleClose} />
         ) : (
           <div className="sentence-phonetic-panel__edit-section">
killedBy: SentencePhoneticPanel markers guide box returns to edit view when back button clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h4>
  Hääldusmärkide juhend
</h4> instead

[Killed] ArrowFunction
src/components/SentencePhoneticPanel.tsx:223:27
               <textarea
                 ref={inputRef}
                 value={editedText}
-                onChange={(e) => setEditedText(e.target.value)}
+                onChange={() => undefined}
                 className="sentence-phonetic-panel__textarea"
                 placeholder="Kirjuta oma foneetiline variant"
killedBy: SentencePhoneticPanel allows editing phonetic text
statusReason: expect(element).toHaveValue(New phonetic)

Expected the element to have value:
  New phonetic
Received:
  Héllo wórld

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:231:47
             </div>
             <MarkersGuideBox
               onInsertMarker={insertMarkerAtCursor}
-              onShowGuide={() => setShowGuide(true)}
+              onShowGuide={() => setShowGuide(false)}
               className="sentence-phonetic-panel__markers-guide-box"
             />
killedBy: SentencePhoneticPanel markers guide box shows guide view when info button clicked
statusReason: Unable to find an element with the text: Hääldusmärkide juhend. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] ArrowFunction
src/components/SentencePhoneticPanel.tsx:231:28
             </div>
             <MarkersGuideBox
               onInsertMarker={insertMarkerAtCursor}
-              onShowGuide={() => setShowGuide(true)}
+              onShowGuide={() => undefined}
               className="sentence-phonetic-panel__markers-guide-box"
             />
killedBy: SentencePhoneticPanel markers guide box shows guide view when info button clicked
statusReason: Unable to find an element with the text: Hääldusmärkide juhend. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-phonetic-panel"
    >

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:237:27
             <div className="sentence-phonetic-panel__actions">
               <button
                 onClick={handlePlay}
-                disabled={!editedText.trim() || isLoading}
+                disabled={editedText.trim() || isLoading}
                 className={`button button--primary ${isLoading ? "loading" : ""} ${isPlaying ? "playing" : ""}`}
                 title={isLoading ? "Laen..." : isPlaying ? "Mängib" : "Kuula"}
killedBy: SentencePhoneticPanel handles play error gracefully
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
src/components/SentencePhoneticPanel.tsx:237:27
             <div className="sentence-phonetic-panel__actions">
               <button
                 onClick={handlePlay}
-                disabled={!editedText.trim() || isLoading}
+                disabled={!editedText.trim() && isLoading}
                 className={`button button--primary ${isLoading ? "loading" : ""} ${isPlaying ? "playing" : ""}`}
                 title={isLoading ? "Laen..." : isPlaying ? "Mängib" : "Kuula"}
killedBy: SentencePhoneticPanel play functionality disables play button when text is empty
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="button button--primary  "
  title="Kuula"
/>

[Killed] StringLiteral
src/components/SentencePhoneticPanel.tsx:238:28
               <button
                 onClick={handlePlay}
                 disabled={!editedText.trim() || isLoading}
-                className={`button button--primary ${isLoading ? "loading" : ""} ${isPlaying ? "playing" : ""}`}
+                className={``}
                 title={isLoading ? "Laen..." : isPlaying ? "Mängib" : "Kuula"}
               >
killedBy: SentencePhoneticPanel play button has button--primary class
statusReason: expected '' to contain 'button--primary'

[Survived] StringLiteral
src/components/SentencePhoneticPanel.tsx:238:78
               <button
                 onClick={handlePlay}
                 disabled={!editedText.trim() || isLoading}
-                className={`button button--primary ${isLoading ? "loading" : ""} ${isPlaying ? "playing" : ""}`}
+                className={`button button--primary ${isLoading ? "loading" : "Stryker was here!"} ${isPlaying ? "playing" : ""}`}
                 title={isLoading ? "Laen..." : isPlaying ? "Mängib" : "Kuula"}
               >

[Survived] StringLiteral
src/components/SentencePhoneticPanel.tsx:239:71
                 onClick={handlePlay}
                 disabled={!editedText.trim() || isLoading}
                 className={`button button--primary ${isLoading ? "loading" : ""} ${isPlaying ? "playing" : ""}`}
-                title={isLoading ? "Laen..." : isPlaying ? "Mängib" : "Kuula"}
+                title={isLoading ? "Laen..." : isPlaying ? "Mängib" : ""}
               >
                 {isLoading ? (

[Killed] BooleanLiteral
src/components/SentencePhoneticPanel.tsx:252:27
               </button>
               <button
                 onClick={handleApply}
-                disabled={!editedText.trim()}
+                disabled={editedText.trim()}
                 className="button button--secondary"
               >
killedBy: SentencePhoneticPanel apply functionality calls onApply with transformed text when apply clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'test<' ]

Number of calls: 0

[Survived] MethodExpression
src/components/SentencePhoneticPanel.tsx:252:28
               </button>
               <button
                 onClick={handleApply}
-                disabled={!editedText.trim()}
+                disabled={!editedText}
                 className="button button--secondary"
               >
