[Survived] ArrayDeclaration
src/components/SentenceSynthesisItem.tsx:94:33
   id,
   text,
   tags = [],
-  stressedTags: _stressedTags = [],
+  stressedTags: _stressedTags = ["Stryker was here"],
   mode,
   draggable = false,

[Survived] BooleanLiteral
src/components/SentenceSynthesisItem.tsx:96:15
   tags = [],
   stressedTags: _stressedTags = [],
   mode,
-  draggable = false,
+  draggable = true,
   isDragging = false,
   isDragOver = false,

[Survived] BooleanLiteral
src/components/SentenceSynthesisItem.tsx:97:16
   stressedTags: _stressedTags = [],
   mode,
   draggable = false,
-  isDragging = false,
+  isDragging = true,
   isDragOver = false,
   onDragStart,

[Survived] BooleanLiteral
src/components/SentenceSynthesisItem.tsx:98:16
   mode,
   draggable = false,
   isDragging = false,
-  isDragOver = false,
+  isDragOver = true,
   onDragStart,
   onDragEnd,

[Survived] BooleanLiteral
src/components/SentenceSynthesisItem.tsx:104:15
   onDragOver,
   onDragLeave,
   onDrop,
-  isPlaying = false,
+  isPlaying = true,
   isLoading = false,
   onPlay,

[Killed] BooleanLiteral
src/components/SentenceSynthesisItem.tsx:105:15
   onDragLeave,
   onDrop,
   isPlaying = false,
-  isLoading = false,
+  isLoading = true,
   onPlay,
   onTagClick,
killedBy: SentenceSynthesisItem play button renders play button
statusReason: Unable to find an accessible element with the role "button" and name `/play/i`

Here are the accessible roles:

  button:

  Name "Loading":
  <button

[Survived] ArrayDeclaration
src/components/SentenceSynthesisItem.tsx:113:18
   onTagMenuOpen,
   openTagMenu,
   onTagMenuClose,
-  tagMenuItems = [],
+  tagMenuItems = ["Stryker was here"],
   loadingTagIndex,
   editingTag,

[Killed] BlockStatement
src/components/SentenceSynthesisItem.tsx:136:65
 }: SentenceSynthesisItemProps): React.ReactElement {
   const containerRef = useRef<HTMLDivElement>(null);
 
-  const handleDragStartInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
-      e.dataTransfer.setDragImage(
-        containerRef.current,
-        20,
-        containerRef.current.offsetHeight / 2,
-      );
-      setTimeout(() => {
-        if (containerRef.current) {
-          containerRef.current.style.opacity = "0.5";
-        }
-      }, 0);
-    }
-    if (onDragStart) {
-      onDragStart(e, id);
-    }
-  };
+  const handleDragStartInternal = (e: React.DragEvent): void => {};
 
   const handleDragEndInternal = (e: React.DragEvent): void => {
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragStart with id on drag start
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0

[Survived] BlockStatement
src/components/SentenceSynthesisItem.tsx:137:31
   const containerRef = useRef<HTMLDivElement>(null);
 
   const handleDragStartInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
-      e.dataTransfer.setDragImage(
-        containerRef.current,
-        20,
-        containerRef.current.offsetHeight / 2,
-      );
-      setTimeout(() => {
-        if (containerRef.current) {
-          containerRef.current.style.opacity = "0.5";
-        }
-      }, 0);
-    }
+    if (containerRef.current) {}
     if (onDragStart) {
       onDragStart(e, id);

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:137:9
   const containerRef = useRef<HTMLDivElement>(null);
 
   const handleDragStartInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
+    if (false) {
       e.dataTransfer.setDragImage(
         containerRef.current,

[Survived] ArithmeticOperator
src/components/SentenceSynthesisItem.tsx:141:9
       e.dataTransfer.setDragImage(
         containerRef.current,
         20,
-        containerRef.current.offsetHeight / 2,
+        containerRef.current.offsetHeight * 2,
       );
       setTimeout(() => {

[Survived] BlockStatement
src/components/SentenceSynthesisItem.tsx:143:24
         20,
         containerRef.current.offsetHeight / 2,
       );
-      setTimeout(() => {
-        if (containerRef.current) {
-          containerRef.current.style.opacity = "0.5";
-        }
-      }, 0);
+      setTimeout(() => {}, 0);
     }
     if (onDragStart) {

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:144:13
         containerRef.current.offsetHeight / 2,
       );
       setTimeout(() => {
-        if (containerRef.current) {
+        if (true) {
           containerRef.current.style.opacity = "0.5";
         }

[NoCoverage] BlockStatement
src/components/SentenceSynthesisItem.tsx:144:35
         containerRef.current.offsetHeight / 2,
       );
       setTimeout(() => {
-        if (containerRef.current) {
-          containerRef.current.style.opacity = "0.5";
-        }
+        if (containerRef.current) {}
       }, 0);
     }

[NoCoverage] StringLiteral
src/components/SentenceSynthesisItem.tsx:145:48
       );
       setTimeout(() => {
         if (containerRef.current) {
-          containerRef.current.style.opacity = "0.5";
+          containerRef.current.style.opacity = "";
         }
       }, 0);

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:149:9
         }
       }, 0);
     }
-    if (onDragStart) {
+    if (false) {
       onDragStart(e, id);
     }
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragStart with id on drag start
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceSynthesisItem.tsx:149:22
         }
       }, 0);
     }
-    if (onDragStart) {
-      onDragStart(e, id);
-    }
+    if (onDragStart) {}
   };
 
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragStart with id on drag start
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceSynthesisItem.tsx:154:63
     }
   };
 
-  const handleDragEndInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
-      containerRef.current.style.opacity = "1";
-    }
-    if (onDragEnd) {
-      onDragEnd(e);
-    }
-  };
+  const handleDragEndInternal = (e: React.DragEvent): void => {};
 
   const containerClasses = [
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragEnd on drag end
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/components/SentenceSynthesisItem.tsx:155:31
   };
 
   const handleDragEndInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
-      containerRef.current.style.opacity = "1";
-    }
+    if (containerRef.current) {}
     if (onDragEnd) {
       onDragEnd(e);

[Survived] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:155:9
   };
 
   const handleDragEndInternal = (e: React.DragEvent): void => {
-    if (containerRef.current) {
+    if (false) {
       containerRef.current.style.opacity = "1";
     }

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:158:9
     if (containerRef.current) {
       containerRef.current.style.opacity = "1";
     }
-    if (onDragEnd) {
+    if (false) {
       onDragEnd(e);
     }
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragEnd on drag end
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/SentenceSynthesisItem.tsx:158:20
     if (containerRef.current) {
       containerRef.current.style.opacity = "1";
     }
-    if (onDragEnd) {
-      onDragEnd(e);
-    }
+    if (onDragEnd) {}
   };
 
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragEnd on drag end
statusReason: expected "vi.fn()" to be called at least once

[Survived] MethodExpression
src/components/SentenceSynthesisItem.tsx:163:28
     }
   };
 
-  const containerClasses = [
-    "sentence-synthesis-item",
-    isDragging && "sentence-synthesis-item--dragging",
-    isDragOver && "sentence-synthesis-item--drag-over",
-    className,
-  ]
-    .filter(Boolean)
+  const containerClasses = ["sentence-synthesis-item", isDragging && "sentence-synthesis-item--dragging", isDragOver && "sentence-synthesis-item--drag-over", className]
     .join(" ");
 

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:165:5
 
   const containerClasses = [
     "sentence-synthesis-item",
-    isDragging && "sentence-synthesis-item--dragging",
+    isDragging || "sentence-synthesis-item--dragging",
     isDragOver && "sentence-synthesis-item--drag-over",
     className,
killedBy: SentenceSynthesisItem drag and drop applies dragging class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:165:5
 
   const containerClasses = [
     "sentence-synthesis-item",
-    isDragging && "sentence-synthesis-item--dragging",
+    false,
     isDragOver && "sentence-synthesis-item--drag-over",
     className,
killedBy: SentenceSynthesisItem drag and drop applies dragging class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:166:5
   const containerClasses = [
     "sentence-synthesis-item",
     isDragging && "sentence-synthesis-item--dragging",
-    isDragOver && "sentence-synthesis-item--drag-over",
+    isDragOver || "sentence-synthesis-item--drag-over",
     className,
   ]
killedBy: SentenceSynthesisItem drag and drop applies drag-over class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:166:5
   const containerClasses = [
     "sentence-synthesis-item",
     isDragging && "sentence-synthesis-item--dragging",
-    isDragOver && "sentence-synthesis-item--drag-over",
+    false,
     className,
   ]
killedBy: SentenceSynthesisItem drag and drop applies drag-over class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] StringLiteral
src/components/SentenceSynthesisItem.tsx:170:11
     className,
   ]
     .filter(Boolean)
-    .join(" ");
+    .join("");
 
   const renderContent = (): React.ReactElement => {
killedBy: SentenceSynthesisItem drag and drop applies dragging class
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:174:7
 
   const renderContent = (): React.ReactElement => {
     switch (mode) {
-      case "input":
-        return (
-          <TagsInput
-            id={id}
-            tags={tags}
-            currentInput={currentInput}
-            placeholder={placeholder}
-            sentenceIndex={sentenceIndex}
-            selectedTagIndex={selectedTagIndex}
-            isPronunciationPanelOpen={isPronunciationPanelOpen}
-            openTagMenu={openTagMenu}
-            tagMenuItems={tagMenuItems}
-            loadingTagIndex={loadingTagIndex}
-            onTagMenuOpen={onTagMenuOpen}
-            onTagMenuClose={onTagMenuClose}
-            editingTag={editingTag}
-            onEditTagChange={onEditTagChange}
-            onEditTagKeyDown={onEditTagKeyDown}
-            onEditTagCommit={onEditTagCommit}
-            onInputChange={onInputChange}
-            onInputKeyDown={onInputKeyDown}
-            onInputBlur={onInputBlur}
-            onClear={onClear}
-          />
-        );
+      case "input":
 
       case "tags":
killedBy: SentenceSynthesisItem rendering modes renders input field in input mode
statusReason: Unable to find an accessible element with the role "textbox"

Here are the accessible roles:

  button:

  Name "Play":
  <button

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:200:7
           />
         );
 
-      case "tags":
-        return (
-          <TagsList
-            id={id}
-            tags={tags}
-            selectedTagIndex={selectedTagIndex}
-            isPronunciationPanelOpen={isPronunciationPanelOpen}
-            onTagClick={onTagClick}
-          />
-        );
+      case "tags":
 
       case "readonly":
killedBy: SentenceSynthesisItem rendering modes renders tags in tags mode
statusReason: Unable to find an element with the text: Hello. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:211:7
           />
         );
 
-      case "readonly":
-        return (
-          <div className="sentence-synthesis-item__content">
-            <div className="sentence-synthesis-item__text-readonly">{text}</div>
-          </div>
-        );
+      case "readonly":
     }
   };
killedBy: SentenceSynthesisItem rendering modes renders text in readonly mode
statusReason: Unable to find an element with the text: Hello world test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ArrowFunction
src/components/SentenceSynthesisItem.tsx:224:32
     <div
       ref={containerRef}
       className={containerClasses}
-      onDragOver={onDragOver ? (e) => onDragOver(e, id) : undefined}
+      onDragOver={onDragOver ? () => undefined : undefined}
       onDragLeave={onDragLeave}
       onDrop={onDrop ? (e) => onDrop(e, id) : undefined}
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDragOver on container dragover
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0

[Killed] ArrowFunction
src/components/SentenceSynthesisItem.tsx:226:24
       className={containerClasses}
       onDragOver={onDragOver ? (e) => onDragOver(e, id) : undefined}
       onDragLeave={onDragLeave}
-      onDrop={onDrop ? (e) => onDrop(e, id) : undefined}
+      onDrop={onDrop ? () => undefined : undefined}
     >
       {draggable && mode !== "readonly" && (
killedBy: SentenceSynthesisItem drag start and end internal handlers calls onDrop on container drop
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:228:21
       onDragLeave={onDragLeave}
       onDrop={onDrop ? (e) => onDrop(e, id) : undefined}
     >
-      {draggable && mode !== "readonly" && (
+      {draggable && true && (
         <div
           className="sentence-synthesis-item__drag-handle"
killedBy: SentenceSynthesisItem drag and drop does not show drag handle in readonly mode
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-label="Drag to reorder"
  class="sentence-synthesis-item__drag-handle"
  draggable="true"
>
  <span

[Killed] EqualityOperator
src/components/SentenceSynthesisItem.tsx:228:21
       onDragLeave={onDragLeave}
       onDrop={onDrop ? (e) => onDrop(e, id) : undefined}
     >
-      {draggable && mode !== "readonly" && (
+      {draggable && mode === "readonly" && (
         <div
           className="sentence-synthesis-item__drag-handle"
killedBy: SentenceSynthesisItem drag and drop shows drag handle when draggable
statusReason: Unable to find a label with the text of: Drag to reorder

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:246:11
         isPlaying={isPlaying}
         isLoading={isLoading}
         disabled={
-          isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          false
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem play button disables play button when loading
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  aria-label="Loading"
  class="sentence-synthesis-item__play button button--primary button--icon-only button--circular loading "
  data-onboarding-target="sentence-0-play"
/>

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:246:11
         isPlaying={isPlaying}
         isLoading={isLoading}
         disabled={
-          isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          true
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem play button calls onPlay when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-sentence' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:247:32
         isLoading={isLoading}
         disabled={
           isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          (mode === "input" && true && !currentInput.trim())
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem play button enables play button in input mode with tags
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  aria-label="Play"
  class="sentence-synthesis-item__play button button--primary button--icon-only button--circular  "
  data-onboarding-target="sentence-0-play"
  disabled=""

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:247:12
         isLoading={isLoading}
         disabled={
           isLoading ||
-          (mode === "input" && tags.length === 0 && !currentInput.trim())
+          (true && !currentInput.trim())
         }
         onClick={() => onPlay(id)}
killedBy: SentenceSynthesisItem play button calls onPlay when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-sentence' ]

Number of calls: 0

[Killed] ArrowFunction
src/components/SentenceSynthesisItem.tsx:249:18
           isLoading ||
           (mode === "input" && tags.length === 0 && !currentInput.trim())
         }
-        onClick={() => onPlay(id)}
+        onClick={() => undefined}
         data-onboarding-target={`sentence-${sentenceIndex}-play`}
       />
killedBy: SentenceSynthesisItem play button calls onPlay when clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-sentence' ]

Number of calls: 0

[Killed] EqualityOperator
src/components/SentenceSynthesisItem.tsx:253:22
         data-onboarding-target={`sentence-${sentenceIndex}-play`}
       />
 
-      {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
+      {onMenuOpen && rowMenuItems.length <= 0 && onMenuClose && (
         <RowMenu
           id={id}
killedBy: SentenceSynthesisItem row menu shows menu button when onMenuOpen provided
statusReason: Unable to find a label with the text of: Rohkem valikuid

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:253:8
         data-onboarding-target={`sentence-${sentenceIndex}-play`}
       />
 
-      {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
-        <RowMenu
-          id={id}
-          isOpen={openMenuId === id}
-          items={rowMenuItems}
-          onOpen={onMenuOpen}
-          onClose={onMenuClose}
-          data-onboarding-target={`sentence-${sentenceIndex}-menu`}
-        />
-      )}
+      {true}
 
       {onMenuOpenLegacy && (
killedBy: SentenceSynthesisItem row menu shows menu button when onMenuOpen provided
statusReason: Unable to find a label with the text of: Rohkem valikuid

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:256:19
       {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
         <RowMenu
           id={id}
-          isOpen={openMenuId === id}
+          isOpen={false}
           items={rowMenuItems}
           onOpen={onMenuOpen}
killedBy: SentenceSynthesisItem row menu open state shows open menu when openMenuId matches
statusReason: Unable to find an accessible element with the role "menu"

Here are the accessible roles:

  button:

  Name "Play":
  <button

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:256:19
       {onMenuOpen && rowMenuItems.length > 0 && onMenuClose && (
         <RowMenu
           id={id}
-          isOpen={openMenuId === id}
+          isOpen={true}
           items={rowMenuItems}
           onOpen={onMenuOpen}
killedBy: SentenceSynthesisItem row menu open state does not show menu when openMenuId does not match
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-label="Lausungi valikud"
  class="sentence-synthesis-item__dropdown-menu sentence-synthesis-item__dropdown-menu--fixed"
  role="menu"
  style="top: 4px; right: 1024px;"
>

[Killed] LogicalOperator
src/components/SentenceSynthesisItem.tsx:264:8
         />
       )}
 
-      {onMenuOpenLegacy && (
-        <div className="sentence-synthesis-item__menu-container">
-          <button
-            className="sentence-synthesis-item__menu-button"
-            aria-label="More options"
-            onClick={(e) => onMenuOpenLegacy(e, id)}
-            data-onboarding-target={`sentence-${sentenceIndex}-menu`}
-          >
-            <MoreIcon size="2xl" />
-          </button>
-          {menuContent}
-        </div>
-      )}
+      {onMenuOpenLegacy || <div className="sentence-synthesis-item__menu-container">
+          <button className="sentence-synthesis-item__menu-button" aria-label="More options" onClick={e => onMenuOpenLegacy(e, id)} data-onboarding-target={`sentence-${sentenceIndex}-menu`}>
+            <MoreIcon size="2xl" />
+          </button>
+          {menuContent}
+        </div>}
     </div>
   );
killedBy: SentenceSynthesisItem legacy menu shows legacy menu button when onMenuOpenLegacy provided
statusReason: Unable to find a label with the text of: More options

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ConditionalExpression
src/components/SentenceSynthesisItem.tsx:264:8
         />
       )}
 
-      {onMenuOpenLegacy && (
-        <div className="sentence-synthesis-item__menu-container">
-          <button
-            className="sentence-synthesis-item__menu-button"
-            aria-label="More options"
-            onClick={(e) => onMenuOpenLegacy(e, id)}
-            data-onboarding-target={`sentence-${sentenceIndex}-menu`}
-          >
-            <MoreIcon size="2xl" />
-          </button>
-          {menuContent}
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: SentenceSynthesisItem legacy menu shows legacy menu button when onMenuOpenLegacy provided
statusReason: Unable to find a label with the text of: More options

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sentence-synthesis-item"
    >

[Killed] ArrowFunction
src/components/SentenceSynthesisItem.tsx:269:22
           <button
             className="sentence-synthesis-item__menu-button"
             aria-label="More options"
-            onClick={(e) => onMenuOpenLegacy(e, id)}
+            onClick={() => undefined}
             data-onboarding-target={`sentence-${sentenceIndex}-menu`}
           >
killedBy: SentenceSynthesisItem legacy menu click handler calls onMenuOpenLegacy with event and id
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'test-sentence' ]

Number of calls: 0
