[Killed] BooleanLiteral
src/components/ShareTaskModal.tsx:24:46
   onClose,
 }: ShareTaskModalProps) {
   const { showNotification } = useNotification();
-  const [isCopying, setIsCopying] = useState(false);
+  const [isCopying, setIsCopying] = useState(true);
   if (!isOpen) return null;
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
killedBy: ShareTaskModal rendering renders copy button
statusReason: Unable to find an accessible element with the role "button" and name "Kopeeri"

Here are the accessible roles:

  dialog:

  Name "Jaga ülesanne":
  <div

[Killed] BooleanLiteral
src/components/ShareTaskModal.tsx:25:7
 }: ShareTaskModalProps) {
   const { showNotification } = useNotification();
   const [isCopying, setIsCopying] = useState(false);
-  if (!isOpen) return null;
+  if (isOpen) return null;
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
   const handleCopyLink = async () => {
killedBy: ShareTaskModal rendering renders when open
statusReason: Unable to find an element with the text: Jaga ülesanne. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/ShareTaskModal.tsx:25:7
 }: ShareTaskModalProps) {
   const { showNotification } = useNotification();
   const [isCopying, setIsCopying] = useState(false);
-  if (!isOpen) return null;
+  if (true) return null;
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
   const handleCopyLink = async () => {
killedBy: ShareTaskModal rendering renders when open
statusReason: Unable to find an element with the text: Jaga ülesanne. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BlockStatement
src/components/ShareTaskModal.tsx:27:38
   const [isCopying, setIsCopying] = useState(false);
   if (!isOpen) return null;
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
-  const handleCopyLink = async () => {
-    setIsCopying(true);
-    try {
-      await navigator.clipboard.writeText(shareUrl);
-      showNotification(
-        "success",
-        "Jagamislink kopeeritud!",
-        undefined,
-        undefined,
-        "success",
-      );
-    } catch (e) {
-      console.error("Failed to copy share link:", e);
-      showNotification("error", "Viga lingi kopeerimisel");
-    } finally {
-      setIsCopying(false);
-    }
-  };
+  const handleCopyLink = async () => {};
   return (
     <BaseModal

[Survived] BooleanLiteral
src/components/ShareTaskModal.tsx:28:18
   if (!isOpen) return null;
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
   const handleCopyLink = async () => {
-    setIsCopying(true);
+    setIsCopying(false);
     try {
       await navigator.clipboard.writeText(shareUrl);

[Survived] BlockStatement
src/components/ShareTaskModal.tsx:29:9
   const shareUrl = `${window.location.origin}/shared/task/${shareToken}`;
   const handleCopyLink = async () => {
     setIsCopying(true);
-    try {
-      await navigator.clipboard.writeText(shareUrl);
-      showNotification(
-        "success",
-        "Jagamislink kopeeritud!",
-        undefined,
-        undefined,
-        "success",
-      );
-    } catch (e) {
+    try {} catch (e) {
       console.error("Failed to copy share link:", e);
       showNotification("error", "Viga lingi kopeerimisel");

[NoCoverage] BlockStatement
src/components/ShareTaskModal.tsx:38:17
         undefined,
         "success",
       );
-    } catch (e) {
-      console.error("Failed to copy share link:", e);
-      showNotification("error", "Viga lingi kopeerimisel");
-    } finally {
+    } catch (e) {} finally {
       setIsCopying(false);
     }

[NoCoverage] StringLiteral
src/components/ShareTaskModal.tsx:40:33
       );
     } catch (e) {
       console.error("Failed to copy share link:", e);
-      showNotification("error", "Viga lingi kopeerimisel");
+      showNotification("error", "");
     } finally {
       setIsCopying(false);

[NoCoverage] StringLiteral
src/components/ShareTaskModal.tsx:40:24
       );
     } catch (e) {
       console.error("Failed to copy share link:", e);
-      showNotification("error", "Viga lingi kopeerimisel");
+      showNotification("", "Viga lingi kopeerimisel");
     } finally {
       setIsCopying(false);

[Survived] BlockStatement
src/components/ShareTaskModal.tsx:41:15
     } catch (e) {
       console.error("Failed to copy share link:", e);
       showNotification("error", "Viga lingi kopeerimisel");
-    } finally {
-      setIsCopying(false);
-    }
+    } finally {}
   };
   return (

[Survived] BooleanLiteral
src/components/ShareTaskModal.tsx:42:20
       console.error("Failed to copy share link:", e);
       showNotification("error", "Viga lingi kopeerimisel");
     } finally {
-      setIsCopying(false);
+      setIsCopying(true);
     }
   };

[Killed] StringLiteral
src/components/ShareTaskModal.tsx:76:40
           className="button button--primary"
           type="button"
         >
-          {isCopying ? "Kopeeritud!" : "Kopeeri"}
+          {isCopying ? "Kopeeritud!" : ""}
         </button>
       </div>
killedBy: ShareTaskModal rendering renders copy button
statusReason: Unable to find an accessible element with the role "button" and name "Kopeeri"

Here are the accessible roles:

  dialog:

  Name "Jaga ülesanne":
  <div
