[NoCoverage] ArrayDeclaration
src/components/SpecsPage.tsx:24:61
 
 function useSpecsData() {
   const [groups, setGroups] = useState<FeatureGroup[]>([]);
-  const [testSuites, setTestSuites] = useState<TestSuite[]>([]);
+  const [testSuites, setTestSuites] = useState<TestSuite[]>(["Stryker was here"]);
   const [loading, setLoading] = useState(true);
 

[NoCoverage] BooleanLiteral
src/components/SpecsPage.tsx:25:42
 function useSpecsData() {
   const [groups, setGroups] = useState<FeatureGroup[]>([]);
   const [testSuites, setTestSuites] = useState<TestSuite[]>([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:27:19
   const [testSuites, setTestSuites] = useState<TestSuite[]>([]);
   const [loading, setLoading] = useState(true);
 
-  useEffect(() => {
-    void loadSpecs();
-  }, []);
+  useEffect(() => {}, []);
 
   async function loadSpecs() {

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:31:30
     void loadSpecs();
   }, []);
 
-  async function loadSpecs() {
-    try {
-      const featureGroups = getFeatureGroups();
-      const parsedGroups = parseGroups(featureGroups);
-      setGroups(parsedGroups);
-      const cucumberResults = await loadCucumberResults();
-      if (cucumberResults) setTestSuites(parseCucumberResults(cucumberResults));
-    } catch {
-      /* silent */
-    } finally {
-      setLoading(false);
-    }
-  }
+  async function loadSpecs() {}
 
   function parseGroups(featureGroups: Record<string, Record<string, string>>) {

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:32:9
   }, []);
 
   async function loadSpecs() {
-    try {
-      const featureGroups = getFeatureGroups();
-      const parsedGroups = parseGroups(featureGroups);
-      setGroups(parsedGroups);
-      const cucumberResults = await loadCucumberResults();
-      if (cucumberResults) setTestSuites(parseCucumberResults(cucumberResults));
-    } catch {
+    try {} catch {
       /* silent */
     } finally {

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:37:11
       const parsedGroups = parseGroups(featureGroups);
       setGroups(parsedGroups);
       const cucumberResults = await loadCucumberResults();
-      if (cucumberResults) setTestSuites(parseCucumberResults(cucumberResults));
+      if (true) setTestSuites(parseCucumberResults(cucumberResults));
     } catch {
       /* silent */

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:37:11
       const parsedGroups = parseGroups(featureGroups);
       setGroups(parsedGroups);
       const cucumberResults = await loadCucumberResults();
-      if (cucumberResults) setTestSuites(parseCucumberResults(cucumberResults));
+      if (false) setTestSuites(parseCucumberResults(cucumberResults));
     } catch {
       /* silent */

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:40:15
       if (cucumberResults) setTestSuites(parseCucumberResults(cucumberResults));
     } catch {
       /* silent */
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   }
 

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:45:79
     }
   }
 
-  function parseGroups(featureGroups: Record<string, Record<string, string>>) {
-    const result: FeatureGroup[] = [];
-    for (const [groupName, featureFiles] of Object.entries(featureGroups)) {
-      const features: ParsedFeature[] = [];
-      for (const [, content] of Object.entries(featureFiles)) {
-        const parsed = parseFeatureContent(content);
-        if (parsed) features.push(parsed);
-      }
-      if (features.length > 0) result.push({ name: groupName, features });
-    }
-    return result;
-  }
+  function parseGroups(featureGroups: Record<string, Record<string, string>>) {}
 
   return { groups, testSuites, loading };

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:47:76
 
   function parseGroups(featureGroups: Record<string, Record<string, string>>) {
     const result: FeatureGroup[] = [];
-    for (const [groupName, featureFiles] of Object.entries(featureGroups)) {
-      const features: ParsedFeature[] = [];
-      for (const [, content] of Object.entries(featureFiles)) {
-        const parsed = parseFeatureContent(content);
-        if (parsed) features.push(parsed);
-      }
-      if (features.length > 0) result.push({ name: groupName, features });
-    }
+    for (const [groupName, featureFiles] of Object.entries(featureGroups)) {}
     return result;
   }

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:49:63
     const result: FeatureGroup[] = [];
     for (const [groupName, featureFiles] of Object.entries(featureGroups)) {
       const features: ParsedFeature[] = [];
-      for (const [, content] of Object.entries(featureFiles)) {
-        const parsed = parseFeatureContent(content);
-        if (parsed) features.push(parsed);
-      }
+      for (const [, content] of Object.entries(featureFiles)) {}
       if (features.length > 0) result.push({ name: groupName, features });
     }

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:51:13
       const features: ParsedFeature[] = [];
       for (const [, content] of Object.entries(featureFiles)) {
         const parsed = parseFeatureContent(content);
-        if (parsed) features.push(parsed);
+        if (false) features.push(parsed);
       }
       if (features.length > 0) result.push({ name: groupName, features });

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:51:13
       const features: ParsedFeature[] = [];
       for (const [, content] of Object.entries(featureFiles)) {
         const parsed = parseFeatureContent(content);
-        if (parsed) features.push(parsed);
+        if (true) features.push(parsed);
       }
       if (features.length > 0) result.push({ name: groupName, features });

[NoCoverage] EqualityOperator
src/components/SpecsPage.tsx:53:11
         const parsed = parseFeatureContent(content);
         if (parsed) features.push(parsed);
       }
-      if (features.length > 0) result.push({ name: groupName, features });
+      if (features.length >= 0) result.push({ name: groupName, features });
     }
     return result;

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:53:11
         const parsed = parseFeatureContent(content);
         if (parsed) features.push(parsed);
       }
-      if (features.length > 0) result.push({ name: groupName, features });
+      if (true) result.push({ name: groupName, features });
     }
     return result;

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:69:19
     new Set(),
   );
 
-  useEffect(() => {
-    if (groups.length > 0 && !selectedFeature) {
-      const first = groups[0];
-      if (first?.features[0]) {
-        setExpandedGroups(new Set([first.name]));
-        setSelectedFeature(first.features[0].name);
-        setExpandedFeatures(new Set([first.features[0].name]));
-      }
-    }
-  }, [groups, selectedFeature]);
+  useEffect(() => {}, [groups, selectedFeature]);
 
   const toggleSet = (set: Set<string>, name: string) => {

[NoCoverage] EqualityOperator
src/components/SpecsPage.tsx:70:9
   );
 
   useEffect(() => {
-    if (groups.length > 0 && !selectedFeature) {
+    if (groups.length <= 0 && !selectedFeature) {
       const first = groups[0];
       if (first?.features[0]) {

[NoCoverage] LogicalOperator
src/components/SpecsPage.tsx:70:9
   );
 
   useEffect(() => {
-    if (groups.length > 0 && !selectedFeature) {
+    if (groups.length > 0 || !selectedFeature) {
       const first = groups[0];
       if (first?.features[0]) {

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:72:11
   useEffect(() => {
     if (groups.length > 0 && !selectedFeature) {
       const first = groups[0];
-      if (first?.features[0]) {
+      if (true) {
         setExpandedGroups(new Set([first.name]));
         setSelectedFeature(first.features[0].name);

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:72:31
   useEffect(() => {
     if (groups.length > 0 && !selectedFeature) {
       const first = groups[0];
-      if (first?.features[0]) {
-        setExpandedGroups(new Set([first.name]));
-        setSelectedFeature(first.features[0].name);
-        setExpandedFeatures(new Set([first.features[0].name]));
-      }
+      if (first?.features[0]) {}
     }
   }, [groups, selectedFeature]);

[NoCoverage] ArrayDeclaration
src/components/SpecsPage.tsx:73:35
     if (groups.length > 0 && !selectedFeature) {
       const first = groups[0];
       if (first?.features[0]) {
-        setExpandedGroups(new Set([first.name]));
+        setExpandedGroups(new Set([]));
         setSelectedFeature(first.features[0].name);
         setExpandedFeatures(new Set([first.features[0].name]));

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:80:57
     }
   }, [groups, selectedFeature]);
 
-  const toggleSet = (set: Set<string>, name: string) => {
-    const next = new Set(set);
-    if (next.has(name)) next.delete(name);
-    else next.add(name);
-    return next;
-  };
+  const toggleSet = (set: Set<string>, name: string) => {};
 
   const allFeatures = groups.flatMap((g) => g.features);

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:82:9
 
   const toggleSet = (set: Set<string>, name: string) => {
     const next = new Set(set);
-    if (next.has(name)) next.delete(name);
+    if (false) next.delete(name);
     else next.add(name);
     return next;

[NoCoverage] ConditionalExpression
src/components/SpecsPage.tsx:82:9
 
   const toggleSet = (set: Set<string>, name: string) => {
     const next = new Set(set);
-    if (next.has(name)) next.delete(name);
+    if (true) next.delete(name);
     else next.add(name);
     return next;

[NoCoverage] ArrowFunction
src/components/SpecsPage.tsx:87:38
     return next;
   };
 
-  const allFeatures = groups.flatMap((g) => g.features);
+  const allFeatures = groups.flatMap(() => undefined);
   const selectedFeatureData =
     allFeatures.find((f) => f.name === selectedFeature) ?? null;

[NoCoverage] ArrowFunction
src/components/SpecsPage.tsx:89:22
 
   const allFeatures = groups.flatMap((g) => g.features);
   const selectedFeatureData =
-    allFeatures.find((f) => f.name === selectedFeature) ?? null;
+    allFeatures.find(() => undefined) ?? null;
 
   if (loading) {

[NoCoverage] LogicalOperator
src/components/SpecsPage.tsx:89:5
 
   const allFeatures = groups.flatMap((g) => g.features);
   const selectedFeatureData =
-    allFeatures.find((f) => f.name === selectedFeature) ?? null;
+    allFeatures.find(f => f.name === selectedFeature) && null;
 
   if (loading) {

[NoCoverage] BlockStatement
src/components/SpecsPage.tsx:91:16
   const selectedFeatureData =
     allFeatures.find((f) => f.name === selectedFeature) ?? null;
 
-  if (loading) {
-    return (
-      <div className="specs-page">
-        <div className="specs-page__header">
-          <button className="specs-page__back" onClick={onBack}>
-            ← Tagasi
-          </button>
-          <h1>Testid</h1>
-        </div>
-        <p className="specs-page__loading-text">Laen spetsifikatsioone...</p>
-      </div>
-    );
-  }
+  if (loading) {}
 
   return (

[NoCoverage] ArrowFunction
src/components/SpecsPage.tsx:120:26
           selectedFeature={selectedFeature}
           expandedGroups={expandedGroups}
           expandedFeatures={expandedFeatures}
-          onToggleGroup={(n) => setExpandedGroups(toggleSet(expandedGroups, n))}
+          onToggleGroup={() => undefined}
           onToggleFeature={(n) =>
             setExpandedFeatures(toggleSet(expandedFeatures, n))

[NoCoverage] ArrowFunction
src/components/SpecsPage.tsx:121:28
           expandedGroups={expandedGroups}
           expandedFeatures={expandedFeatures}
           onToggleGroup={(n) => setExpandedGroups(toggleSet(expandedGroups, n))}
-          onToggleFeature={(n) =>
-            setExpandedFeatures(toggleSet(expandedFeatures, n))
+          onToggleFeature={() => undefined
           }
           onSelectFeature={setSelectedFeature}
