[Killed] ArrowFunction
src/components/SynthesisView.tsx:85:25
   danger?: boolean;
 }
 
-const getTagMenuItems = (p: SynthesisViewProps): TagMenuItem[] => [
-  {
-    label: "Vali sõna häälduskuju",
-    onClick: (sid, tidx, w) => p.onOpenVariantsFromMenu(sid, tidx, w),
-  },
-  {
-    label: "Muuda sõna kirjakuju",
-    onClick: (sid, tidx) => p.onEditTag(sid, tidx),
-  },
-  {
-    label: "Kustuta sõna",
-    onClick: (sid, tidx) => p.onDeleteTag(sid, tidx),
-    danger: true,
-  },
-];
+const getTagMenuItems = () => undefined;
 
 interface SentenceItemProps {
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: Unable to find an element with the text: TagMenu-Vali sõna häälduskuju. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="header"
    >

[Killed] ObjectLiteral
src/components/SynthesisView.tsx:86:3
 }
 
 const getTagMenuItems = (p: SynthesisViewProps): TagMenuItem[] => [
-  {
-    label: "Vali sõna häälduskuju",
-    onClick: (sid, tidx, w) => p.onOpenVariantsFromMenu(sid, tidx, w),
-  },
+  {},
   {
     label: "Muuda sõna kirjakuju",
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: Unable to find an element with the text: TagMenu-Vali sõna häälduskuju. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="header"
    >

[Killed] ArrowFunction
src/components/SynthesisView.tsx:88:14
 const getTagMenuItems = (p: SynthesisViewProps): TagMenuItem[] => [
   {
     label: "Vali sõna häälduskuju",
-    onClick: (sid, tidx, w) => p.onOpenVariantsFromMenu(sid, tidx, w),
+    onClick: () => undefined,
   },
   {
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', +0, 'word' ]

Number of calls: 0

[Killed] StringLiteral
src/components/SynthesisView.tsx:91:12
     onClick: (sid, tidx, w) => p.onOpenVariantsFromMenu(sid, tidx, w),
   },
   {
-    label: "Muuda sõna kirjakuju",
+    label: "",
     onClick: (sid, tidx) => p.onEditTag(sid, tidx),
   },
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: Unable to find an element with the text: TagMenu-Muuda sõna kirjakuju. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="header"
    >

[Killed] ArrowFunction
src/components/SynthesisView.tsx:92:14
   },
   {
     label: "Muuda sõna kirjakuju",
-    onClick: (sid, tidx) => p.onEditTag(sid, tidx),
+    onClick: () => undefined,
   },
   {
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', +0 ]

Number of calls: 0

[Killed] ArrowFunction
src/components/SynthesisView.tsx:96:14
   },
   {
     label: "Kustuta sõna",
-    onClick: (sid, tidx) => p.onDeleteTag(sid, tidx),
+    onClick: () => undefined,
     danger: true,
   },
killedBy: SynthesisView tag menu items invoke correct callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', +0 ]

Number of calls: 0

[Survived] BooleanLiteral
src/components/SynthesisView.tsx:97:13
   {
     label: "Kustuta sõna",
     onClick: (sid, tidx) => p.onDeleteTag(sid, tidx),
-    danger: true,
+    danger: false,
   },
 ];

[Killed] ConditionalExpression
src/components/SynthesisView.tsx:109:5
 
 const SentenceItem = ({ sentence, sentenceIndex, p }: SentenceItemProps) => {
   const isMenuOpen =
-    p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
+    true;
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
killedBy: SynthesisView does not render menu when menuOpenId does not match
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="menu-s1"
>
  <button>
    Close Menu
  </button>

[Killed] ConditionalExpression
src/components/SynthesisView.tsx:109:5
 
 const SentenceItem = ({ sentence, sentenceIndex, p }: SentenceItemProps) => {
   const isMenuOpen =
-    p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
+    false;
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
killedBy: SynthesisView renders menu content when menuOpenId matches and anchorEl exists
statusReason: Unable to find an element by: [data-testid="menu-s1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="header"
    >

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:111:6
   const isMenuOpen =
     p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
   const isTagSelected =
-    (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
+    (true) &&
     (p.variantsSelectedSentenceId === sentence.id ||
       p.sentencePhoneticId === sentence.id);

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:111:5
   const isMenuOpen =
     p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
   const isTagSelected =
-    (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
-    (p.variantsSelectedSentenceId === sentence.id ||
-      p.sentencePhoneticId === sentence.id);
+    false;
   return (
     <SentenceSynthesisItem

[NoCoverage] ConditionalExpression
src/components/SynthesisView.tsx:112:6
     p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
-    (p.variantsSelectedSentenceId === sentence.id ||
+    (false ||
       p.sentencePhoneticId === sentence.id);
   return (

[NoCoverage] EqualityOperator
src/components/SynthesisView.tsx:112:6
     p.menuOpenId === sentence.id && p.menuAnchorEl[sentence.id];
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
-    (p.variantsSelectedSentenceId === sentence.id ||
+    (p.variantsSelectedSentenceId !== sentence.id ||
       p.sentencePhoneticId === sentence.id);
   return (

[NoCoverage] EqualityOperator
src/components/SynthesisView.tsx:113:7
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
     (p.variantsSelectedSentenceId === sentence.id ||
-      p.sentencePhoneticId === sentence.id);
+      p.sentencePhoneticId !== sentence.id);
   return (
     <SentenceSynthesisItem

[NoCoverage] ConditionalExpression
src/components/SynthesisView.tsx:113:7
   const isTagSelected =
     (p.isVariantsPanelOpen || p.showSentencePhoneticPanel) &&
     (p.variantsSelectedSentenceId === sentence.id ||
-      p.sentencePhoneticId === sentence.id);
+      false);
   return (
     <SentenceSynthesisItem

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:119:13
       key={sentence.id}
       id={sentence.id}
       text={sentence.text}
-      tags={sentence.tags || []}
+      tags={true}
       mode="input"
       draggable={true}

[Survived] LogicalOperator
src/components/SynthesisView.tsx:119:13
       key={sentence.id}
       id={sentence.id}
       text={sentence.text}
-      tags={sentence.tags || []}
+      tags={sentence.tags && []}
       mode="input"
       draggable={true}

[Survived] BooleanLiteral
src/components/SynthesisView.tsx:121:18
       text={sentence.text}
       tags={sentence.tags || []}
       mode="input"
-      draggable={true}
+      draggable={false}
       isDragging={p.draggedId === sentence.id}
       isDragOver={p.dragOverId === sentence.id}

[Survived] EqualityOperator
src/components/SynthesisView.tsx:122:19
       tags={sentence.tags || []}
       mode="input"
       draggable={true}
-      isDragging={p.draggedId === sentence.id}
+      isDragging={p.draggedId !== sentence.id}
       isDragOver={p.dragOverId === sentence.id}
       isPlaying={sentence.isPlaying ?? false}

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:122:19
       tags={sentence.tags || []}
       mode="input"
       draggable={true}
-      isDragging={p.draggedId === sentence.id}
+      isDragging={true}
       isDragOver={p.dragOverId === sentence.id}
       isPlaying={sentence.isPlaying ?? false}

[Survived] EqualityOperator
src/components/SynthesisView.tsx:123:19
       mode="input"
       draggable={true}
       isDragging={p.draggedId === sentence.id}
-      isDragOver={p.dragOverId === sentence.id}
+      isDragOver={p.dragOverId !== sentence.id}
       isPlaying={sentence.isPlaying ?? false}
       isLoading={sentence.isLoading ?? false}

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:123:19
       mode="input"
       draggable={true}
       isDragging={p.draggedId === sentence.id}
-      isDragOver={p.dragOverId === sentence.id}
+      isDragOver={true}
       isPlaying={sentence.isPlaying ?? false}
       isLoading={sentence.isLoading ?? false}

[NoCoverage] BooleanLiteral
src/components/SynthesisView.tsx:124:40
       draggable={true}
       isDragging={p.draggedId === sentence.id}
       isDragOver={p.dragOverId === sentence.id}
-      isPlaying={sentence.isPlaying ?? false}
+      isPlaying={sentence.isPlaying ?? true}
       isLoading={sentence.isLoading ?? false}
       onPlay={p.onPlay}

[Survived] LogicalOperator
src/components/SynthesisView.tsx:124:18
       draggable={true}
       isDragging={p.draggedId === sentence.id}
       isDragOver={p.dragOverId === sentence.id}
-      isPlaying={sentence.isPlaying ?? false}
+      isPlaying={sentence.isPlaying && false}
       isLoading={sentence.isLoading ?? false}
       onPlay={p.onPlay}

[NoCoverage] BooleanLiteral
src/components/SynthesisView.tsx:125:40
       isDragging={p.draggedId === sentence.id}
       isDragOver={p.dragOverId === sentence.id}
       isPlaying={sentence.isPlaying ?? false}
-      isLoading={sentence.isLoading ?? false}
+      isLoading={sentence.isLoading ?? true}
       onPlay={p.onPlay}
       onDragStart={p.onDragStart}

[Survived] LogicalOperator
src/components/SynthesisView.tsx:125:18
       isDragging={p.draggedId === sentence.id}
       isDragOver={p.dragOverId === sentence.id}
       isPlaying={sentence.isPlaying ?? false}
-      isLoading={sentence.isLoading ?? false}
+      isLoading={sentence.isLoading && false}
       onPlay={p.onPlay}
       onDragStart={p.onDragStart}

[Killed] ConditionalExpression
src/components/SynthesisView.tsx:137:9
       onTagMenuClose={p.onTagMenuClose}
       tagMenuItems={getTagMenuItems(p)}
       loadingTagIndex={
-        p.loadingVariantsTag?.sentenceId === sentence.id
+        true
           ? p.loadingVariantsTag.tagIndex
           : null
killedBy: SynthesisView renders header and sentence items
statusReason: Cannot read properties of null (reading 'tagIndex')

[Killed] OptionalChaining
src/components/SynthesisView.tsx:137:9
       onTagMenuClose={p.onTagMenuClose}
       tagMenuItems={getTagMenuItems(p)}
       loadingTagIndex={
-        p.loadingVariantsTag?.sentenceId === sentence.id
+        p.loadingVariantsTag.sentenceId === sentence.id
           ? p.loadingVariantsTag.tagIndex
           : null
killedBy: SynthesisView renders header and sentence items
statusReason: Cannot read properties of null (reading 'sentenceId')

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:143:9
       }
       selectedTagIndex={isTagSelected ? p.variantsSelectedTagIndex : null}
       isPronunciationPanelOpen={
-        p.isVariantsPanelOpen || p.showSentencePhoneticPanel
+        true
       }
       editingTag={p.editingTag}

[Survived] ConditionalExpression
src/components/SynthesisView.tsx:143:9
       }
       selectedTagIndex={isTagSelected ? p.variantsSelectedTagIndex : null}
       isPronunciationPanelOpen={
-        p.isVariantsPanelOpen || p.showSentencePhoneticPanel
+        false
       }
       editingTag={p.editingTag}

[Survived] LogicalOperator
src/components/SynthesisView.tsx:149:21
       onEditTagChange={p.onEditTagChange}
       onEditTagKeyDown={p.onEditTagKeyDown}
       onEditTagCommit={p.onEditTagCommit}
-      currentInput={sentence.currentInput ?? ""}
+      currentInput={sentence.currentInput && ""}
       onInputChange={p.onInputChange}
       onInputKeyDown={(e) => p.onInputKeyDown(e, sentence.id)}

[Killed] ArrowFunction
src/components/SynthesisView.tsx:151:23
       onEditTagCommit={p.onEditTagCommit}
       currentInput={sentence.currentInput ?? ""}
       onInputChange={p.onInputChange}
-      onInputKeyDown={(e) => p.onInputKeyDown(e, sentence.id)}
+      onInputKeyDown={() => undefined}
       onInputBlur={() => p.onInputBlur(sentence.id)}
       onClear={p.onClearSentence}
killedBy: SynthesisView calls onInputKeyDown wrapper with sentence id
statusReason: expected "vi.fn()" to be called with arguments: [ { key: 'Enter' }, 's1' ]

Number of calls: 0

[Killed] ArrowFunction
src/components/SynthesisView.tsx:152:20
       currentInput={sentence.currentInput ?? ""}
       onInputChange={p.onInputChange}
       onInputKeyDown={(e) => p.onInputKeyDown(e, sentence.id)}
-      onInputBlur={() => p.onInputBlur(sentence.id)}
+      onInputBlur={() => undefined}
       onClear={p.onClearSentence}
       sentenceIndex={sentenceIndex}
killedBy: SynthesisView calls onInputBlur wrapper with sentence id
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0

[Survived] ArrowFunction
src/components/SynthesisView.tsx:186:47
   return (
     <>
       <SynthesisPageHeader
-        sentenceCount={props.sentences.filter((s) => s.text.trim()).length}
+        sentenceCount={props.sentences.filter(() => undefined).length}
         isPlayingAll={props.isPlayingAll}
         isLoadingPlayAll={props.isLoadingPlayAll}

[Survived] MethodExpression
src/components/SynthesisView.tsx:186:24
   return (
     <>
       <SynthesisPageHeader
-        sentenceCount={props.sentences.filter((s) => s.text.trim()).length}
+        sentenceCount={props.sentences.length}
         isPlayingAll={props.isPlayingAll}
         isLoadingPlayAll={props.isLoadingPlayAll}

[Killed] ArrowFunction
src/components/SynthesisView.tsx:198:32
       />
       <div className="page-content">
         <div className="sentences-section">
-          {props.sentences.map((s, i) => (
-            <SentenceItem key={s.id} sentence={s} sentenceIndex={i} p={props} />
-          ))}
+          {props.sentences.map(() => undefined)}
           <div className="add-sentence-button-wrapper">
             <button
killedBy: SynthesisView renders header and sentence items
statusReason: Unable to find an element by: [data-testid="item-s1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="header"
    >
