[Killed] BlockStatement
src/components/TaskEditModal.tsx:36:19
   const [error, setError] = useState<string | null>(null);
 
   // Reset form when task changes or modal opens
-  useEffect(() => {
-    if (isOpen && task) {
-      setName(task.name);
-      setDescription(task.description || "");
-      setError(null);
-    }
-  }, [isOpen, task]);
+  useEffect(() => {}, [isOpen, task]);
 
   const handleSubmit = async (e: React.FormEvent) => {
killedBy: TaskEditModal rendering populates name field with task name
statusReason: expect(element).toHaveValue(Test Task)

Expected the element to have value:
  Test Task
Received:

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:37:9
 
   // Reset form when task changes or modal opens
   useEffect(() => {
-    if (isOpen && task) {
+    if (true) {
       setName(task.name);
       setDescription(task.description || "");
killedBy: TaskEditModal rendering returns null when no task
statusReason: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:37:9
 
   // Reset form when task changes or modal opens
   useEffect(() => {
-    if (isOpen && task) {
+    if (false) {
       setName(task.name);
       setDescription(task.description || "");
killedBy: TaskEditModal rendering populates name field with task name
statusReason: expect(element).toHaveValue(Test Task)

Expected the element to have value:
  Test Task
Received:

[Killed] LogicalOperator
src/components/TaskEditModal.tsx:39:22
   useEffect(() => {
     if (isOpen && task) {
       setName(task.name);
-      setDescription(task.description || "");
+      setDescription(task.description && "");
       setError(null);
     }
killedBy: TaskEditModal rendering populates description field with task description
statusReason: expect(element).toHaveValue(Test description)

Expected the element to have value:
  Test description
Received:

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:39:22
   useEffect(() => {
     if (isOpen && task) {
       setName(task.name);
-      setDescription(task.description || "");
+      setDescription(true);
       setError(null);
     }
killedBy: TaskEditModal rendering populates description field with task description
statusReason: expect(element).toHaveValue(Test description)

Expected the element to have value:
  Test description
Received:
  true

[Survived] ArrayDeclaration
src/components/TaskEditModal.tsx:42:6
       setDescription(task.description || "");
       setError(null);
     }
-  }, [isOpen, task]);
+  }, []);
 
   const handleSubmit = async (e: React.FormEvent) => {

[Killed] BooleanLiteral
src/components/TaskEditModal.tsx:47:9
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
 
-    if (!task) return;
+    if (task) return;
 
     if (!name.trim()) {
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:47:9
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault();
 
-    if (!task) return;
+    if (true) return;
 
     if (!name.trim()) {
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:49:9
 
     if (!task) return;
 
-    if (!name.trim()) {
+    if (true) {
       setError("Ülesande nimi on kohustuslik");
       return;
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/components/TaskEditModal.tsx:49:9
 
     if (!task) return;
 
-    if (!name.trim()) {
+    if (name.trim()) {
       setError("Ülesande nimi on kohustuslik");
       return;
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/components/TaskEditModal.tsx:54:21
       return;
     }
 
-    setIsSubmitting(true);
+    setIsSubmitting(false);
     setError(null);
 
killedBy: TaskEditModal form submission shows loading state during save
statusReason: Unable to find an element with the text: Salvestan.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] ObjectLiteral
src/components/TaskEditModal.tsx:57:25
     setIsSubmitting(true);
     setError(null);
 
-    const updatedTask = {
-      ...task,
-      name: name.trim(),
-      description: description.trim() || null,
-    };
+    const updatedTask = {};
 
     // Update the task in the hook state
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] MethodExpression
src/components/TaskEditModal.tsx:59:13
 
     const updatedTask = {
       ...task,
-      name: name.trim(),
+      name: name,
       description: description.trim() || null,
     };
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/components/TaskEditModal.tsx:60:20
     const updatedTask = {
       ...task,
       name: name.trim(),
-      description: description.trim() || null,
+      description: description.trim() && null,
     };
 
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:60:20
     const updatedTask = {
       ...task,
       name: name.trim(),
-      description: description.trim() || null,
+      description: false,
     };
 
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/components/TaskEditModal.tsx:66:9
     // Update the task in the hook state
     setTaskToEdit(updatedTask);
 
-    try {
-      // Pass updated task data directly to avoid race condition
-      await onSave(updatedTask);
-      handleClose();
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : "Viga ülesande muutmisel");
     } finally {
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    style="overflow: hidden;"
  >

[Killed] BlockStatement
src/components/TaskEditModal.tsx:70:19
       // Pass updated task data directly to avoid race condition
       await onSave(updatedTask);
       handleClose();
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Viga ülesande muutmisel");
-    } finally {
+    } catch (err) {} finally {
       setIsSubmitting(false);
     }
killedBy: TaskEditModal error handling shows error on save failure
statusReason: Unable to find an element with the text: Save failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] StringLiteral
src/components/TaskEditModal.tsx:71:53
       await onSave(updatedTask);
       handleClose();
     } catch (err) {
-      setError(err instanceof Error ? err.message : "Viga ülesande muutmisel");
+      setError(err instanceof Error ? err.message : "");
     } finally {
       setIsSubmitting(false);
killedBy: TaskEditModal error handling shows generic error for non-Error rejection
statusReason: Unable to find an element with the text: Viga ülesande muutmisel. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Survived] BlockStatement
src/components/TaskEditModal.tsx:72:15
       handleClose();
     } catch (err) {
       setError(err instanceof Error ? err.message : "Viga ülesande muutmisel");
-    } finally {
-      setIsSubmitting(false);
-    }
+    } finally {}
   };
 

[Killed] BlockStatement
src/components/TaskEditModal.tsx:77:29
     }
   };
 
-  const handleClose = () => {
-    if (!isSubmitting) {
-      setName("");
-      setDescription("");
-      setError(null);
-      onClose();
-    }
-  };
+  const handleClose = () => {};
 
   if (!isOpen || !task) return null;
killedBy: TaskEditModal form submission closes modal on successful save
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    style="overflow: hidden;"
  >

[Killed] BooleanLiteral
src/components/TaskEditModal.tsx:78:9
   };
 
   const handleClose = () => {
-    if (!isSubmitting) {
+    if (isSubmitting) {
       setName("");
       setDescription("");
killedBy: TaskEditModal form submission closes modal on successful save
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    style="overflow: hidden;"
  >

[Survived] StringLiteral
src/components/TaskEditModal.tsx:79:15
 
   const handleClose = () => {
     if (!isSubmitting) {
-      setName("");
+      setName("Stryker was here!");
       setDescription("");
       setError(null);

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:86:7
     }
   };
 
-  if (!isOpen || !task) return null;
+  if (false) return null;
 
   return (
killedBy: TaskEditModal rendering returns null when no task
statusReason: expected <div …(2)></div> to be null

[Killed] LogicalOperator
src/components/TaskEditModal.tsx:86:7
     }
   };
 
-  if (!isOpen || !task) return null;
+  if (!isOpen && !task) return null;
 
   return (
killedBy: TaskEditModal rendering returns null when no task
statusReason: expected <div …(2)></div> to be null

[Killed] ArrowFunction
src/components/TaskEditModal.tsx:102:23
             id="edit-task-name"
             type="text"
             value={name}
-            onChange={(e) => setName(e.target.value)}
+            onChange={() => undefined}
             className="task-edit-modal__input"
             placeholder="Ülesande nimi (Kohustuslik)"
killedBy: TaskEditModal input handling updates name on input
statusReason: expect(element).toHaveValue(New Name)

Expected the element to have value:
  New Name
Received:
  Test Task

[Killed] ArrowFunction
src/components/TaskEditModal.tsx:116:23
           <textarea
             id="edit-task-description"
             value={description}
-            onChange={(e) => setDescription(e.target.value)}
+            onChange={() => undefined}
             className="task-edit-modal__textarea"
             placeholder="Kirjeldus"
killedBy: TaskEditModal input handling updates description on input
statusReason: expect(element).toHaveValue(New Description)

Expected the element to have value:
  New Description
Received:
  Test description

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:124:10
           />
         </div>
 
-        {error && (
-          <div className="task-edit-modal__error" role="alert">
-            <p>{error}</p>
-          </div>
-        )}
+        {false}
 
         <div className="task-edit-modal__actions">
killedBy: TaskEditModal error handling shows error on save failure
statusReason: Unable to find an element with the text: Save failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:124:10
           />
         </div>
 
-        {error && (
-          <div className="task-edit-modal__error" role="alert">
-            <p>{error}</p>
-          </div>
-        )}
+        {true}
 
         <div className="task-edit-modal__actions">
killedBy: TaskEditModal error handling shows error on save failure
statusReason: Unable to find an element with the text: Save failed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: hidden;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/components/TaskEditModal.tsx:134:39
           <button
             type="submit"
             className="button button--primary"
-            disabled={isSubmitting || !name.trim()}
+            disabled={isSubmitting || name.trim()}
           >
             {isSubmitting ? "Salvestan..." : "Salvesta"}
killedBy: TaskEditModal input handling disables submit with empty name
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="button button--primary"
  type="submit"
/>

[Killed] ConditionalExpression
src/components/TaskEditModal.tsx:134:23
           <button
             type="submit"
             className="button button--primary"
-            disabled={isSubmitting || !name.trim()}
+            disabled={true}
           >
             {isSubmitting ? "Salvestan..." : "Salvesta"}
killedBy: TaskEditModal form submission calls setTaskToEdit with trimmed values and onSave
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'task-1', …(2) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
