[Survived] BooleanLiteral
src/components/TaskManager.tsx:37:56
   onMenuClose,
 }: TaskRowProps) {
   const descriptionRef = useRef<HTMLSpanElement>(null);
-  const [needsExpansion, setNeedsExpansion] = useState(false);
+  const [needsExpansion, setNeedsExpansion] = useState(true);
 
   useEffect(() => {

[Killed] BlockStatement
src/components/TaskManager.tsx:39:19
   const descriptionRef = useRef<HTMLSpanElement>(null);
   const [needsExpansion, setNeedsExpansion] = useState(false);
 
-  useEffect(() => {
-    // Check if the description is truncated
-    const element = descriptionRef.current;
-    if (element && task.description) {
-      // Compare scrollHeight with clientHeight to detect overflow
-      setNeedsExpansion(element.scrollHeight > element.clientHeight);
-    }
-  }, [task.description]);
+  useEffect(() => {}, [task.description]);
 
   return (
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ConditionalExpression
src/components/TaskManager.tsx:42:9
   useEffect(() => {
     // Check if the description is truncated
     const element = descriptionRef.current;
-    if (element && task.description) {
+    if (false) {
       // Compare scrollHeight with clientHeight to detect overflow
       setNeedsExpansion(element.scrollHeight > element.clientHeight);
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] BlockStatement
src/components/TaskManager.tsx:42:38
   useEffect(() => {
     // Check if the description is truncated
     const element = descriptionRef.current;
-    if (element && task.description) {
-      // Compare scrollHeight with clientHeight to detect overflow
-      setNeedsExpansion(element.scrollHeight > element.clientHeight);
-    }
+    if (element && task.description) {}
   }, [task.description]);
 
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] EqualityOperator
src/components/TaskManager.tsx:44:25
     const element = descriptionRef.current;
     if (element && task.description) {
       // Compare scrollHeight with clientHeight to detect overflow
-      setNeedsExpansion(element.scrollHeight > element.clientHeight);
+      setNeedsExpansion(element.scrollHeight <= element.clientHeight);
     }
   }, [task.description]);
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ConditionalExpression
src/components/TaskManager.tsx:44:25
     const element = descriptionRef.current;
     if (element && task.description) {
       // Compare scrollHeight with clientHeight to detect overflow
-      setNeedsExpansion(element.scrollHeight > element.clientHeight);
+      setNeedsExpansion(false);
     }
   }, [task.description]);
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Survived] StringLiteral
src/components/TaskManager.tsx:49:66
   }, [task.description]);
 
   return (
-    <div className={`task-row-simple ${isExpanded ? "expanded" : ""}`}>
+    <div className={`task-row-simple ${isExpanded ? "expanded" : "Stryker was here!"}`}>
       <div className="task-row-content" onClick={() => onViewTask(task.id)}>
         <div className="task-row-info">

[Killed] ArrowFunction
src/components/TaskManager.tsx:50:50
 
   return (
     <div className={`task-row-simple ${isExpanded ? "expanded" : ""}`}>
-      <div className="task-row-content" onClick={() => onViewTask(task.id)}>
+      <div className="task-row-content" onClick={() => undefined}>
         <div className="task-row-info">
           <span className={`task-row-name ${isExpanded ? "expanded" : ""}`}>
killedBy: TaskManager should call onViewTask when task is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Number of calls: 0

[Survived] StringLiteral
src/components/TaskManager.tsx:58:26
           <div className="task-row-description-wrapper">
             <span
               ref={descriptionRef}
-              className={`task-row-description ${isExpanded ? "expanded" : ""}`}
+              className={``}
             >
               {task.description}

[Killed] ConditionalExpression
src/components/TaskManager.tsx:62:14
             >
               {task.description}
             </span>
-            {task.description && needsExpansion && (
-              <button
-                className="task-show-more"
-                onClick={(e) => onToggleExpand(task.id, e)}
-              >
-                {isExpanded ? "Näita vähem" : "Näita rohkem"}
-              </button>
-            )}
+            {true}
           </div>
         </div>
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ConditionalExpression
src/components/TaskManager.tsx:62:14
             >
               {task.description}
             </span>
-            {task.description && needsExpansion && (
-              <button
-                className="task-show-more"
-                onClick={(e) => onToggleExpand(task.id, e)}
-              >
-                {isExpanded ? "Näita vähem" : "Näita rohkem"}
-              </button>
-            )}
+            {false}
           </div>
         </div>
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ArrowFunction
src/components/TaskManager.tsx:65:26
             {task.description && needsExpansion && (
               <button
                 className="task-show-more"
-                onClick={(e) => onToggleExpand(task.id, e)}
+                onClick={() => undefined}
               >
                 {isExpanded ? "Näita vähem" : "Näita rohkem"}
killedBy: TaskManager should toggle expanded description
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "task-1",

[Survived] ConditionalExpression
src/components/TaskManager.tsx:74:34
         </div>
         <div className="task-row-meta">
           <span className="task-row-count">
-            [{task.entryCount}] {task.entryCount === 1 ? "lauset" : "lauset"}
+            [{task.entryCount}] {false ? "lauset" : "lauset"}
           </span>
           <span className="task-row-date">

[Survived] ConditionalExpression
src/components/TaskManager.tsx:74:34
         </div>
         <div className="task-row-meta">
           <span className="task-row-count">
-            [{task.entryCount}] {task.entryCount === 1 ? "lauset" : "lauset"}
+            [{task.entryCount}] {true ? "lauset" : "lauset"}
           </span>
           <span className="task-row-date">

[Killed] ArrowFunction
src/components/TaskManager.tsx:87:22
           <button
             className="task-manager__menu-button"
             aria-label="More options"
-            onClick={() => onMenuOpen(task.id)}
+            onClick={() => undefined}
           >
             <MoreIcon size="2xl" />
killedBy: TaskManager should open menu when more options clicked
statusReason: Unable to find an element with the text: Muuda. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] EqualityOperator
src/components/TaskManager.tsx:92:12
             <MoreIcon size="2xl" />
           </button>
 
-          {openMenuId === task.id && (
+          {openMenuId !== task.id && (
             <>
               <div
killedBy: TaskManager should call onEditTask when edit clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Received: 

  1st vi.fn() call:

  [
-   "task-1",

[Killed] ConditionalExpression
src/components/TaskManager.tsx:92:12
             <MoreIcon size="2xl" />
           </button>
 
-          {openMenuId === task.id && (
+          {true && (
             <>
               <div
killedBy: TaskManager should open menu when more options clicked
statusReason: Found multiple elements with the text: Muuda

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="task-manager__menu-item-content"
>

[Killed] BlockStatement
src/components/TaskManager.tsx:101:34
               <div className="task-manager__dropdown-menu">
                 <button
                   className="task-manager__menu-item"
-                  onClick={() => {
-                    onEditTask(task.id);
-                    onMenuClose();
-                  }}
+                  onClick={() => {}}
                 >
                   <div className="task-manager__menu-item-content">Muuda</div>
killedBy: TaskManager should call onEditTask when edit clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/TaskManager.tsx:110:34
                 </button>
                 <button
                   className="task-manager__menu-item"
-                  onClick={() => {
-                    onShareTask(task.id);
-                    onMenuClose();
-                  }}
+                  onClick={() => {}}
                 >
                   <div className="task-manager__menu-item-content">Jaga</div>
killedBy: TaskManager should call onShareTask when share clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/TaskManager.tsx:119:34
                 </button>
                 <button
                   className="task-manager__menu-item task-manager__menu-item--danger"
-                  onClick={() => {
-                    onDeleteTask(task.id);
-                    onMenuClose();
-                  }}
+                  onClick={() => {}}
                 >
                   <div className="task-manager__menu-item-content">Kustuta</div>
killedBy: TaskManager should call onDeleteTask when delete clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/TaskManager.tsx:153:43
   const [openMenuId, setOpenMenuId] = useState<string | null>(null);
   const [expandedTasks, setExpandedTasks] = useState<Set<string>>(new Set());
 
-  const handleShare = (taskId: string) => {
-    onShareTask(taskId);
-  };
+  const handleShare = (taskId: string) => {};
 
   const handleMenuOpen = (taskId: string) => {
killedBy: TaskManager should call onShareTask when share clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'task-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/TaskManager.tsx:157:46
     onShareTask(taskId);
   };
 
-  const handleMenuOpen = (taskId: string) => {
-    setOpenMenuId(openMenuId === taskId ? null : taskId);
-  };
+  const handleMenuOpen = (taskId: string) => {};
 
   const handleMenuClose = () => {
killedBy: TaskManager should open menu when more options clicked
statusReason: Unable to find an element with the text: Muuda. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ConditionalExpression
src/components/TaskManager.tsx:158:19
   };
 
   const handleMenuOpen = (taskId: string) => {
-    setOpenMenuId(openMenuId === taskId ? null : taskId);
+    setOpenMenuId(false ? null : taskId);
   };
 
killedBy: TaskManager closes menu when clicking same more button again
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="task-manager__menu-item-content"
>
  Muuda
</div> instead

[Killed] EqualityOperator
src/components/TaskManager.tsx:158:19
   };
 
   const handleMenuOpen = (taskId: string) => {
-    setOpenMenuId(openMenuId === taskId ? null : taskId);
+    setOpenMenuId(openMenuId !== taskId ? null : taskId);
   };
 
killedBy: TaskManager should open menu when more options clicked
statusReason: Unable to find an element with the text: Muuda. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] BlockStatement
src/components/TaskManager.tsx:161:33
     setOpenMenuId(openMenuId === taskId ? null : taskId);
   };
 
-  const handleMenuClose = () => {
-    setOpenMenuId(null);
-  };
+  const handleMenuClose = () => {};
 
   const toggleExpanded = (taskId: string, e: React.MouseEvent) => {
killedBy: TaskManager should close menu when backdrop clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="task-manager__menu-item-content"
>
  Muuda
</div> instead

[Killed] BlockStatement
src/components/TaskManager.tsx:165:67
     setOpenMenuId(null);
   };
 
-  const toggleExpanded = (taskId: string, e: React.MouseEvent) => {
-    e.stopPropagation(); // Prevent triggering onViewTask
-    setExpandedTasks((prev) => {
-      const newSet = new Set(prev);
-      if (newSet.has(taskId)) {
-        newSet.delete(taskId);
-      } else {
-        newSet.add(taskId);
-      }
-      return newSet;
-    });
-  };
+  const toggleExpanded = (taskId: string, e: React.MouseEvent) => {};
 
   return (
killedBy: TaskManager should toggle expanded description
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "task-1",

[Killed] BlockStatement
src/components/TaskManager.tsx:167:32
 
   const toggleExpanded = (taskId: string, e: React.MouseEvent) => {
     e.stopPropagation(); // Prevent triggering onViewTask
-    setExpandedTasks((prev) => {
-      const newSet = new Set(prev);
-      if (newSet.has(taskId)) {
-        newSet.delete(taskId);
-      } else {
-        newSet.add(taskId);
-      }
-      return newSet;
-    });
+    setExpandedTasks((prev) => {});
   };
 
killedBy: TaskManager should toggle expanded description
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ConditionalExpression
src/components/TaskManager.tsx:169:11
     e.stopPropagation(); // Prevent triggering onViewTask
     setExpandedTasks((prev) => {
       const newSet = new Set(prev);
-      if (newSet.has(taskId)) {
+      if (false) {
         newSet.delete(taskId);
       } else {
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] BlockStatement
src/components/TaskManager.tsx:169:31
     e.stopPropagation(); // Prevent triggering onViewTask
     setExpandedTasks((prev) => {
       const newSet = new Set(prev);
-      if (newSet.has(taskId)) {
-        newSet.delete(taskId);
-      } else {
+      if (newSet.has(taskId)) {} else {
         newSet.add(taskId);
       }
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita rohkem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] BlockStatement
src/components/TaskManager.tsx:171:14
       const newSet = new Set(prev);
       if (newSet.has(taskId)) {
         newSet.delete(taskId);
-      } else {
-        newSet.add(taskId);
-      }
+      } else {}
       return newSet;
     });
killedBy: TaskManager should toggle expanded description
statusReason: Unable to find an element with the text: Näita vähem. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    >

[Killed] ArrowFunction
src/components/TaskManager.tsx:180:18
 
   return (
     <div className="task-manager-simple">
-      {tasks.map((task) => (
-        <TaskRow
-          key={task.id}
-          task={task}
-          isExpanded={expandedTasks.has(task.id)}
-          onToggleExpand={toggleExpanded}
-          onViewTask={onViewTask}
-          onEditTask={onEditTask}
-          onDeleteTask={onDeleteTask}
-          onShareTask={handleShare}
-          openMenuId={openMenuId}
-          onMenuOpen={handleMenuOpen}
-          onMenuClose={handleMenuClose}
-        />
-      ))}
+      {tasks.map(() => undefined)}
     </div>
   );
killedBy: TaskManager should render tasks
statusReason: Unable to find an element with the text: Task 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="task-manager-simple"
    />
