[NoCoverage] BlockStatement
src/components/TasksView.tsx:44:52
   const { user } = useAuth();
   const { tasks, isLoading, error, isEmpty } = useUserTasks(taskRefreshTrigger);
 
-  const handleEditTask = async (taskId: string) => {
-    if (!user) return;
-    try {
-      const dataService = DataService.getInstance();
-      const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        onEditTask(taskData);
-      }
-    } catch (error) {
-      console.error("Failed to fetch task for editing:", error);
-    }
-  };
+  const handleEditTask = async (taskId: string) => {};
 
   const handleShareTask = async (taskId: string) => {

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:45:9
   const { tasks, isLoading, error, isEmpty } = useUserTasks(taskRefreshTrigger);
 
   const handleEditTask = async (taskId: string) => {
-    if (!user) return;
+    if (false) return;
     try {
       const dataService = DataService.getInstance();

[NoCoverage] BooleanLiteral
src/components/TasksView.tsx:45:9
   const { tasks, isLoading, error, isEmpty } = useUserTasks(taskRefreshTrigger);
 
   const handleEditTask = async (taskId: string) => {
-    if (!user) return;
+    if (user) return;
     try {
       const dataService = DataService.getInstance();

[NoCoverage] BlockStatement
src/components/TasksView.tsx:46:9
 
   const handleEditTask = async (taskId: string) => {
     if (!user) return;
-    try {
-      const dataService = DataService.getInstance();
-      const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        onEditTask(taskData);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error("Failed to fetch task for editing:", error);
     }

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:49:11
     try {
       const dataService = DataService.getInstance();
       const task = await dataService.getTask(taskId, user.id);
-      if (task) {
+      if (true) {
         const taskData: Task = { id: task.id, name: task.name };
         if (task.description) taskData.description = task.description;

[NoCoverage] BlockStatement
src/components/TasksView.tsx:49:17
     try {
       const dataService = DataService.getInstance();
       const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        onEditTask(taskData);
-      }
+      if (task) {}
     } catch (error) {
       console.error("Failed to fetch task for editing:", error);

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:51:13
       const task = await dataService.getTask(taskId, user.id);
       if (task) {
         const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
+        if (true) taskData.description = task.description;
         onEditTask(taskData);
       }

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:51:13
       const task = await dataService.getTask(taskId, user.id);
       if (task) {
         const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
+        if (false) taskData.description = task.description;
         onEditTask(taskData);
       }

[NoCoverage] BlockStatement
src/components/TasksView.tsx:54:21
         if (task.description) taskData.description = task.description;
         onEditTask(taskData);
       }
-    } catch (error) {
-      console.error("Failed to fetch task for editing:", error);
-    }
+    } catch (error) {}
   };
 

[NoCoverage] BlockStatement
src/components/TasksView.tsx:59:53
     }
   };
 
-  const handleShareTask = async (taskId: string) => {
-    if (!user) return;
-    try {
-      const dataService = DataService.getInstance();
-      const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        if (task.shareToken) taskData.shareToken = task.shareToken;
-        onShareTask(taskData);
-      }
-    } catch (error) {
-      console.error("Failed to fetch task for sharing:", error);
-    }
-  };
+  const handleShareTask = async (taskId: string) => {};
 
   // Task detail view

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:60:9
   };
 
   const handleShareTask = async (taskId: string) => {
-    if (!user) return;
+    if (false) return;
     try {
       const dataService = DataService.getInstance();

[NoCoverage] BooleanLiteral
src/components/TasksView.tsx:60:9
   };
 
   const handleShareTask = async (taskId: string) => {
-    if (!user) return;
+    if (user) return;
     try {
       const dataService = DataService.getInstance();

[NoCoverage] BlockStatement
src/components/TasksView.tsx:61:9
 
   const handleShareTask = async (taskId: string) => {
     if (!user) return;
-    try {
-      const dataService = DataService.getInstance();
-      const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        if (task.shareToken) taskData.shareToken = task.shareToken;
-        onShareTask(taskData);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error("Failed to fetch task for sharing:", error);
     }

[NoCoverage] BlockStatement
src/components/TasksView.tsx:64:17
     try {
       const dataService = DataService.getInstance();
       const task = await dataService.getTask(taskId, user.id);
-      if (task) {
-        const taskData: Task = { id: task.id, name: task.name };
-        if (task.description) taskData.description = task.description;
-        if (task.shareToken) taskData.shareToken = task.shareToken;
-        onShareTask(taskData);
-      }
+      if (task) {}
     } catch (error) {
       console.error("Failed to fetch task for sharing:", error);

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:67:13
       if (task) {
         const taskData: Task = { id: task.id, name: task.name };
         if (task.description) taskData.description = task.description;
-        if (task.shareToken) taskData.shareToken = task.shareToken;
+        if (false) taskData.shareToken = task.shareToken;
         onShareTask(taskData);
       }

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:67:13
       if (task) {
         const taskData: Task = { id: task.id, name: task.name };
         if (task.description) taskData.description = task.description;
-        if (task.shareToken) taskData.shareToken = task.shareToken;
+        if (true) taskData.shareToken = task.shareToken;
         onShareTask(taskData);
       }

[NoCoverage] BlockStatement
src/components/TasksView.tsx:70:21
         if (task.shareToken) taskData.shareToken = task.shareToken;
         onShareTask(taskData);
       }
-    } catch (error) {
-      console.error("Failed to fetch task for sharing:", error);
-    }
+    } catch (error) {}
   };
 

[NoCoverage] BlockStatement
src/components/TasksView.tsx:76:23
   };
 
   // Task detail view
-  if (selectedTaskId) {
-    return (
-      <div className="page-content">
-        <TaskDetailView
-          taskId={selectedTaskId}
-          onBack={onBack}
-          onEditTask={handleEditTask}
-          onDeleteTask={onDeleteTask}
-          onNavigateToSynthesis={onNavigateToSynthesis}
-        />
-      </div>
-    );
-  }
+  if (selectedTaskId) {}
 
   // Loading state

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:76:7
   };
 
   // Task detail view
-  if (selectedTaskId) {
+  if (false) {
     return (
       <div className="page-content">

[NoCoverage] BlockStatement
src/components/TasksView.tsx:91:18
   }
 
   // Loading state
-  if (isLoading) {
-    return (
-      <div className="page-content page-content--empty">
-        <div className="empty-state">
-          <div
-            className="loader-spinner"
-            style={{ width: 48, height: 48 }}
-          ></div>
-          <p className="empty-state__description">Laen ülesandeid...</p>
-        </div>
-      </div>
-    );
-  }
+  if (isLoading) {}
 
   // Layout Type 4: Empty State (no header, centered content)

[NoCoverage] ObjectLiteral
src/components/TasksView.tsx:97:20
         <div className="empty-state">
           <div
             className="loader-spinner"
-            style={{ width: 48, height: 48 }}
+            style={{}}
           ></div>
           <p className="empty-state__description">Laen ülesandeid...</p>

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:106:7
   }
 
   // Layout Type 4: Empty State (no header, centered content)
-  if (isEmpty) {
+  if (false) {
     return (
       <div className="page-content page-content--empty">

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:106:7
   }
 
   // Layout Type 4: Empty State (no header, centered content)
-  if (isEmpty) {
+  if (true) {
     return (
       <div className="page-content page-content--empty">

[NoCoverage] LogicalOperator
src/components/TasksView.tsx:145:10
         </div>
       </div>
       <div className="page-content">
-        {error && (
-          <div className="task-manager__error">
-            <p>Viga ülesannete laadimisel: {error}</p>
-          </div>
-        )}
+        {error || <div className="task-manager__error">
+            <p>Viga ülesannete laadimisel: {error}</p>
+          </div>}
         <TaskManager
           tasks={tasks}

[NoCoverage] ConditionalExpression
src/components/TasksView.tsx:145:10
         </div>
       </div>
       <div className="page-content">
-        {error && (
-          <div className="task-manager__error">
-            <p>Viga ülesannete laadimisel: {error}</p>
-          </div>
-        )}
+        {true}
         <TaskManager
           tasks={tasks}
