[Killed] BlockStatement
src/components/UserProfile.tsx:14:42
   user: User;
 }
 
-function getInitials(user: User): string {
-  const name = user.name ?? user.email?.split("@")[0] ?? "";
-  return (
-    name
-      .split(" ")
-      .map((n) => n[0] ?? "")
-      .join("")
-      .toUpperCase() || "?"
-  );
-}
+function getInitials(user: User): string {}
 
 function getDisplayName(user: User): string {
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] LogicalOperator
src/components/UserProfile.tsx:15:16
 }
 
 function getInitials(user: User): string {
-  const name = user.name ?? user.email?.split("@")[0] ?? "";
+  const name = (user.name ?? user.email?.split("@")[0]) && "";
   return (
     name
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] LogicalOperator
src/components/UserProfile.tsx:15:16
 }
 
 function getInitials(user: User): string {
-  const name = user.name ?? user.email?.split("@")[0] ?? "";
+  const name = user.name && user.email?.split("@")[0] ?? "";
   return (
     name
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] MethodExpression
src/components/UserProfile.tsx:17:5
 function getInitials(user: User): string {
   const name = user.name ?? user.email?.split("@")[0] ?? "";
   return (
-    name
-      .split(" ")
-      .map((n) => n[0] ?? "")
-      .join("")
-      .toUpperCase() || "?"
+    name.split(" ").map(n => n[0] ?? "").join("").toLowerCase() || "?"
   );
 }
killedBy: UserProfile Full handles user without name gracefully
statusReason: Found multiple elements with the text: a

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="user-profile__avatar"
>

[Killed] ConditionalExpression
src/components/UserProfile.tsx:17:5
 function getInitials(user: User): string {
   const name = user.name ?? user.email?.split("@")[0] ?? "";
   return (
-    name
-      .split(" ")
-      .map((n) => n[0] ?? "")
-      .join("")
-      .toUpperCase() || "?"
+    true
   );
 }
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] ArrowFunction
src/components/UserProfile.tsx:19:12
   return (
     name
       .split(" ")
-      .map((n) => n[0] ?? "")
+      .map(() => undefined)
       .join("")
       .toUpperCase() || "?"
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] LogicalOperator
src/components/UserProfile.tsx:19:19
   return (
     name
       .split(" ")
-      .map((n) => n[0] ?? "")
+      .map((n) => n[0] && "")
       .join("")
       .toUpperCase() || "?"
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Unable to find an element with the text: MT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[NoCoverage] StringLiteral
src/components/UserProfile.tsx:21:25
       .split(" ")
       .map((n) => n[0] ?? "")
       .join("")
-      .toUpperCase() || "?"
+      .toUpperCase() || ""
   );
 }

[Killed] BlockStatement
src/components/UserProfile.tsx:25:45
   );
 }
 
-function getDisplayName(user: User): string {
-  return user.name ?? user.email?.split("@")[0] ?? "User";
-}
+function getDisplayName(user: User): string {}
 
 export default function UserProfile({ user }: UserProfileProps) {
killedBy: UserProfile rendering renders user name
statusReason: Unable to find an element with the text: Margus Tamm. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] LogicalOperator
src/components/UserProfile.tsx:26:10
 }
 
 function getDisplayName(user: User): string {
-  return user.name ?? user.email?.split("@")[0] ?? "User";
+  return (user.name ?? user.email?.split("@")[0]) && "User";
 }
 
killedBy: UserProfile Full renders user name
statusReason: Unable to find an element with the text: Test User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] LogicalOperator
src/components/UserProfile.tsx:26:10
 }
 
 function getDisplayName(user: User): string {
-  return user.name ?? user.email?.split("@")[0] ?? "User";
+  return user.name && user.email?.split("@")[0] ?? "User";
 }
 
killedBy: UserProfile rendering renders user name
statusReason: Unable to find an element with the text: Margus Tamm. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] BooleanLiteral
src/components/UserProfile.tsx:31:56
 
 export default function UserProfile({ user }: UserProfileProps) {
   const { logout } = useAuth();
-  const [isDropdownOpen, setIsDropdownOpen] = useState(false);
+  const [isDropdownOpen, setIsDropdownOpen] = useState(true);
 
   const handleLogout = () => {
killedBy: UserProfile rendering renders user avatar with initials
statusReason: Found multiple elements with the text: MT

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="user-profile__avatar"
>

[Killed] BlockStatement
src/components/UserProfile.tsx:33:30
   const { logout } = useAuth();
   const [isDropdownOpen, setIsDropdownOpen] = useState(false);
 
-  const handleLogout = () => {
-    logout();
-    setIsDropdownOpen(false);
-  };
+  const handleLogout = () => {};
 
   const handleClearLocalStorage = () => {
killedBy: UserProfile logout calls logout when logout button clicked
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/components/UserProfile.tsx:35:23
 
   const handleLogout = () => {
     logout();
-    setIsDropdownOpen(false);
+    setIsDropdownOpen(true);
   };
 

[Killed] BlockStatement
src/components/UserProfile.tsx:38:41
     setIsDropdownOpen(false);
   };
 
-  const handleClearLocalStorage = () => {
-    if (
-      window.confirm(
-        "Kas oled kindel, et soovid kõik kohaliku salvestuse andmed kustutada? See taastab rakenduse algsesse olekusse mock-andmetega.",
-      )
-    ) {
-      // Clear all localStorage data
-      localStorage.clear();
-
-      // Close dropdown
-      setIsDropdownOpen(false);
-
-      // Refresh the page to reset application state
-      window.location.reload();
-    }
-  };
+  const handleClearLocalStorage = () => {};
 
   return (
killedBy: UserProfile clear local data does nothing when confirm is cancelled
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/UserProfile.tsx:40:7
 
   const handleClearLocalStorage = () => {
     if (
-      window.confirm(
-        "Kas oled kindel, et soovid kõik kohaliku salvestuse andmed kustutada? See taastab rakenduse algsesse olekusse mock-andmetega.",
-      )
+      true
     ) {
       // Clear all localStorage data
killedBy: UserProfile clear local data does nothing when confirm is cancelled
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/UserProfile.tsx:40:7
 
   const handleClearLocalStorage = () => {
     if (
-      window.confirm(
-        "Kas oled kindel, et soovid kõik kohaliku salvestuse andmed kustutada? See taastab rakenduse algsesse olekusse mock-andmetega.",
-      )
+      false
     ) {
       // Clear all localStorage data
killedBy: UserProfile clear local data does nothing when confirm is cancelled
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/UserProfile.tsx:43:7
       window.confirm(
         "Kas oled kindel, et soovid kõik kohaliku salvestuse andmed kustutada? See taastab rakenduse algsesse olekusse mock-andmetega.",
       )
-    ) {
-      // Clear all localStorage data
-      localStorage.clear();
-
-      // Close dropdown
-      setIsDropdownOpen(false);
-
-      // Refresh the page to reset application state
-      window.location.reload();
-    }
+    ) {}
   };
 
killedBy: UserProfile clear local data clears localStorage and reloads when confirmed
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/components/UserProfile.tsx:48:25
       localStorage.clear();
 
       // Close dropdown
-      setIsDropdownOpen(false);
+      setIsDropdownOpen(true);
 
       // Refresh the page to reset application state

[Killed] ArrowFunction
src/components/UserProfile.tsx:58:18
   return (
     <div className="user-profile">
       <button
-        onClick={() => setIsDropdownOpen(!isDropdownOpen)}
+        onClick={() => undefined}
         className="user-profile__button"
       >
killedBy: UserProfile dropdown interaction opens dropdown when button clicked
statusReason: Unable to find an element with the text: Logi välja. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Killed] BooleanLiteral
src/components/UserProfile.tsx:58:42
   return (
     <div className="user-profile">
       <button
-        onClick={() => setIsDropdownOpen(!isDropdownOpen)}
+        onClick={() => setIsDropdownOpen(isDropdownOpen)}
         className="user-profile__button"
       >
killedBy: UserProfile dropdown interaction opens dropdown when button clicked
statusReason: Unable to find an element with the text: Logi välja. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="user-profile"
    >

[Survived] StringLiteral
src/components/UserProfile.tsx:68:92
         </div>
         <ChevronDownIcon
           size="md"
-          className={`user-profile__arrow ${isDropdownOpen ? "user-profile__arrow--open" : ""}`}
+          className={`user-profile__arrow ${isDropdownOpen ? "user-profile__arrow--open" : "Stryker was here!"}`}
         />
       </button>

[Killed] BooleanLiteral
src/components/UserProfile.tsx:76:46
         <>
           <div
             className="user-profile__backdrop"
-            onClick={() => setIsDropdownOpen(false)}
+            onClick={() => setIsDropdownOpen(true)}
           />
           <div className="user-profile__dropdown">
killedBy: UserProfile dropdown interaction closes dropdown when backdrop clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="user-profile__action-button-content"
>
  Logi välja
</div> instead

[Killed] ArrowFunction
src/components/UserProfile.tsx:76:22
         <>
           <div
             className="user-profile__backdrop"
-            onClick={() => setIsDropdownOpen(false)}
+            onClick={() => undefined}
           />
           <div className="user-profile__dropdown">
killedBy: UserProfile dropdown interaction closes dropdown when backdrop clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="user-profile__action-button-content"
>
  Logi välja
</div> instead
