[Killed] BlockStatement
src/components/AppHeader.tsx:24:53
   onHelpClick,
   onLoginClick,
 }: AppHeaderProps) {
-  const handleTasksClick = (e: React.MouseEvent) => {
-    if (!isAuthenticated) {
-      e.preventDefault();
-      onTasksClick();
-    }
-  };
+  const handleTasksClick = (e: React.MouseEvent) => {};
 
   return (
killedBy: AppHeader authentication-gated navigation calls onTasksClick when clicking tasks link while not authenticated
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/components/AppHeader.tsx:25:9
   onLoginClick,
 }: AppHeaderProps) {
   const handleTasksClick = (e: React.MouseEvent) => {
-    if (!isAuthenticated) {
+    if (isAuthenticated) {
       e.preventDefault();
       onTasksClick();
killedBy: AppHeader authentication-gated navigation calls onTasksClick when clicking tasks link while not authenticated
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/AppHeader.tsx:25:27
   onLoginClick,
 }: AppHeaderProps) {
   const handleTasksClick = (e: React.MouseEvent) => {
-    if (!isAuthenticated) {
-      e.preventDefault();
-      onTasksClick();
-    }
+    if (!isAuthenticated) {}
   };
 
killedBy: AppHeader authentication-gated navigation calls onTasksClick when clicking tasks link while not authenticated
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/components/AppHeader.tsx:40:24
         <nav className="header-nav">
           <NavLink
             to="/synthesis"
-            className={({ isActive }) =>
-              `header-nav-link ${isActive ? "active" : ""}`
+            className={() => undefined
             }
           >
killedBy: AppHeader active state marks synthesis link as active on /synthesis
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:

[Killed] ArrowFunction
src/components/AppHeader.tsx:48:24
           </NavLink>
           <NavLink
             to="/tasks"
-            className={({ isActive }) =>
-              `header-nav-link ${isActive ? "active" : ""}`
+            className={() => undefined
             }
             data-nav="tasks"
killedBy: AppHeader active state marks tasks link as active on /tasks
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:

[Killed] ConditionalExpression
src/components/AppHeader.tsx:66:12
           >
             <HelpIcon size="2xl" />
           </button>
-          {isAuthenticated && user ? (
+          {false ? (
             <UserProfile user={user} />
           ) : (
killedBy: AppHeader rendering renders user profile when authenticated
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="button button--primary"
>
  Logi sisse
</button> instead

[Killed] ConditionalExpression
src/components/AppHeader.tsx:66:12
           >
             <HelpIcon size="2xl" />
           </button>
-          {isAuthenticated && user ? (
+          {true ? (
             <UserProfile user={user} />
           ) : (
killedBy: AppHeader rendering renders logo
statusReason: Cannot read properties of null (reading 'name')
