[Survived] ConditionalExpression
src/components/BuildInfo.tsx:27:3
 }
 
 const buildTimeInfo =
-  typeof __BUILD_INFO__ !== "undefined"
+  false
     ? __BUILD_INFO__
     : {

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:27:3
 }
 
 const buildTimeInfo =
-  typeof __BUILD_INFO__ !== "undefined"
+  true
     ? __BUILD_INFO__
     : {

[Survived] ObjectLiteral
src/components/BuildInfo.tsx:29:7
 const buildTimeInfo =
   typeof __BUILD_INFO__ !== "undefined"
     ? __BUILD_INFO__
-    : {
-        commitHash: "dev",
-        commitMessage: "",
-        branch: "local",
-        commitDate: "",
-        buildTime: "",
-        workingDir: "",
-      };
+    : {};
 
 function formatDateTime(dateString: string): string {

[Survived] BlockStatement
src/components/BuildInfo.tsx:38:53
         workingDir: "",
       };
 
-function formatDateTime(dateString: string): string {
-  if (!dateString) return "";
-  const date = new Date(dateString);
-  return date.toLocaleString("et-EE", {
-    day: "2-digit",
-    month: "2-digit",
-    year: "numeric",
-    hour: "2-digit",
-    minute: "2-digit",
-  });
-}
+function formatDateTime(dateString: string): string {}
 
 const isLocalDev = (): boolean =>

[Survived] BooleanLiteral
src/components/BuildInfo.tsx:39:7
       };
 
 function formatDateTime(dateString: string): string {
-  if (!dateString) return "";
+  if (dateString) return "";
   const date = new Date(dateString);
   return date.toLocaleString("et-EE", {

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:39:7
       };
 
 function formatDateTime(dateString: string): string {
-  if (!dateString) return "";
+  if (true) return "";
   const date = new Date(dateString);
   return date.toLocaleString("et-EE", {

[Survived] ObjectLiteral
src/components/BuildInfo.tsx:41:39
 function formatDateTime(dateString: string): string {
   if (!dateString) return "";
   const date = new Date(dateString);
-  return date.toLocaleString("et-EE", {
-    day: "2-digit",
-    month: "2-digit",
-    year: "numeric",
-    hour: "2-digit",
-    minute: "2-digit",
-  });
+  return date.toLocaleString("et-EE", {});
 }
 

[Killed] StringLiteral
src/components/BuildInfo.tsx:45:11
     day: "2-digit",
     month: "2-digit",
     year: "numeric",
-    hour: "2-digit",
+    hour: "",
     minute: "2-digit",
   });
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/components/BuildInfo.tsx:50:20
   });
 }
 
-const isLocalDev = (): boolean =>
-  typeof window !== "undefined" && window.location.hostname === "localhost";
+const isLocalDev = () => undefined;
 
 const Row = ({
killedBy: BuildInfo renders button with hash and correct class
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:51:3
 }
 
 const isLocalDev = (): boolean =>
-  typeof window !== "undefined" && window.location.hostname === "localhost";
+  false;
 
 const Row = ({
killedBy: BuildInfo renders button with hash and correct class
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] LogicalOperator
src/components/BuildInfo.tsx:51:3
 }
 
 const isLocalDev = (): boolean =>
-  typeof window !== "undefined" && window.location.hostname === "localhost";
+  typeof window !== "undefined" || window.location.hostname === "localhost";
 
 const Row = ({
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ArrowFunction
src/components/BuildInfo.tsx:53:13
 const isLocalDev = (): boolean =>
   typeof window !== "undefined" && window.location.hostname === "localhost";
 
-const Row = ({
-  label,
-  value,
-  className,
-}: {
-  label: string;
-  value: React.ReactNode;
-  className?: string;
-}) => (
-  <div className="build-info-row">
-    <span className="build-info-label">{label}</span>
-    <span className={`build-info-value ${className ?? ""}`}>{value}</span>
-  </div>
-);
+const Row = () => undefined;
 
 function useBuildInfo(): RuntimeBuildInfo {
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Unable to find an element with the text: Hash. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:64:42
 }) => (
   <div className="build-info-row">
     <span className="build-info-label">{label}</span>
-    <span className={`build-info-value ${className ?? ""}`}>{value}</span>
+    <span className={`build-info-value ${className && ""}`}>{value}</span>
   </div>
 );
killedBy: BuildInfo renders Row labels and values with correct classes
statusReason: expected null to be truthy

[Survived] StringLiteral
src/components/BuildInfo.tsx:64:55
 }) => (
   <div className="build-info-row">
     <span className="build-info-label">{label}</span>
-    <span className={`build-info-value ${className ?? ""}`}>{value}</span>
+    <span className={`build-info-value ${className ?? "Stryker was here!"}`}>{value}</span>
   </div>
 );

[Killed] BlockStatement
src/components/BuildInfo.tsx:71:19
 function useBuildInfo(): RuntimeBuildInfo {
   const [runtimeInfo, setRuntimeInfo] = useState<RuntimeBuildInfo | null>(null);
 
-  useEffect(() => {
-    if (isLocalDev()) return;
-    fetch("/build-info.json")
-      .then((res) => (res.ok ? res.json() : null))
-      .then((data) => data && setRuntimeInfo(data))
-      .catch(() => {});
-  }, []);
+  useEffect(() => {}, []);
 
   if (runtimeInfo) {
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:72:9
   const [runtimeInfo, setRuntimeInfo] = useState<RuntimeBuildInfo | null>(null);
 
   useEffect(() => {
-    if (isLocalDev()) return;
+    if (true) return;
     fetch("/build-info.json")
       .then((res) => (res.ok ? res.json() : null))
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:72:9
   const [runtimeInfo, setRuntimeInfo] = useState<RuntimeBuildInfo | null>(null);
 
   useEffect(() => {
-    if (isLocalDev()) return;
+    if (false) return;
     fetch("/build-info.json")
       .then((res) => (res.ok ? res.json() : null))
killedBy: BuildInfo renders button with hash and correct class
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/components/BuildInfo.tsx:74:13
   useEffect(() => {
     if (isLocalDev()) return;
     fetch("/build-info.json")
-      .then((res) => (res.ok ? res.json() : null))
+      .then(() => undefined)
       .then((data) => data && setRuntimeInfo(data))
       .catch(() => {});
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:75:23
     if (isLocalDev()) return;
     fetch("/build-info.json")
       .then((res) => (res.ok ? res.json() : null))
-      .then((data) => data && setRuntimeInfo(data))
+      .then((data) => data || setRuntimeInfo(data))
       .catch(() => {});
   }, []);
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:75:23
     if (isLocalDev()) return;
     fetch("/build-info.json")
       .then((res) => (res.ok ? res.json() : null))
-      .then((data) => data && setRuntimeInfo(data))
+      .then((data) => true)
       .catch(() => {});
   }, []);
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:79:7
       .catch(() => {});
   }, []);
 
-  if (runtimeInfo) {
+  if (true) {
     return {
       buildId: runtimeInfo.buildId,
killedBy: BuildInfo renders button with hash and correct class
statusReason: Cannot read properties of null (reading 'buildId')

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:79:7
       .catch(() => {});
   }, []);
 
-  if (runtimeInfo) {
+  if (false) {
     return {
       buildId: runtimeInfo.buildId,
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:82:19
   if (runtimeInfo) {
     return {
       buildId: runtimeInfo.buildId,
-      commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
+      commitHash: false,
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:82:19
   if (runtimeInfo) {
     return {
       buildId: runtimeInfo.buildId,
-      commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
+      commitHash: true,
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:84:15
       buildId: runtimeInfo.buildId,
       commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
       commitHashFull: runtimeInfo.commitHashFull,
-      branch: runtimeInfo.branch || buildTimeInfo.branch,
+      branch: false,
       message: runtimeInfo.message || buildTimeInfo.commitMessage,
       builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:84:15
       buildId: runtimeInfo.buildId,
       commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
       commitHashFull: runtimeInfo.commitHashFull,
-      branch: runtimeInfo.branch || buildTimeInfo.branch,
+      branch: true,
       message: runtimeInfo.message || buildTimeInfo.commitMessage,
       builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:85:16
       commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,
-      message: runtimeInfo.message || buildTimeInfo.commitMessage,
+      message: false,
       builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,
       deployedAt: runtimeInfo.deployedAt,
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: fix: something. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:85:16
       commitHash: runtimeInfo.commitHash || buildTimeInfo.commitHash,
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,
-      message: runtimeInfo.message || buildTimeInfo.commitMessage,
+      message: runtimeInfo.message && buildTimeInfo.commitMessage,
       builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,
       deployedAt: runtimeInfo.deployedAt,
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: fix: something. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:86:16
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,
       message: runtimeInfo.message || buildTimeInfo.commitMessage,
-      builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,
+      builtAt: true,
       deployedAt: runtimeInfo.deployedAt,
       environment: runtimeInfo.environment,

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:86:16
       commitHashFull: runtimeInfo.commitHashFull,
       branch: runtimeInfo.branch || buildTimeInfo.branch,
       message: runtimeInfo.message || buildTimeInfo.commitMessage,
-      builtAt: runtimeInfo.builtAt || buildTimeInfo.buildTime,
+      builtAt: false,
       deployedAt: runtimeInfo.deployedAt,
       environment: runtimeInfo.environment,

[Survived] ObjectLiteral
src/components/BuildInfo.tsx:92:10
     };
   }
 
-  return {
-    commitHash: buildTimeInfo.commitHash,
-    branch: buildTimeInfo.branch,
-    message: buildTimeInfo.commitMessage,
-    builtAt: buildTimeInfo.buildTime,
-  };
+  return {};
 }
 

[Killed] ArrowFunction
src/components/BuildInfo.tsx:108:48
   onClose: () => void;
 }) => (
   <div className="build-info-overlay" onClick={onClose}>
-    <div className="build-info-modal" onClick={(e) => e.stopPropagation()}>
+    <div className="build-info-modal" onClick={() => undefined}>
       <div className="build-info-modal__header">
         <h3>Build Info</h3>
killedBy: BuildInfo does not close modal on content click (stopPropagation)
statusReason: Unable to find an element with the text: Build Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:116:10
         </button>
       </div>
       <div className="build-info-modal__content">
-        {info.buildId && (
-          <Row label="Build" value={<code>{info.buildId}</code>} />
-        )}
+        {info.buildId || <Row label="Build" value={<code>{info.buildId}</code>} />}
         <Row label="Hash" value={<code>{info.commitHash}</code>} />
         <Row label="Branch" value={info.branch} />
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: Build. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:116:10
         </button>
       </div>
       <div className="build-info-modal__content">
-        {info.buildId && (
-          <Row label="Build" value={<code>{info.buildId}</code>} />
-        )}
+        {true}
         <Row label="Hash" value={<code>{info.commitHash}</code>} />
         <Row label="Branch" value={info.branch} />
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: BUILD-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:123:18
         <Row label="Branch" value={info.branch} />
         <Row
           label="Message"
-          value={info.message || "—"}
+          value={info.message && "—"}
           className="build-info-message"
         />
killedBy: BuildInfo shows dash for empty message
statusReason: Unable to find an element with the text: —. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:123:18
         <Row label="Branch" value={info.branch} />
         <Row
           label="Message"
-          value={info.message || "—"}
+          value={true}
           className="build-info-message"
         />
killedBy: BuildInfo shows dash for empty message
statusReason: Unable to find an element with the text: —. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Survived] LogicalOperator
src/components/BuildInfo.tsx:126:50
           value={info.message || "—"}
           className="build-info-message"
         />
-        <Row label="Built" value={formatDateTime(info.builtAt || "")} />
+        <Row label="Built" value={formatDateTime(info.builtAt && "")} />
         {info.deployedAt && (
           <Row label="Deployed" value={formatDateTime(info.deployedAt)} />

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:126:50
           value={info.message || "—"}
           className="build-info-message"
         />
-        <Row label="Built" value={formatDateTime(info.builtAt || "")} />
+        <Row label="Built" value={formatDateTime(true)} />
         {info.deployedAt && (
           <Row label="Deployed" value={formatDateTime(info.deployedAt)} />

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:127:10
           className="build-info-message"
         />
         <Row label="Built" value={formatDateTime(info.builtAt || "")} />
-        {info.deployedAt && (
-          <Row label="Deployed" value={formatDateTime(info.deployedAt)} />
-        )}
+        {true}
         {isLocalDev() && buildTimeInfo.workingDir && (
           <Row
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: Deployed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] LogicalOperator
src/components/BuildInfo.tsx:127:10
           className="build-info-message"
         />
         <Row label="Built" value={formatDateTime(info.builtAt || "")} />
-        {info.deployedAt && (
-          <Row label="Deployed" value={formatDateTime(info.deployedAt)} />
-        )}
+        {info.deployedAt || <Row label="Deployed" value={formatDateTime(info.deployedAt)} />}
         {isLocalDev() && buildTimeInfo.workingDir && (
           <Row
killedBy: BuildInfo runtime fetch shows buildId and deployedAt from build-info.json
statusReason: Unable to find an element with the text: Deployed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Survived] ConditionalExpression
src/components/BuildInfo.tsx:130:10
         {info.deployedAt && (
           <Row label="Deployed" value={formatDateTime(info.deployedAt)} />
         )}
-        {isLocalDev() && buildTimeInfo.workingDir && (
-          <Row
-            label="Directory"
-            value={buildTimeInfo.workingDir}
-            className="build-info-path"
-          />
-        )}
+        {false}
       </div>
     </div>

[Survived] LogicalOperator
src/components/BuildInfo.tsx:130:10
         {info.deployedAt && (
           <Row label="Deployed" value={formatDateTime(info.deployedAt)} />
         )}
-        {isLocalDev() && buildTimeInfo.workingDir && (
+        {isLocalDev() || buildTimeInfo.workingDir && (
           <Row
             label="Directory"

[Killed] BlockStatement
src/components/BuildInfo.tsx:142:37
   </div>
 );
 
-export default function BuildInfo() {
-  const [isOpen, setIsOpen] = useState(false);
-  const info = useBuildInfo();
-  return (
-    <>
-      <button
-        className="build-info-button"
-        onClick={() => setIsOpen(true)}
-        title="Build info"
-      >
-        <span className="build-info-hash">{info.commitHash}</span>
-      </button>
-      {isOpen && (
-        <BuildInfoModal info={info} onClose={() => setIsOpen(false)} />
-      )}
-    </>
-  );
-}
+export default function BuildInfo() {}
 
killedBy: BuildInfo renders button with hash and correct class
statusReason: expected null to be truthy

[Killed] BooleanLiteral
src/components/BuildInfo.tsx:143:40
 );
 
 export default function BuildInfo() {
-  const [isOpen, setIsOpen] = useState(false);
+  const [isOpen, setIsOpen] = useState(true);
   const info = useBuildInfo();
   return (
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Found multiple elements with the role "button"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="build-info-button"
  title="Build info"

[Killed] BooleanLiteral
src/components/BuildInfo.tsx:149:34
     <>
       <button
         className="build-info-button"
-        onClick={() => setIsOpen(true)}
+        onClick={() => setIsOpen(false)}
         title="Build info"
       >
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Unable to find an element with the text: Build Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ArrowFunction
src/components/BuildInfo.tsx:149:18
     <>
       <button
         className="build-info-button"
-        onClick={() => setIsOpen(true)}
+        onClick={() => undefined}
         title="Build info"
       >
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Unable to find an element with the text: Build Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:154:8
       >
         <span className="build-info-hash">{info.commitHash}</span>
       </button>
-      {isOpen && (
-        <BuildInfoModal info={info} onClose={() => setIsOpen(false)} />
-      )}
+      {false}
     </>
   );
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Unable to find an element with the text: Build Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ConditionalExpression
src/components/BuildInfo.tsx:154:8
       >
         <span className="build-info-hash">{info.commitHash}</span>
       </button>
-      {isOpen && (
-        <BuildInfoModal info={info} onClose={() => setIsOpen(false)} />
-      )}
+      {true}
     </>
   );
killedBy: BuildInfo opens modal with header and rows when clicked
statusReason: Unable to find an element with the text: Build Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="build-info-button"
      title="Build info"

[Killed] ArrowFunction
src/components/BuildInfo.tsx:155:46
         <span className="build-info-hash">{info.commitHash}</span>
       </button>
       {isOpen && (
-        <BuildInfoModal info={info} onClose={() => setIsOpen(false)} />
+        <BuildInfoModal info={info} onClose={() => undefined} />
       )}
     </>
killedBy: BuildInfo closes modal on close button
statusReason: expected <h3></h3> to be null

[Killed] BooleanLiteral
src/components/BuildInfo.tsx:155:62
         <span className="build-info-hash">{info.commitHash}</span>
       </button>
       {isOpen && (
-        <BuildInfoModal info={info} onClose={() => setIsOpen(false)} />
+        <BuildInfoModal info={info} onClose={() => setIsOpen(true)} />
       )}
     </>
killedBy: BuildInfo closes modal on close button
statusReason: expected <h3></h3> to be null
