[Killed] StringLiteral
src/components/ConfirmationModal.tsx:23:17
   isOpen,
   title,
   message,
-  confirmText = "OK",
+  confirmText = "",
   cancelText = "Cancel",
   onConfirm,
killedBy: ConfirmationModal rendering renders default button texts
statusReason: Unable to find an accessible element with the role "button" and name "OK"

Here are the accessible roles:

  dialog:

  Name "Test":
  <div

[Killed] BooleanLiteral
src/components/ConfirmationModal.tsx:29:7
   onCancel,
   variant = "danger",
 }: ConfirmationModalProps) {
-  if (!isOpen) return null;
+  if (isOpen) return null;
   return (
     <BaseModal
killedBy: ConfirmationModal rendering renders when open
statusReason: Unable to find an element with the text: Test Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/ConfirmationModal.tsx:29:7
   onCancel,
   variant = "danger",
 }: ConfirmationModalProps) {
-  if (!isOpen) return null;
+  if (true) return null;
   return (
     <BaseModal
killedBy: ConfirmationModal rendering renders when open
statusReason: Unable to find an element with the text: Test Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
