[Killed] ArrowFunction
src/components/Footer.tsx:6:20
 
 import BuildInfo from "./BuildInfo";
 
-const FooterLogo = () => (
-  <div className="footer-section footer-logo">
-    <img src="/icons/logo.png" alt="EKI Logo" className="footer-logo-image" />
-    <div className="footer-contact">
-      <p>
-        Roosikrantsi 6, 10119 Tallinn
-        <br />
-        Registrikood 70004011
-        <br />
-        Keelenõu 631 3731
-        <br />
-        Üldkontakt 617 7500
-        <br />
-        E-post eki@eki.ee
-      </p>
-    </div>
-  </div>
-);
+const FooterLogo = () => undefined;
 const FooterLinks = () => (
   <div className="footer-section">
killedBy: Footer rendering renders logo
statusReason: Unable to find an element with the alt text: EKI Logo

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-footer__content"
    >

[Killed] ArrowFunction
src/components/Footer.tsx:24:21
     </div>
   </div>
 );
-const FooterLinks = () => (
-  <div className="footer-section">
-    <h3 className="footer-heading">Hääldusabiline</h3>
-    <ul className="footer-links">
-      <li>
-        <a href="#">Portaalist</a>
-      </li>
-      <li>
-        <a href="#">Versiooniajalugu</a>
-      </li>
-      <li>
-        <a href="#">Kasutus- ja privaatsustingimused</a>
-      </li>
-    </ul>
-  </div>
-);
+const FooterLinks = () => undefined;
 const SocialLinks = () => (
   <div className="footer-section">
killedBy: Footer rendering renders Hääldusabiline section
statusReason: Unable to find an element with the text: Hääldusabiline. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-footer__content"
    >

[Killed] ArrowFunction
src/components/Footer.tsx:78:25
     </ul>
   </div>
 );
-const FeedbackSection = () => (
-  <div className="footer-section">
-    <h3 className="footer-heading">Tagasiside</h3>
-    <div className="footer-feedback-content">
-      <p className="footer-description">
-        Iga arvamus loeb ja aitab Hääldusabilist paremaks teha! Saada meile oma
-        mõtted ja ettepanekud.
-      </p>
-      <a href="mailto:kristjan.suluste@eki.ee" className="footer-feedback-link">
-        <svg
-          className="footer-feedback-icon"
-          viewBox="0 0 24 24"
-          fill="currentColor"
-          aria-hidden="true"
-        >
-          <path d="M20 4H4c-1.1 0-2 .9-2 2v12c0 1.1.9 2 2 2h16c1.1 0 2-.9 2-2V6c0-1.1-.9-2-2-2zm0 4l-8 5-8-5V6l8 5 8-5v2z" />
-        </svg>
-        <span>kristjan.suluste@eki.ee</span>
-      </a>
-    </div>
-  </div>
-);
+const FeedbackSection = () => undefined;
 
 const FooterSponsors = () => (
killedBy: Footer rendering renders feedback section
statusReason: Unable to find an element with the text: Tagasiside. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-footer__content"
    >

[Killed] ArrowFunction
src/components/Footer.tsx:101:24
   </div>
 );
 
-const FooterSponsors = () => (
-  <div className="footer-sponsors">
-    <div className="footer-sponsors__content">
-      <img
-        src="/icons/kaasrahastamine_logo.jpeg"
-        alt="Kaasrahastanud Euroopa Liit"
-        className="footer-sponsors__logo"
-      />
-      <img
-        src="/icons/ks_logo.png"
-        alt="Eesti tuleviku heaks"
-        className="footer-sponsors__logo"
-      />
-      <img
-        src="/icons/hjtm_logo.png"
-        alt="Haridus- ja Teadusministeerium"
-        className="footer-sponsors__logo"
-      />
-    </div>
-  </div>
-);
+const FooterSponsors = () => undefined;
 
 export default function Footer() {
killedBy: Footer rendering renders sponsor logos
statusReason: Unable to find an element with the alt text: Kaasrahastanud Euroopa Liit

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-footer__content"
    >

[Killed] BlockStatement
src/components/Footer.tsx:123:34
   </div>
 );
 
-export default function Footer() {
-  return (
-    <>
-      <div className="page-footer__content">
-        <FooterLogo />
-        <FooterLinks />
-        <SocialLinks />
-        <FeedbackSection />
-        <div className="footer-build-info">
-          <BuildInfo />
-        </div>
-      </div>
-      <FooterSponsors />
-    </>
-  );
-}
+export default function Footer() {}
 
killedBy: Footer rendering renders logo
statusReason: Unable to find an element with the alt text: EKI Logo

Ignored nodes: comments, script, style
<body>
  <div />
</body>
