[Killed] ObjectLiteral
src/components/Notification.tsx:30:69
   onClose: () => void;
 }
 
-const typeToColorMap: Record<NotificationType, NotificationColor> = {
-  success: "success",
-  error: "danger",
-  warning: "warning",
-  info: "primary",
-};
+const typeToColorMap: Record<NotificationType, NotificationColor> = {};
 
 export default function Notification({
killedBy: Notification applies correct color class for each type
statusReason: expected null to be truthy

[Killed] StringLiteral
src/components/Notification.tsx:32:10
 
 const typeToColorMap: Record<NotificationType, NotificationColor> = {
   success: "success",
-  error: "danger",
+  error: "",
   warning: "warning",
   info: "primary",
killedBy: Notification applies correct color class for each type
statusReason: expected null to be truthy

[Killed] StringLiteral
src/components/Notification.tsx:33:12
 const typeToColorMap: Record<NotificationType, NotificationColor> = {
   success: "success",
   error: "danger",
-  warning: "warning",
+  warning: "",
   info: "primary",
 };
killedBy: Notification applies correct color class for each type
statusReason: expected null to be truthy

[Killed] StringLiteral
src/components/Notification.tsx:34:9
   success: "success",
   error: "danger",
   warning: "warning",
-  info: "primary",
+  info: "",
 };
 
killedBy: Notification applies correct color class for each type
statusReason: expected null to be truthy

[Killed] BlockStatement
src/components/Notification.tsx:46:19
   duration = 4000,
   onClose,
 }: NotificationProps) {
-  useEffect(() => {
-    if (duration > 0) {
-      const t = setTimeout(onClose, duration);
-      return () => clearTimeout(t);
-    }
-    return undefined;
-  }, [duration, onClose]);
+  useEffect(() => {}, [duration, onClose]);
   const colorClass = `modal--${color ?? typeToColorMap[type]}--outlined`;
   const handleAction = () => {
killedBy: Notification calls onClose after duration
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/components/Notification.tsx:47:9
   onClose,
 }: NotificationProps) {
   useEffect(() => {
-    if (duration > 0) {
+    if (duration <= 0) {
       const t = setTimeout(onClose, duration);
       return () => clearTimeout(t);
killedBy: Notification calls onClose after duration
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/components/Notification.tsx:47:9
   onClose,
 }: NotificationProps) {
   useEffect(() => {
-    if (duration > 0) {
+    if (true) {
       const t = setTimeout(onClose, duration);
       return () => clearTimeout(t);
killedBy: Notification does not auto-close when duration is 0
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Survived] ArrowFunction
src/components/Notification.tsx:49:14
   useEffect(() => {
     if (duration > 0) {
       const t = setTimeout(onClose, duration);
-      return () => clearTimeout(t);
+      return () => undefined;
     }
     return undefined;

[Killed] LogicalOperator
src/components/Notification.tsx:53:32
     }
     return undefined;
   }, [duration, onClose]);
-  const colorClass = `modal--${color ?? typeToColorMap[type]}--outlined`;
+  const colorClass = `modal--${color && typeToColorMap[type]}--outlined`;
   const handleAction = () => {
     if (action) {
killedBy: Notification applies correct color class for each type
statusReason: expected null to be truthy

[Killed] BlockStatement
src/components/Notification.tsx:54:30
     return undefined;
   }, [duration, onClose]);
   const colorClass = `modal--${color ?? typeToColorMap[type]}--outlined`;
-  const handleAction = () => {
-    if (action) {
-      action.onClick();
-      onClose();
-    }
-  };
+  const handleAction = () => {};
   return (
     <div
killedBy: Notification calls action onClick and onClose when action button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/Notification.tsx:55:9
   }, [duration, onClose]);
   const colorClass = `modal--${color ?? typeToColorMap[type]}--outlined`;
   const handleAction = () => {
-    if (action) {
+    if (false) {
       action.onClick();
       onClose();
killedBy: Notification calls action onClick and onClose when action button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/Notification.tsx:55:17
   }, [duration, onClose]);
   const colorClass = `modal--${color ?? typeToColorMap[type]}--outlined`;
   const handleAction = () => {
-    if (action) {
-      action.onClick();
-      onClose();
-    }
+    if (action) {}
   };
   return (
killedBy: Notification calls action onClick and onClose when action button clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] LogicalOperator
src/components/Notification.tsx:70:8
           <CloseIcon size="2xl" />
         </button>
       </div>
-      {(description || action) && (
-        <p>
-          {description}
-          {description && action && " "}
-          {action && (
-            <button className="notification-action-link" onClick={handleAction}>
-              {action.label}
-            </button>
-          )}
-        </p>
-      )}
+      {description || action || <p>
+          {description}
+          {description && action && " "}
+          {action && <button className="notification-action-link" onClick={handleAction}>
+              {action.label}
+            </button>}
+        </p>}
     </div>
   );
killedBy: Notification renders action button when provided
statusReason: Objects are not valid as a React child (found: object with keys {label, onClick}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/components/Notification.tsx:70:8
           <CloseIcon size="2xl" />
         </button>
       </div>
-      {(description || action) && (
-        <p>
-          {description}
-          {description && action && " "}
-          {action && (
-            <button className="notification-action-link" onClick={handleAction}>
-              {action.label}
-            </button>
-          )}
-        </p>
-      )}
+      {true}
     </div>
   );
killedBy: Notification renders notification with description
statusReason: Unable to find an element with the text: Test description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="modal modal--small modal--primary--outlined modal--outlined notification-toast"
    >

[Killed] LogicalOperator
src/components/Notification.tsx:73:12
       {(description || action) && (
         <p>
           {description}
-          {description && action && " "}
+          {description && action || " "}
           {action && (
             <button className="notification-action-link" onClick={handleAction}>
killedBy: Notification renders description and action with separator space
statusReason: Objects are not valid as a React child (found: object with keys {label, onClick}). If you meant to render a collection of children, use an array instead.

[Survived] ConditionalExpression
src/components/Notification.tsx:73:12
       {(description || action) && (
         <p>
           {description}
-          {description && action && " "}
+          {false}
           {action && (
             <button className="notification-action-link" onClick={handleAction}>

[Killed] ConditionalExpression
src/components/Notification.tsx:74:12
         <p>
           {description}
           {description && action && " "}
-          {action && (
-            <button className="notification-action-link" onClick={handleAction}>
-              {action.label}
-            </button>
-          )}
+          {true}
         </p>
       )}
killedBy: Notification renders action button when provided
statusReason: Unable to find an element with the text: Undo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="modal modal--small modal--primary--outlined modal--outlined notification-toast"
    >

[Killed] ConditionalExpression
src/components/Notification.tsx:74:12
         <p>
           {description}
           {description && action && " "}
-          {action && (
-            <button className="notification-action-link" onClick={handleAction}>
-              {action.label}
-            </button>
-          )}
+          {false}
         </p>
       )}
killedBy: Notification renders action button when provided
statusReason: Unable to find an element with the text: Undo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="modal modal--small modal--primary--outlined modal--outlined notification-toast"
    >
