[Survived] ArrowFunction
src/components/SentenceMenu.tsx:65:19
         className="synthesis__menu-search-input"
         placeholder="Otsi"
         value={menuSearchQuery}
-        onChange={(e) => onSearchChange(e.target.value)}
+        onChange={() => undefined}
         onClick={(e) => e.stopPropagation()}
       />

[Killed] ArrowFunction
src/components/SentenceMenu.tsx:66:18
         placeholder="Otsi"
         value={menuSearchQuery}
         onChange={(e) => onSearchChange(e.target.value)}
-        onClick={(e) => e.stopPropagation()}
+        onClick={() => undefined}
       />
       <SearchIcon size="2xl" className="synthesis__menu-search-icon" />
killedBy: SentenceMenu keyboard and positioning stops propagation on search input click
statusReason: expected "stopPropagation" to be called at least once

[Killed] ArrowFunction
src/components/SentenceMenu.tsx:83:27
           <div className="synthesis__menu-item-content">Laen...</div>
         </div>
       ) : (
-        filteredTasks.map((task) => (
-          <button
-            key={task.id}
-            className="synthesis__menu-item"
-            role="menuitem"
-            onClick={() => {
-              onAddToTask(sentenceId, task.id, task.name);
-              onClose();
-            }}
-            disabled={!hasText}
-          >
-            <div className="synthesis__menu-item-content">{task.name}</div>
-          </button>
-        ))
+        filteredTasks.map(() => undefined)
       )}
     </div>
killedBy: SentenceMenu authenticated shows search and tasks when authenticated
statusReason: Unable to find an element with the text: Task 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-hidden="true"
      class="synthesis__menu-backdrop"

[Killed] BlockStatement
src/components/SentenceMenu.tsx:88:28
             key={task.id}
             className="synthesis__menu-item"
             role="menuitem"
-            onClick={() => {
-              onAddToTask(sentenceId, task.id, task.name);
-              onClose();
-            }}
+            onClick={() => {}}
             disabled={!hasText}
           >
killedBy: SentenceMenu authenticated calls onAddToTask when task clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', 't1', 'Task 1' ]

Number of calls: 0

[Killed] BooleanLiteral
src/components/SentenceMenu.tsx:92:23
               onAddToTask(sentenceId, task.id, task.name);
               onClose();
             }}
-            disabled={!hasText}
+            disabled={hasText}
           >
             <div className="synthesis__menu-item-content">{task.name}</div>
killedBy: SentenceMenu authenticated calls onAddToTask when task clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 's1', 't1', 'Task 1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceMenu.tsx:103:24
       <button
         className="synthesis__menu-item synthesis__menu-item--create"
         role="menuitem"
-        onClick={() => {
-          onCreateNewTask(sentenceId);
-          onClose();
-        }}
+        onClick={() => {}}
         disabled={!hasText}
       >
killedBy: SentenceMenu authenticated calls onCreateNewTask
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/SentenceMenu.tsx:137:19
   onClose,
   anchorEl,
 }: SentenceMenuProps) {
-  const hasText = sentenceText.trim().length > 0;
+  const hasText = false;
   const filteredTasks = tasks.filter((t) =>
     t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
killedBy: SentenceMenu unauthenticated calls onLogin on click
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/components/SentenceMenu.tsx:137:19
   onClose,
   anchorEl,
 }: SentenceMenuProps) {
-  const hasText = sentenceText.trim().length > 0;
+  const hasText = sentenceText.trim().length >= 0;
   const filteredTasks = tasks.filter((t) =>
     t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
killedBy: SentenceMenu disabled state disables when no text
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="synthesis__menu-item"
  role="menuitem"
/>

[Killed] ArrowFunction
src/components/SentenceMenu.tsx:138:38
   anchorEl,
 }: SentenceMenuProps) {
   const hasText = sentenceText.trim().length > 0;
-  const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
+  const filteredTasks = tasks.filter(() => undefined,
   );
   const [menuPosition, setMenuPosition] = useState<{
killedBy: SentenceMenu authenticated shows search and tasks when authenticated
statusReason: Unable to find an element with the text: Task 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-hidden="true"
      class="synthesis__menu-backdrop"

[Killed] MethodExpression
src/components/SentenceMenu.tsx:138:25
   anchorEl,
 }: SentenceMenuProps) {
   const hasText = sentenceText.trim().length > 0;
-  const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
-  );
+  const filteredTasks = tasks;
   const [menuPosition, setMenuPosition] = useState<{
     top: number;
killedBy: SentenceMenu authenticated filters tasks by search query
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="synthesis__menu-item-content"
>
  Task 2
</div> instead

[Killed] MethodExpression
src/components/SentenceMenu.tsx:139:35
 }: SentenceMenuProps) {
   const hasText = sentenceText.trim().length > 0;
   const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
+    t.name.toLowerCase().includes(menuSearchQuery.toUpperCase()),
   );
   const [menuPosition, setMenuPosition] = useState<{
killedBy: SentenceMenu authenticated filters tasks by search query
statusReason: Unable to find an element with the text: Task 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-hidden="true"
      class="synthesis__menu-backdrop"

[Killed] MethodExpression
src/components/SentenceMenu.tsx:139:5
 }: SentenceMenuProps) {
   const hasText = sentenceText.trim().length > 0;
   const filteredTasks = tasks.filter((t) =>
-    t.name.toLowerCase().includes(menuSearchQuery.toLowerCase()),
+    t.name.toUpperCase().includes(menuSearchQuery.toLowerCase()),
   );
   const [menuPosition, setMenuPosition] = useState<{
killedBy: SentenceMenu authenticated filters tasks by search query
statusReason: Unable to find an element with the text: Task 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-hidden="true"
      class="synthesis__menu-backdrop"

[Killed] BlockStatement
src/components/SentenceMenu.tsx:147:25
   } | null>(null);
 
   // Calculate fixed position from anchor element
-  useLayoutEffect(() => {
-    if (anchorEl) {
-      const rect = anchorEl.getBoundingClientRect();
-      // Position menu below the button, aligned to the right edge
-      setMenuPosition({
-        top: rect.bottom + 4, // 4px gap below button
-        left: rect.right - 250, // Align right edge (250px is menu width from paper-md)
-      });
-    }
-  }, [anchorEl]);
+  useLayoutEffect(() => {}, [anchorEl]);
 
   const handleKeyDown = (e: React.KeyboardEvent): void => {
killedBy: SentenceMenu keyboard and positioning uses fixed positioning when anchorEl provided
statusReason: expected 'synthesis__dropdown-menu synthesis__d…' to contain 'synthesis__dropdown-menu--fixed'

[Killed] ConditionalExpression
src/components/SentenceMenu.tsx:148:9
 
   // Calculate fixed position from anchor element
   useLayoutEffect(() => {
-    if (anchorEl) {
+    if (false) {
       const rect = anchorEl.getBoundingClientRect();
       // Position menu below the button, aligned to the right edge
killedBy: SentenceMenu keyboard and positioning uses fixed positioning when anchorEl provided
statusReason: expected 'synthesis__dropdown-menu synthesis__d…' to contain 'synthesis__dropdown-menu--fixed'

[Killed] ConditionalExpression
src/components/SentenceMenu.tsx:148:9
 
   // Calculate fixed position from anchor element
   useLayoutEffect(() => {
-    if (anchorEl) {
+    if (true) {
       const rect = anchorEl.getBoundingClientRect();
       // Position menu below the button, aligned to the right edge
killedBy: SentenceMenu unauthenticated shows login button when not authenticated
statusReason: Cannot read properties of undefined (reading 'getBoundingClientRect')

[Survived] ArithmeticOperator
src/components/SentenceMenu.tsx:152:14
       const rect = anchorEl.getBoundingClientRect();
       // Position menu below the button, aligned to the right edge
       setMenuPosition({
-        top: rect.bottom + 4, // 4px gap below button
+        top: rect.bottom - 4, // 4px gap below button
         left: rect.right - 250, // Align right edge (250px is menu width from paper-md)
       });

[Survived] ArithmeticOperator
src/components/SentenceMenu.tsx:153:15
       // Position menu below the button, aligned to the right edge
       setMenuPosition({
         top: rect.bottom + 4, // 4px gap below button
-        left: rect.right - 250, // Align right edge (250px is menu width from paper-md)
+        left: rect.right + 250, // Align right edge (250px is menu width from paper-md)
       });
     }

[Killed] BlockStatement
src/components/SentenceMenu.tsx:158:59
     }
   }, [anchorEl]);
 
-  const handleKeyDown = (e: React.KeyboardEvent): void => {
-    if (e.key === "Escape") {
-      onClose();
-    }
-  };
+  const handleKeyDown = (e: React.KeyboardEvent): void => {};
 
   // Use fixed positioning when anchorEl is provided
killedBy: SentenceMenu keyboard and positioning closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/components/SentenceMenu.tsx:159:9
   }, [anchorEl]);
 
   const handleKeyDown = (e: React.KeyboardEvent): void => {
-    if (e.key === "Escape") {
+    if (false) {
       onClose();
     }
killedBy: SentenceMenu keyboard and positioning closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/SentenceMenu.tsx:159:29
   }, [anchorEl]);
 
   const handleKeyDown = (e: React.KeyboardEvent): void => {
-    if (e.key === "Escape") {
-      onClose();
-    }
+    if (e.key === "Escape") {}
   };
 
killedBy: SentenceMenu keyboard and positioning closes on Escape key
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/components/SentenceMenu.tsx:165:31
   };
 
   // Use fixed positioning when anchorEl is provided
-  const useFixedPositioning = !!anchorEl && !!menuPosition;
+  const useFixedPositioning = !anchorEl && !!menuPosition;
   const menuClassName = `synthesis__dropdown-menu synthesis__dropdown-menu--with-search${useFixedPositioning ? " synthesis__dropdown-menu--fixed" : ""}`;
   const menuStyle = useFixedPositioning
killedBy: SentenceMenu keyboard and positioning uses fixed positioning when anchorEl provided
statusReason: expected 'synthesis__dropdown-menu synthesis__d…' to contain 'synthesis__dropdown-menu--fixed'

[Killed] LogicalOperator
src/components/SentenceMenu.tsx:165:31
   };
 
   // Use fixed positioning when anchorEl is provided
-  const useFixedPositioning = !!anchorEl && !!menuPosition;
+  const useFixedPositioning = !!anchorEl || !!menuPosition;
   const menuClassName = `synthesis__dropdown-menu synthesis__dropdown-menu--with-search${useFixedPositioning ? " synthesis__dropdown-menu--fixed" : ""}`;
   const menuStyle = useFixedPositioning
killedBy: SentenceMenu keyboard and positioning uses fixed positioning when anchorEl provided
statusReason: Cannot read properties of null (reading 'top')

[Survived] MethodExpression
src/components/SentenceMenu.tsx:168:38
   const useFixedPositioning = !!anchorEl && !!menuPosition;
   const menuClassName = `synthesis__dropdown-menu synthesis__dropdown-menu--with-search${useFixedPositioning ? " synthesis__dropdown-menu--fixed" : ""}`;
   const menuStyle = useFixedPositioning
-    ? { top: menuPosition.top, left: Math.max(8, menuPosition.left) }
+    ? { top: menuPosition.top, left: Math.min(8, menuPosition.left) }
     : undefined;
 

[Survived] ObjectLiteral
src/components/SentenceMenu.tsx:168:7
   const useFixedPositioning = !!anchorEl && !!menuPosition;
   const menuClassName = `synthesis__dropdown-menu synthesis__dropdown-menu--with-search${useFixedPositioning ? " synthesis__dropdown-menu--fixed" : ""}`;
   const menuStyle = useFixedPositioning
-    ? { top: menuPosition.top, left: Math.max(8, menuPosition.left) }
+    ? {}
     : undefined;
 

[Killed] BlockStatement
src/components/SentenceMenu.tsx:201:28
           <button
             className="synthesis__menu-item"
             role="menuitem"
-            onClick={() => {
-              onClose();
-              onLogin();
-            }}
+            onClick={() => {}}
             disabled={!hasText}
           >
killedBy: SentenceMenu unauthenticated calls onLogin on click
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/components/SentenceMenu.tsx:213:26
         <button
           className="synthesis__menu-item"
           role="menuitem"
-          onClick={() => {
-            onExplorePhonetic(sentenceId);
-            onClose();
-          }}
+          onClick={() => {}}
           disabled={!hasText}
         >
killedBy: SentenceMenu actions calls onExplorePhonetic
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceMenu.tsx:224:26
         <button
           className="synthesis__menu-item"
           role="menuitem"
-          onClick={() => {
-            onDownload(sentenceId);
-            onClose();
-          }}
+          onClick={() => {}}
           disabled={!hasText}
         >
killedBy: SentenceMenu actions calls onDownload
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceMenu.tsx:235:26
         <button
           className="synthesis__menu-item"
           role="menuitem"
-          onClick={() => {
-            onCopyText(sentenceId);
-            onClose();
-          }}
+          onClick={() => {}}
           disabled={!hasText}
         >
killedBy: SentenceMenu actions calls onCopyText
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/SentenceMenu.tsx:246:26
         <button
           className="synthesis__menu-item synthesis__menu-item--danger"
           role="menuitem"
-          onClick={() => {
-            onRemove(sentenceId);
-            onClose();
-          }}
+          onClick={() => {}}
         >
           <div className="synthesis__menu-item-content">Eemalda</div>
killedBy: SentenceMenu actions calls onRemove
statusReason: expected "vi.fn()" to be called with arguments: [ 's1' ]

Number of calls: 0
