[Killed] ConditionalExpression
src/components/SynthesisPageHeader.tsx:39:10
         </p>
       </div>
       <div className="page-header__actions">
-        {sentenceCount > 0 && (
-          <div className="add-to-task-container">
-            <button
-              className="button button--secondary"
-              onClick={onAddAllClick}
-              data-onboarding-target="save-to-task-button"
-            >
-              Lisa ülesandesse ({sentenceCount})
-            </button>
-            <AddToTaskDropdown
-              isOpen={showDropdown}
-              onClose={onDropdownClose}
-              onSelectTask={onSelectTask}
-              onCreateNew={onCreateNew}
-            />
-          </div>
-        )}
+        {false}
         {sentenceCount > 1 && (
           <PlayAllButton
killedBy: SynthesisPageHeader shows add to task button with sentence count
statusReason: Unable to find an element with the text: /Lisa ülesandesse \(2\)/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-header page-header--full"
    >

[Killed] EqualityOperator
src/components/SynthesisPageHeader.tsx:39:10
         </p>
       </div>
       <div className="page-header__actions">
-        {sentenceCount > 0 && (
+        {sentenceCount <= 0 && (
           <div className="add-to-task-container">
             <button
killedBy: SynthesisPageHeader shows add to task button with sentence count
statusReason: Unable to find an element with the text: /Lisa ülesandesse \(2\)/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-header page-header--full"
    >

[Killed] LogicalOperator
src/components/SynthesisPageHeader.tsx:56:10
             />
           </div>
         )}
-        {sentenceCount > 1 && (
-          <PlayAllButton
-            isPlaying={isPlayingAll}
-            isLoading={isLoadingPlayAll}
-            onClick={onPlayAllClick}
-          />
-        )}
+        {sentenceCount > 1 || <PlayAllButton isPlaying={isPlayingAll} isLoading={isLoadingPlayAll} onClick={onPlayAllClick} />}
       </div>
     </div>
killedBy: SynthesisPageHeader shows play all button when sentenceCount > 1
statusReason: Unable to find an element by: [data-testid="play-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-header page-header--full"
    >

[Killed] ConditionalExpression
src/components/SynthesisPageHeader.tsx:56:10
             />
           </div>
         )}
-        {sentenceCount > 1 && (
-          <PlayAllButton
-            isPlaying={isPlayingAll}
-            isLoading={isLoadingPlayAll}
-            onClick={onPlayAllClick}
-          />
-        )}
+        {false}
       </div>
     </div>
killedBy: SynthesisPageHeader shows play all button when sentenceCount > 1
statusReason: Unable to find an element by: [data-testid="play-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="page-header page-header--full"
    >
