[Killed] BlockStatement
src/hash.ts:18:68
 
 declare const window: { crypto?: { subtle?: SubtleCryptoLike } } | undefined;
 
-export async function calculateHash(text: string): Promise<string> {
-  if (!text || text.trim().length === 0) {
-    throw new Error("Text cannot be empty");
-  }
-
-  // Browser environment
-  if (typeof window !== "undefined" && window?.crypto?.subtle) {
-    const encoder = new TextEncoder();
-    const data = encoder.encode(text);
-    const hashBuffer = await window.crypto.subtle.digest("SHA-256", data);
-    const hashArray = Array.from(new Uint8Array(hashBuffer));
-    return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
-  }
-
-  // Node.js environment
-  const crypto = await import("node:crypto");
-  return crypto.createHash("sha256").update(text).digest("hex");
-}
+export async function calculateHash(text: string): Promise<string> {}
 
 /**
killedBy: hash calculateHash (async) should calculate SHA-256 hash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08"
Received: undefined

[Killed] MethodExpression
src/hash.ts:19:16
 declare const window: { crypto?: { subtle?: SubtleCryptoLike } } | undefined;
 
 export async function calculateHash(text: string): Promise<string> {
-  if (!text || text.trim().length === 0) {
+  if (!text || text.length === 0) {
     throw new Error("Text cannot be empty");
   }
killedBy: hash calculateHash (async) should throw error for whitespace-only text
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "0aad7da77d2ed59c396c99a74e49f3a4524dcdbcb5163251b1433d640247aeb4"

[Killed] ConditionalExpression
src/hash.ts:19:7
 declare const window: { crypto?: { subtle?: SubtleCryptoLike } } | undefined;
 
 export async function calculateHash(text: string): Promise<string> {
-  if (!text || text.trim().length === 0) {
+  if (true) {
     throw new Error("Text cannot be empty");
   }
killedBy: hash calculateHash (async) should calculate SHA-256 hash
statusReason: Error: Text cannot be empty

[Killed] EqualityOperator
src/hash.ts:24:7
   }
 
   // Browser environment
-  if (typeof window !== "undefined" && window?.crypto?.subtle) {
+  if (typeof window === "undefined" && window?.crypto?.subtle) {
     const encoder = new TextEncoder();
     const data = encoder.encode(text);
killedBy: hash calculateHash (async) should calculate SHA-256 hash
statusReason: ReferenceError: window is not defined

[Killed] ConditionalExpression
src/hash.ts:24:7
   }
 
   // Browser environment
-  if (typeof window !== "undefined" && window?.crypto?.subtle) {
+  if (false) {
     const encoder = new TextEncoder();
     const data = encoder.encode(text);
killedBy: hash calculateHash browser path should use browser crypto when window.crypto.subtle available
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "SHA-256", Any<Uint8Array>

Number of calls: 0

[Killed] ArrowFunction
src/hash.ts:29:26
     const data = encoder.encode(text);
     const hashBuffer = await window.crypto.subtle.digest("SHA-256", data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));
-    return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
+    return hashArray.map(() => undefined).join("");
   }
 
killedBy: hash calculateHash browser path should use browser crypto when window.crypto.subtle available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08"
Received: ""

[Killed] StringLiteral
src/hash.ts:33:31
   }
 
   // Node.js environment
-  const crypto = await import("node:crypto");
+  const crypto = await import("");
   return crypto.createHash("sha256").update(text).digest("hex");
 }
killedBy: hash calculateHash (async) should calculate SHA-256 hash
statusReason: TypeError: crypto.createHash is not a function

[Killed] BlockStatement
src/hash.ts:41:57
  * Synchronous hash for Node.js only (for backward compatibility)
  * @deprecated Use async calculateHash() instead for ESM compatibility
  */
-export function calculateHashSync(text: string): string {
-  if (!text || text.trim().length === 0) {
-    throw new Error("Text cannot be empty");
-  }
-
-  const crypto = require("node:crypto") as typeof import("node:crypto");
-  return crypto.createHash("sha256").update(text).digest("hex");
-}
+export function calculateHashSync(text: string): string {}
 
killedBy: hash calculateHashSync should calculate SHA-256 hash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08"
Received: undefined

[Killed] BlockStatement
src/hash.ts:42:42
  * @deprecated Use async calculateHash() instead for ESM compatibility
  */
 export function calculateHashSync(text: string): string {
-  if (!text || text.trim().length === 0) {
-    throw new Error("Text cannot be empty");
-  }
+  if (!text || text.trim().length === 0) {}
 
   const crypto = require("node:crypto") as typeof import("node:crypto");
killedBy: hash calculateHashSync should throw error for empty text
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Text cannot be empty"

Received function did not throw

[Killed] BooleanLiteral
src/hash.ts:42:7
  * @deprecated Use async calculateHash() instead for ESM compatibility
  */
 export function calculateHashSync(text: string): string {
-  if (!text || text.trim().length === 0) {
+  if (text || text.trim().length === 0) {
     throw new Error("Text cannot be empty");
   }
killedBy: hash calculateHashSync should calculate SHA-256 hash
statusReason: Error: Text cannot be empty

[Killed] StringLiteral
src/hash.ts:47:28
   }
 
   const crypto = require("node:crypto") as typeof import("node:crypto");
-  return crypto.createHash("sha256").update(text).digest("hex");
+  return crypto.createHash("").update(text).digest("hex");
 }
 
killedBy: hash calculateHashSync should calculate SHA-256 hash
statusReason: Error: Digest method not supported
