[Killed] ObjectLiteral
src/logger.ts:13:46
   error(message: string, ...args: unknown[]): void;
 }
 
-const LOG_LEVELS: Record<LogLevel, number> = {
-  debug: 0,
-  info: 1,
-  warn: 2,
-  error: 3,
-};
+const LOG_LEVELS: Record<LogLevel, number> = {};
 
 function shouldLog(level: LogLevel, minLevel: LogLevel): boolean {
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] BlockStatement
src/logger.ts:20:66
   error: 3,
 };
 
-function shouldLog(level: LogLevel, minLevel: LogLevel): boolean {
-  return LOG_LEVELS[level] >= LOG_LEVELS[minLevel];
-}
+function shouldLog(level: LogLevel, minLevel: LogLevel): boolean {}
 
 function formatMessage(level: LogLevel, message: string): string {
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] EqualityOperator
src/logger.ts:21:10
 };
 
 function shouldLog(level: LogLevel, minLevel: LogLevel): boolean {
-  return LOG_LEVELS[level] >= LOG_LEVELS[minLevel];
+  return LOG_LEVELS[level] > LOG_LEVELS[minLevel];
 }
 
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] ConditionalExpression
src/logger.ts:21:10
 };
 
 function shouldLog(level: LogLevel, minLevel: LogLevel): boolean {
-  return LOG_LEVELS[level] >= LOG_LEVELS[minLevel];
+  return false;
 }
 
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] BlockStatement
src/logger.ts:24:66
   return LOG_LEVELS[level] >= LOG_LEVELS[minLevel];
 }
 
-function formatMessage(level: LogLevel, message: string): string {
-  const timestamp = new Date().toISOString();
-  return `[${timestamp}] [${level.toUpperCase()}] ${message}`;
-}
+function formatMessage(level: LogLevel, message: string): string {}
 
 export function createLogger(minLevel: LogLevel = "info"): Logger {
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"
Received: undefined

Number of calls: 1

[Killed] MethodExpression
src/logger.ts:26:29
 
 function formatMessage(level: LogLevel, message: string): string {
   const timestamp = new Date().toISOString();
-  return `[${timestamp}] [${level.toUpperCase()}] ${message}`;
+  return `[${timestamp}] [${level.toLowerCase()}] ${message}`;
 }
 
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"
Received: "[2026-02-10T19:55:26.127Z] [info] test message"

Number of calls: 1

[Killed] BlockStatement
src/logger.ts:29:67
   return `[${timestamp}] [${level.toUpperCase()}] ${message}`;
 }
 
-export function createLogger(minLevel: LogLevel = "info"): Logger {
-  return {
-    debug(message: string, ...args: unknown[]): void {
-      if (shouldLog("debug", minLevel)) {
-        console.debug(formatMessage("debug", message), ...args);
-      }
-    },
-    info(message: string, ...args: unknown[]): void {
-      if (shouldLog("info", minLevel)) {
-        console.info(formatMessage("info", message), ...args);
-      }
-    },
-    warn(message: string, ...args: unknown[]): void {
-      if (shouldLog("warn", minLevel)) {
-        console.warn(formatMessage("warn", message), ...args);
-      }
-    },
-    error(message: string, ...args: unknown[]): void {
-      if (shouldLog("error", minLevel)) {
-        console.error(formatMessage("error", message), ...args);
-      }
-    },
-  };
-}
+export function createLogger(minLevel: LogLevel = "info"): Logger {}
 
 const VALID_LOG_LEVELS: readonly LogLevel[] = [
killedBy: Index exports should export logger instance
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/logger.ts:31:54
 
 export function createLogger(minLevel: LogLevel = "info"): Logger {
   return {
-    debug(message: string, ...args: unknown[]): void {
-      if (shouldLog("debug", minLevel)) {
-        console.debug(formatMessage("debug", message), ...args);
-      }
-    },
+    debug(message: string, ...args: unknown[]): void {},
     info(message: string, ...args: unknown[]): void {
       if (shouldLog("info", minLevel)) {
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/logger.ts:32:11
 export function createLogger(minLevel: LogLevel = "info"): Logger {
   return {
     debug(message: string, ...args: unknown[]): void {
-      if (shouldLog("debug", minLevel)) {
+      if (true) {
         console.debug(formatMessage("debug", message), ...args);
       }
killedBy: logger createLogger respects minLevel - filters debug when minLevel is info
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[2026-02-10T19:55:26.241Z] [DEBUG] debug message"

[Killed] ConditionalExpression
src/logger.ts:32:11
 export function createLogger(minLevel: LogLevel = "info"): Logger {
   return {
     debug(message: string, ...args: unknown[]): void {
-      if (shouldLog("debug", minLevel)) {
+      if (false) {
         console.debug(formatMessage("debug", message), ...args);
       }
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:36:53
         console.debug(formatMessage("debug", message), ...args);
       }
     },
-    info(message: string, ...args: unknown[]): void {
-      if (shouldLog("info", minLevel)) {
-        console.info(formatMessage("info", message), ...args);
-      }
-    },
+    info(message: string, ...args: unknown[]): void {},
     warn(message: string, ...args: unknown[]): void {
       if (shouldLog("warn", minLevel)) {
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] BlockStatement
src/logger.ts:37:40
       }
     },
     info(message: string, ...args: unknown[]): void {
-      if (shouldLog("info", minLevel)) {
-        console.info(formatMessage("info", message), ...args);
-      }
+      if (shouldLog("info", minLevel)) {}
     },
     warn(message: string, ...args: unknown[]): void {
killedBy: logger createLogger logs info messages by default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[INFO] test message"

Number of calls: 0

[Killed] ConditionalExpression
src/logger.ts:37:11
       }
     },
     info(message: string, ...args: unknown[]): void {
-      if (shouldLog("info", minLevel)) {
+      if (true) {
         console.info(formatMessage("info", message), ...args);
       }
killedBy: logger createLogger only logs error when minLevel is error
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[2026-02-10T19:55:26.373Z] [INFO] info"

[Killed] BlockStatement
src/logger.ts:41:53
         console.info(formatMessage("info", message), ...args);
       }
     },
-    warn(message: string, ...args: unknown[]): void {
-      if (shouldLog("warn", minLevel)) {
-        console.warn(formatMessage("warn", message), ...args);
-      }
-    },
+    warn(message: string, ...args: unknown[]): void {},
     error(message: string, ...args: unknown[]): void {
       if (shouldLog("error", minLevel)) {
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:42:40
       }
     },
     warn(message: string, ...args: unknown[]): void {
-      if (shouldLog("warn", minLevel)) {
-        console.warn(formatMessage("warn", message), ...args);
-      }
+      if (shouldLog("warn", minLevel)) {}
     },
     error(message: string, ...args: unknown[]): void {
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/logger.ts:42:11
       }
     },
     warn(message: string, ...args: unknown[]): void {
-      if (shouldLog("warn", minLevel)) {
+      if (true) {
         console.warn(formatMessage("warn", message), ...args);
       }
killedBy: logger createLogger only logs error when minLevel is error
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[2026-02-10T19:55:26.330Z] [WARN] warn"

[Killed] StringLiteral
src/logger.ts:43:36
     },
     warn(message: string, ...args: unknown[]): void {
       if (shouldLog("warn", minLevel)) {
-        console.warn(formatMessage("warn", message), ...args);
+        console.warn(formatMessage("", message), ...args);
       }
     },
killedBy: logger log level filtering logs warn at warn level
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[WARN] warning"
Received: "[2026-02-10T19:55:26.369Z] [] warning"

Number of calls: 1

[Killed] BlockStatement
src/logger.ts:46:54
         console.warn(formatMessage("warn", message), ...args);
       }
     },
-    error(message: string, ...args: unknown[]): void {
-      if (shouldLog("error", minLevel)) {
-        console.error(formatMessage("error", message), ...args);
-      }
-    },
+    error(message: string, ...args: unknown[]): void {},
   };
 }
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/logger.ts:47:11
       }
     },
     error(message: string, ...args: unknown[]): void {
-      if (shouldLog("error", minLevel)) {
+      if (false) {
         console.error(formatMessage("error", message), ...args);
       }
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:47:41
       }
     },
     error(message: string, ...args: unknown[]): void {
-      if (shouldLog("error", minLevel)) {
-        console.error(formatMessage("error", message), ...args);
-      }
+      if (shouldLog("error", minLevel)) {}
     },
   };
killedBy: logger createLogger logs all levels when minLevel is debug
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/logger.ts:48:37
     },
     error(message: string, ...args: unknown[]): void {
       if (shouldLog("error", minLevel)) {
-        console.error(formatMessage("error", message), ...args);
+        console.error(formatMessage("", message), ...args);
       }
     },
killedBy: logger log level filtering error always logs at error level
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "[ERROR] error msg"
Received: "[2026-02-10T19:55:26.418Z] [] error msg"

Number of calls: 1

[Killed] ArrayDeclaration
src/logger.ts:54:47
   };
 }
 
-const VALID_LOG_LEVELS: readonly LogLevel[] = [
-  "debug",
-  "info",
-  "warn",
-  "error",
-];
+const VALID_LOG_LEVELS: readonly LogLevel[] = [];
 
 function isValidLogLevel(level: string): level is LogLevel {
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/logger.ts:57:3
 const VALID_LOG_LEVELS: readonly LogLevel[] = [
   "debug",
   "info",
-  "warn",
+  "",
   "error",
 ];
killedBy: logger LOG_LEVEL env detection uses warn level from env
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[2026-02-10T19:55:27.046Z] [INFO] should-not-appear"

[Killed] BlockStatement
src/logger.ts:61:60
   "error",
 ];
 
-function isValidLogLevel(level: string): level is LogLevel {
-  return VALID_LOG_LEVELS.includes(level as LogLevel);
-}
+function isValidLogLevel(level: string): level is LogLevel {}
 
 // Environment-safe log level detection
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:66:37
 }
 
 // Environment-safe log level detection
-const getLogLevel = (): LogLevel => {
-  try {
-    // Node.js environment (works in Jest and Node)
-    // eslint-disable-next-line no-restricted-globals
-    if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
-      // eslint-disable-next-line no-restricted-globals
-      const envLevel = process.env.LOG_LEVEL;
-      if (isValidLogLevel(envLevel)) {
-        return envLevel;
-      }
-    }
-  } catch {
-    // Ignore errors in environment detection
-  }
-  return "info";
-};
+const getLogLevel = (): LogLevel => {};
 
 export const logger = createLogger(getLogLevel());
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:67:7
 
 // Environment-safe log level detection
 const getLogLevel = (): LogLevel => {
-  try {
-    // Node.js environment (works in Jest and Node)
-    // eslint-disable-next-line no-restricted-globals
-    if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
-      // eslint-disable-next-line no-restricted-globals
-      const envLevel = process.env.LOG_LEVEL;
-      if (isValidLogLevel(envLevel)) {
-        return envLevel;
-      }
-    }
-  } catch {
+  try {} catch {
     // Ignore errors in environment detection
   }
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:70:67
   try {
     // Node.js environment (works in Jest and Node)
     // eslint-disable-next-line no-restricted-globals
-    if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
-      // eslint-disable-next-line no-restricted-globals
-      const envLevel = process.env.LOG_LEVEL;
-      if (isValidLogLevel(envLevel)) {
-        return envLevel;
-      }
-    }
+    if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {}
   } catch {
     // Ignore errors in environment detection
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/logger.ts:70:9
   try {
     // Node.js environment (works in Jest and Node)
     // eslint-disable-next-line no-restricted-globals
-    if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
+    if (typeof process === "undefined" && process.env?.LOG_LEVEL) {
       // eslint-disable-next-line no-restricted-globals
       const envLevel = process.env.LOG_LEVEL;
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/logger.ts:73:38
     if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
       // eslint-disable-next-line no-restricted-globals
       const envLevel = process.env.LOG_LEVEL;
-      if (isValidLogLevel(envLevel)) {
-        return envLevel;
-      }
+      if (isValidLogLevel(envLevel)) {}
     }
   } catch {
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/logger.ts:73:11
     if (typeof process !== "undefined" && process.env?.LOG_LEVEL) {
       // eslint-disable-next-line no-restricted-globals
       const envLevel = process.env.LOG_LEVEL;
-      if (isValidLogLevel(envLevel)) {
+      if (false) {
         return envLevel;
       }
killedBy: logger LOG_LEVEL env detection uses LOG_LEVEL env when set to valid level
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/logger.ts:80:10
   } catch {
     // Ignore errors in environment detection
   }
-  return "info";
+  return "";
 };
 
