[Killed] BlockStatement
src/utils.ts:8:50
  * Delays execution for the specified duration
  * @param ms - Duration in milliseconds
  */
-export function sleep(ms: number): Promise<void> {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms);
-  });
-}
+export function sleep(ms: number): Promise<void> {}
 
 /**
killedBy: utils sleep delays execution
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 45
Received:    1

[Killed] BlockStatement
src/utils.ts:9:35
  * @param ms - Duration in milliseconds
  */
 export function sleep(ms: number): Promise<void> {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms);
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: utils sleep delays execution
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/utils.ts:18:79
  * Checks if a string is non-empty (not null, undefined, or whitespace-only)
  * @param value - String to check
  */
-export function isNonEmpty(value: string | null | undefined): value is string {
-  return value !== null && value !== undefined && value.trim() !== "";
-}
+export function isNonEmpty(value: string | null | undefined): value is string {}
 
 /**
killedBy: utils — property-based tests isNonEmpty / isEmpty duality isNonEmpty and isEmpty are always complementary
statusReason: Error: Property failed after 1 tests
{ seed: 89068332, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils.ts:19:28
  * @param value - String to check
  */
 export function isNonEmpty(value: string | null | undefined): value is string {
-  return value !== null && value !== undefined && value.trim() !== "";
+  return value !== null && true && value.trim() !== "";
 }
 
killedBy: utils — property-based tests isNonEmpty / isEmpty duality isNonEmpty and isEmpty are always complementary
statusReason: Error: Property failed after 1 tests
{ seed: 1063816497, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils.ts:19:10
  * @param value - String to check
  */
 export function isNonEmpty(value: string | null | undefined): value is string {
-  return value !== null && value !== undefined && value.trim() !== "";
+  return value !== null && value !== undefined || value.trim() !== "";
 }
 
killedBy: utils — property-based tests isNonEmpty / isEmpty duality isNonEmpty and isEmpty are always complementary
statusReason: Error: Property failed after 1 tests
{ seed: 1897550889, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils.ts:26:68
  * Checks if a string is empty (null, undefined, or whitespace-only)
  * @param value - String to check
  */
-export function isEmpty(value: string | null | undefined): boolean {
-  return !isNonEmpty(value);
-}
+export function isEmpty(value: string | null | undefined): boolean {}
 
killedBy: utils — property-based tests isNonEmpty / isEmpty duality isNonEmpty and isEmpty are always complementary
statusReason: Error: Property failed after 2 tests
{ seed: 437002299, path: "1", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils.ts:27:10
  * @param value - String to check
  */
 export function isEmpty(value: string | null | undefined): boolean {
-  return !isNonEmpty(value);
+  return isNonEmpty(value);
 }
 
killedBy: utils — property-based tests isNonEmpty / isEmpty duality isNonEmpty and isEmpty are always complementary
statusReason: Error: Property failed after 1 tests
{ seed: -761158119, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
