[Killed] BlockStatement
src/handler.ts:17:5
 
 // Docker: both files in /var/task/, Dev: package.json is one level up from src/
 let version = "0.0.0";
-try {
-  version = require("./package.json").version;
-} catch {
+try {} catch {
   version = require("../package.json").version;
 }
killedBy: healthHandler should return ok status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0.0"
Received: "0.0.0"

[Killed] BlockStatement
src/handler.ts:19:9
 let version = "0.0.0";
 try {
   version = require("./package.json").version;
-} catch {
-  version = require("../package.json").version;
-}
+} catch {}
 
 // Kept in sync with @hak/shared TEXT_LIMITS.MAX_MORPHOLOGY_TEXT_LENGTH
killedBy: healthHandler should return ok status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0.0"
Received: "0.0.0"

[Killed] ConditionalExpression
src/handler.ts:50:7
 ): ParseResult<T> {
   ensureInitialized();
 
-  if (event.body === null)
+  if (true)
     return {
       success: false,
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Missing request body"

[Killed] EqualityOperator
src/handler.ts:50:7
 ): ParseResult<T> {
   ensureInitialized();
 
-  if (event.body === null)
+  if (event.body !== null)
     return {
       success: false,
killedBy: analyzeHandler should return 400 if body is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Missing request body"
Received: "Invalid JSON"

[Killed] ObjectLiteral
src/handler.ts:51:12
   ensureInitialized();
 
   if (event.body === null)
-    return {
-      success: false,
-      response: createResponse(HTTP_STATUS.BAD_REQUEST, {
-        error: "Missing request body",
-      }),
-    };
+    return {};
 
   const body = parseJsonBody(event.body);
killedBy: analyzeHandler should return 400 if body is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] EqualityOperator
src/handler.ts:60:7
 
   const body = parseJsonBody(event.body);
 
-  if (body === null)
+  if (body !== null)
     return {
       success: false,
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Invalid JSON"

[Killed] ConditionalExpression
src/handler.ts:60:7
 
   const body = parseJsonBody(event.body);
 
-  if (body === null)
+  if (true)
     return {
       success: false,
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Invalid JSON"

[Killed] ObjectLiteral
src/handler.ts:61:12
   const body = parseJsonBody(event.body);
 
   if (body === null)
-    return {
-      success: false,
-      response: createResponse(HTTP_STATUS.BAD_REQUEST, {
-        error: "Invalid JSON",
-      }),
-    };
+    return {};
 
   const fieldResult = validateField(
killedBy: analyzeHandler should return 400 for invalid JSON
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ConditionalExpression
src/handler.ts:73:7
     fieldName,
     maxLength,
   );
-  if ("error" in fieldResult)
+  if (false)
     return {
       success: false,
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/handler.ts:73:7
     fieldName,
     maxLength,
   );
-  if ("error" in fieldResult)
+  if (true)
     return {
       success: false,
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
src/handler.ts:81:21
       }),
     };
 
-  return { success: true, body: body as T, value: fieldResult.value };
+  return { success: false, body: body as T, value: fieldResult.value };
 }
 
killedBy: analyzeHandler should return stressed text on success
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:84:61
   return { success: true, body: body as T, value: fieldResult.value };
 }
 
-function handleError(error: unknown): APIGatewayProxyResult {
-  const message = error instanceof Error ? error.message : "Unknown error";
-  return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
-    error: `Processing error: ${message}`,
-  });
-}
+function handleError(error: unknown): APIGatewayProxyResult {}
 
 export async function analyzeHandler(
killedBy: analyzeHandler should return 500 on processing error
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ObjectLiteral
src/handler.ts:86:53
 
 function handleError(error: unknown): APIGatewayProxyResult {
   const message = error instanceof Error ? error.message : "Unknown error";
-  return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
-    error: `Processing error: ${message}`,
-  });
+  return createResponse(HTTP_STATUS.INTERNAL_ERROR, {});
 }
 
killedBy: analyzeHandler should return 500 on processing error
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/handler.ts:93:35
 
 export async function analyzeHandler(
   event: APIGatewayProxyEvent,
-): Promise<APIGatewayProxyResult> {
-  try {
-    const parsed = parseAndValidate<AnalyzeRequest>(
-      event,
-      "text",
-      MAX_TEXT_LENGTH,
-    );
-    if (!parsed.success) return parsed.response;
-
-    const response = await analyze(parsed.value);
-    return createResponse(HTTP_STATUS.OK, {
-      stressedText: extractStressedText(response, parsed.value),
-      originalText: parsed.value,
-    });
-  } catch (error: unknown) {
-    return handleError(error);
-  }
-}
+): Promise<APIGatewayProxyResult> {}
 
 export async function variantsHandler(
killedBy: analyzeHandler should return 400 if body is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:94:7
 export async function analyzeHandler(
   event: APIGatewayProxyEvent,
 ): Promise<APIGatewayProxyResult> {
-  try {
-    const parsed = parseAndValidate<AnalyzeRequest>(
-      event,
-      "text",
-      MAX_TEXT_LENGTH,
-    );
-    if (!parsed.success) return parsed.response;
-
-    const response = await analyze(parsed.value);
-    return createResponse(HTTP_STATUS.OK, {
-      stressedText: extractStressedText(response, parsed.value),
-      originalText: parsed.value,
-    });
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     return handleError(error);
   }
killedBy: analyzeHandler should return 400 if body is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] StringLiteral
src/handler.ts:97:7
   try {
     const parsed = parseAndValidate<AnalyzeRequest>(
       event,
-      "text",
+      "",
       MAX_TEXT_LENGTH,
     );
killedBy: analyzeHandler should return 400 if text field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'text' field"
Received string:    "Missing '' field in request body"

[Killed] BooleanLiteral
src/handler.ts:100:9
       "text",
       MAX_TEXT_LENGTH,
     );
-    if (!parsed.success) return parsed.response;
+    if (parsed.success) return parsed.response;
 
     const response = await analyze(parsed.value);
killedBy: analyzeHandler should return 400 if body is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/handler.ts:100:9
       "text",
       MAX_TEXT_LENGTH,
     );
-    if (!parsed.success) return parsed.response;
+    if (false) return parsed.response;
 
     const response = await analyze(parsed.value);
killedBy: analyzeHandler should return 400 if body is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ObjectLiteral
src/handler.ts:103:43
     if (!parsed.success) return parsed.response;
 
     const response = await analyze(parsed.value);
-    return createResponse(HTTP_STATUS.OK, {
-      stressedText: extractStressedText(response, parsed.value),
-      originalText: parsed.value,
-    });
+    return createResponse(HTTP_STATUS.OK, {});
   } catch (error: unknown) {
     return handleError(error);
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: undefined

[Killed] BlockStatement
src/handler.ts:107:28
       stressedText: extractStressedText(response, parsed.value),
       originalText: parsed.value,
     });
-  } catch (error: unknown) {
-    return handleError(error);
-  }
+  } catch (error: unknown) {}
 }
 
killedBy: analyzeHandler should return 500 on processing error
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:114:35
 
 export async function variantsHandler(
   event: APIGatewayProxyEvent,
-): Promise<APIGatewayProxyResult> {
-  try {
-    const parsed = parseAndValidate<VariantsRequest>(event, "word");
-    if (!parsed.success) return parsed.response;
-
-    const response = await analyze(parsed.value);
-    const variants = extractVariants(response, parsed.value);
-
-    if (variants.length === 0)
-      return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
-        error: "No phonetic variants found for the word",
-      });
-
-    return createResponse(HTTP_STATUS.OK, { word: parsed.value, variants });
-  } catch (error: unknown) {
-    return handleError(error);
-  }
-}
+): Promise<APIGatewayProxyResult> {}
 
 export function healthHandler(): APIGatewayProxyResult {
killedBy: variantsHandler should return 400 if word field is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] BlockStatement
src/handler.ts:115:7
 export async function variantsHandler(
   event: APIGatewayProxyEvent,
 ): Promise<APIGatewayProxyResult> {
-  try {
-    const parsed = parseAndValidate<VariantsRequest>(event, "word");
-    if (!parsed.success) return parsed.response;
-
-    const response = await analyze(parsed.value);
-    const variants = extractVariants(response, parsed.value);
-
-    if (variants.length === 0)
-      return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
-        error: "No phonetic variants found for the word",
-      });
-
-    return createResponse(HTTP_STATUS.OK, { word: parsed.value, variants });
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     return handleError(error);
   }
killedBy: variantsHandler should return 400 if word field is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] StringLiteral
src/handler.ts:116:61
   event: APIGatewayProxyEvent,
 ): Promise<APIGatewayProxyResult> {
   try {
-    const parsed = parseAndValidate<VariantsRequest>(event, "word");
+    const parsed = parseAndValidate<VariantsRequest>(event, "");
     if (!parsed.success) return parsed.response;
 
killedBy: variantsHandler should return 400 if word field is missing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Missing 'word' field"
Received string:    "Missing '' field in request body"

[Killed] BooleanLiteral
src/handler.ts:117:9
 ): Promise<APIGatewayProxyResult> {
   try {
     const parsed = parseAndValidate<VariantsRequest>(event, "word");
-    if (!parsed.success) return parsed.response;
+    if (parsed.success) return parsed.response;
 
     const response = await analyze(parsed.value);
killedBy: variantsHandler should return 400 if word field is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/handler.ts:117:9
 ): Promise<APIGatewayProxyResult> {
   try {
     const parsed = parseAndValidate<VariantsRequest>(event, "word");
-    if (!parsed.success) return parsed.response;
+    if (true) return parsed.response;
 
     const response = await analyze(parsed.value);
killedBy: variantsHandler should return variants on success
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')

[Killed] ConditionalExpression
src/handler.ts:122:9
     const response = await analyze(parsed.value);
     const variants = extractVariants(response, parsed.value);
 
-    if (variants.length === 0)
+    if (false)
       return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
         error: "No phonetic variants found for the word",
killedBy: variantsHandler should return 500 if no variants found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/handler.ts:122:9
     const response = await analyze(parsed.value);
     const variants = extractVariants(response, parsed.value);
 
-    if (variants.length === 0)
+    if (true)
       return createResponse(HTTP_STATUS.INTERNAL_ERROR, {
         error: "No phonetic variants found for the word",
killedBy: variantsHandler should return variants on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] BlockStatement
src/handler.ts:128:28
       });
 
     return createResponse(HTTP_STATUS.OK, { word: parsed.value, variants });
-  } catch (error: unknown) {
-    return handleError(error);
-  }
+  } catch (error: unknown) {}
 }
 

[Killed] BlockStatement
src/handler.ts:133:56
   }
 }
 
-export function healthHandler(): APIGatewayProxyResult {
-  return createResponse(HTTP_STATUS.OK, {
-    status: "ok",
-    version,
-  });
-}
+export function healthHandler(): APIGatewayProxyResult {}
 
killedBy: healthHandler should return ok status
statusReason: TypeError: Cannot read properties of undefined (reading 'statusCode')
