[Timeout] ArrayDeclaration
src/vmetajson.ts:16:39
 }
 
 let vmetajsonProcess: ChildProcess | null = null;
-const requestQueue: QueuedRequest[] = [];
+const requestQueue: QueuedRequest[] = ["Stryker was here"];
 let currentRequest: QueuedRequest | null = null;
 let buffer = "";

[Killed] StringLiteral
src/vmetajson.ts:18:14
 let vmetajsonProcess: ChildProcess | null = null;
 const requestQueue: QueuedRequest[] = [];
 let currentRequest: QueuedRequest | null = null;
-let buffer = "";
+let buffer = "Stryker was here!";
 
 function processNextRequest(): void {
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: Failed to parse vmetajson response: Stryker was here!{"annotations":{"tokens":[]}}

[Timeout] BlockStatement
src/vmetajson.ts:20:37
 let currentRequest: QueuedRequest | null = null;
 let buffer = "";
 
-function processNextRequest(): void {
-  // Stryker disable next-line all: guard conditions are equivalent
-  if (currentRequest || requestQueue.length === 0 || !vmetajsonProcess?.stdin) {
-    return;
-  }
-
-  const next = requestQueue.shift();
-  if (!next) return;
-  currentRequest = next;
-  vmetajsonProcess.stdin.write(`${JSON.stringify(currentRequest.input)}\n`);
-}
+function processNextRequest(): void {}
 
 function completeCurrentRequest(response: VmetajsonResponse): void {

[Timeout] BooleanLiteral
src/vmetajson.ts:27:7
   }
 
   const next = requestQueue.shift();
-  if (!next) return;
+  if (next) return;
   currentRequest = next;
   vmetajsonProcess.stdin.write(`${JSON.stringify(currentRequest.input)}\n`);

[Survived] ConditionalExpression
src/vmetajson.ts:27:7
   }
 
   const next = requestQueue.shift();
-  if (!next) return;
+  if (false) return;
   currentRequest = next;
   vmetajsonProcess.stdin.write(`${JSON.stringify(currentRequest.input)}\n`);

[Killed] BlockStatement
src/vmetajson.ts:32:68
   vmetajsonProcess.stdin.write(`${JSON.stringify(currentRequest.input)}\n`);
 }
 
-function completeCurrentRequest(response: VmetajsonResponse): void {
-  if (currentRequest) {
-    clearTimeout(currentRequest.timeoutId);
-    currentRequest.resolve(response);
-    currentRequest = null;
-    processNextRequest();
-  }
-}
+function completeCurrentRequest(response: VmetajsonResponse): void {}
 
 function failCurrentRequest(error: Error): void {
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/vmetajson.ts:33:7
 }
 
 function completeCurrentRequest(response: VmetajsonResponse): void {
-  if (currentRequest) {
+  if (false) {
     clearTimeout(currentRequest.timeoutId);
     currentRequest.resolve(response);
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:33:23
 }
 
 function completeCurrentRequest(response: VmetajsonResponse): void {
-  if (currentRequest) {
-    clearTimeout(currentRequest.timeoutId);
-    currentRequest.resolve(response);
-    currentRequest = null;
-    processNextRequest();
-  }
+  if (currentRequest) {}
 }
 
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:41:49
   }
 }
 
-function failCurrentRequest(error: Error): void {
-  if (currentRequest) {
-    clearTimeout(currentRequest.timeoutId);
-    currentRequest.reject(error);
-    currentRequest = null;
-    processNextRequest();
-  }
-}
+function failCurrentRequest(error: Error): void {}
 
 export function initVmetajson(
killedBy: vmetajson analyze should handle process error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:42:23
 }
 
 function failCurrentRequest(error: Error): void {
-  if (currentRequest) {
-    clearTimeout(currentRequest.timeoutId);
-    currentRequest.reject(error);
-    currentRequest = null;
-    processNextRequest();
-  }
+  if (currentRequest) {}
 }
 
killedBy: vmetajson analyze should handle process error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/vmetajson.ts:42:7
 }
 
 function failCurrentRequest(error: Error): void {
-  if (currentRequest) {
+  if (false) {
     clearTimeout(currentRequest.timeoutId);
     currentRequest.reject(error);
killedBy: vmetajson analyze should handle process error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:54:25
   binaryPath = "./vmetajson",
   dictPath = ".",
 ): void {
-  if (vmetajsonProcess) {
-    return;
-  }
+  if (vmetajsonProcess) {}
 
   vmetajsonProcess = spawn(binaryPath, [`--path=${dictPath}`], {
killedBy: vmetajson initVmetajson should not spawn multiple processes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/vmetajson.ts:54:7
   binaryPath = "./vmetajson",
   dictPath = ".",
 ): void {
-  if (vmetajsonProcess) {
+  if (false) {
     return;
   }
killedBy: vmetajson initVmetajson should not spawn multiple processes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] AssignmentOperator
src/vmetajson.ts:69:5
 
   // Stryker disable next-line all: optional chaining is equivalent
   vmetajsonProcess.stdout?.on("data", (data: Buffer) => {
-    buffer += data.toString();
+    buffer -= data.toString();
     const lines = buffer.split("\n");
 
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: TypeError: buffer.split is not a function

[Killed] BlockStatement
src/vmetajson.ts:77:13
       const line = lines.shift();
       // Stryker disable next-line all: guard conditions are equivalent
       if (line !== undefined && line.trim() !== "" && currentRequest) {
-        try {
-          const response = JSON.parse(line) as VmetajsonResponse;
-          completeCurrentRequest(response);
-        } catch {
+        try {} catch {
           failCurrentRequest(
             new Error(
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:80:17
         try {
           const response = JSON.parse(line) as VmetajsonResponse;
           completeCurrentRequest(response);
-        } catch {
-          failCurrentRequest(
-            new Error(
-              `Failed to parse vmetajson response: ${line ?? "unknown"}`,
-            ),
-          );
-        }
+        } catch {}
       }
     }
killedBy: vmetajson analyze should handle invalid JSON response
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] LogicalOperator
src/vmetajson.ts:83:54
         } catch {
           failCurrentRequest(
             new Error(
-              `Failed to parse vmetajson response: ${line ?? "unknown"}`,
+              `Failed to parse vmetajson response: ${line && "unknown"}`,
             ),
           );

[Killed] BlockStatement
src/vmetajson.ts:93:48
     buffer = lines[0] || "";
   });
 
-  vmetajsonProcess.on("error", (err: Error) => {
-    failCurrentRequest(err);
-  });
+  vmetajsonProcess.on("error", (err: Error) => {});
 
   vmetajsonProcess.on("exit", (code: number | null) => {
killedBy: vmetajson analyze should handle process error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/vmetajson.ts:97:56
     failCurrentRequest(err);
   });
 
-  vmetajsonProcess.on("exit", (code: number | null) => {
-    failCurrentRequest(
-      new Error(`vmetajson exited with code ${String(code ?? "unknown")}`),
-    );
-    vmetajsonProcess = null;
-  });
+  vmetajsonProcess.on("exit", (code: number | null) => {});
 }
 
killedBy: vmetajson analyze should handle process exit
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
src/vmetajson.ts:99:54
 
   vmetajsonProcess.on("exit", (code: number | null) => {
     failCurrentRequest(
-      new Error(`vmetajson exited with code ${String(code ?? "unknown")}`),
+      new Error(`vmetajson exited with code ${String(code && "unknown")}`),
     );
     vmetajsonProcess = null;
killedBy: vmetajson analyze should handle process exit
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "exited with code 1"
Received message:   "vmetajson exited with code unknown"

      177 |       } else {
      178 |         stryCov_9fa48("297");
    > 179 |         failCurrentRequest(new Error(stryMutAct_9fa48("298") ? `` : (stryCov_9fa48("298"), `vmetajson exited with code ${String(stryMutAct_9fa48("299") ? code && "unknow

[Killed] BlockStatement
src/vmetajson.ts:106:26
 }
 
 export async function analyze(text: string): Promise<VmetajsonResponse> {
-  if (!vmetajsonProcess) {
-    throw new Error("vmetajson process not initialized");
-  }
+  if (!vmetajsonProcess) {}
 
   const input: VmetajsonInput = {
killedBy: vmetajson analyze should throw if not initialized
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/vmetajson.ts:106:7
 }
 
 export async function analyze(text: string): Promise<VmetajsonResponse> {
-  if (!vmetajsonProcess) {
+  if (false) {
     throw new Error("vmetajson process not initialized");
   }
killedBy: vmetajson analyze should throw if not initialized
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/vmetajson.ts:110:33
     throw new Error("vmetajson process not initialized");
   }
 
-  const input: VmetajsonInput = {
-    params: {
-      vmetajson: ["--stem", "--addphonetics"],
-    },
-    content: text,
-  };
+  const input: VmetajsonInput = {};
 
   return new Promise((resolve, reject) => {
killedBy: vmetajson analyze should send JSON input to stdin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "\"content\":\"hello\""
Received: "{}
"

Number of calls: 1

[Timeout] BlockStatement
src/vmetajson.ts:117:43
     content: text,
   };
 
-  return new Promise((resolve, reject) => {
-    // Stryker disable next-line all: env default is equivalent
-    const timeoutMs = parseInt(process.env.VMETAJSON_TIMEOUT_MS ?? "5000", 10);
-    const timeoutId = setTimeout(() => {
-      const index = requestQueue.findIndex((r) => r.timeoutId === timeoutId);
-      // Stryker disable next-line all: boundary condition is equivalent
-      if (index !== -1) {
-        requestQueue.splice(index, 1);
-        reject(new Error("vmetajson timeout"));
-        // Stryker disable next-line all: optional chaining is equivalent
-      } else if (currentRequest?.timeoutId === timeoutId) {
-        currentRequest = null;
-        reject(new Error("vmetajson timeout"));
-        processNextRequest();
-      }
-    }, timeoutMs);
-
-    requestQueue.push({ resolve, reject, input, timeoutId });
-    processNextRequest();
-  });
+  return new Promise((resolve, reject) => {});
 }
 

[Killed] BlockStatement
src/vmetajson.ts:120:40
   return new Promise((resolve, reject) => {
     // Stryker disable next-line all: env default is equivalent
     const timeoutMs = parseInt(process.env.VMETAJSON_TIMEOUT_MS ?? "5000", 10);
-    const timeoutId = setTimeout(() => {
-      const index = requestQueue.findIndex((r) => r.timeoutId === timeoutId);
-      // Stryker disable next-line all: boundary condition is equivalent
-      if (index !== -1) {
-        requestQueue.splice(index, 1);
-        reject(new Error("vmetajson timeout"));
-        // Stryker disable next-line all: optional chaining is equivalent
-      } else if (currentRequest?.timeoutId === timeoutId) {
-        currentRequest = null;
-        reject(new Error("vmetajson timeout"));
-        processNextRequest();
-      }
-    }, timeoutMs);
+    const timeoutId = setTimeout(() => {}, timeoutMs);
 
     requestQueue.push({ resolve, reject, input, timeoutId });
killedBy: vmetajson edge cases should handle timeout for queued and current requests
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/vmetajson.ts:121:51
     // Stryker disable next-line all: env default is equivalent
     const timeoutMs = parseInt(process.env.VMETAJSON_TIMEOUT_MS ?? "5000", 10);
     const timeoutId = setTimeout(() => {
-      const index = requestQueue.findIndex((r) => r.timeoutId === timeoutId);
+      const index = requestQueue.findIndex((r) => true);
       // Stryker disable next-line all: boundary condition is equivalent
       if (index !== -1) {
killedBy: vmetajson edge cases should handle timeout for queued and current requests
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/vmetajson.ts:121:51
     // Stryker disable next-line all: env default is equivalent
     const timeoutMs = parseInt(process.env.VMETAJSON_TIMEOUT_MS ?? "5000", 10);
     const timeoutId = setTimeout(() => {
-      const index = requestQueue.findIndex((r) => r.timeoutId === timeoutId);
+      const index = requestQueue.findIndex((r) => r.timeoutId !== timeoutId);
       // Stryker disable next-line all: boundary condition is equivalent
       if (index !== -1) {
killedBy: vmetajson edge cases should handle timeout for queued and current requests
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/vmetajson.ts:127:18
         requestQueue.splice(index, 1);
         reject(new Error("vmetajson timeout"));
         // Stryker disable next-line all: optional chaining is equivalent
-      } else if (currentRequest?.timeoutId === timeoutId) {
+      } else if (false) {
         currentRequest = null;
         reject(new Error("vmetajson timeout"));
killedBy: vmetajson edge cases should handle timeout for queued and current requests
statusReason: Error: vmetajson timeout

[Killed] BlockStatement
src/vmetajson.ts:127:59
         requestQueue.splice(index, 1);
         reject(new Error("vmetajson timeout"));
         // Stryker disable next-line all: optional chaining is equivalent
-      } else if (currentRequest?.timeoutId === timeoutId) {
-        currentRequest = null;
-        reject(new Error("vmetajson timeout"));
-        processNextRequest();
-      }
+      } else if (currentRequest?.timeoutId === timeoutId) {}
     }, timeoutMs);
 
killedBy: vmetajson edge cases should handle timeout for queued and current requests
statusReason: Error: vmetajson timeout

[Timeout] ObjectLiteral
src/vmetajson.ts:134:23
       }
     }, timeoutMs);
 
-    requestQueue.push({ resolve, reject, input, timeoutId });
+    requestQueue.push({});
     processNextRequest();
   });

[Timeout] BlockStatement
src/vmetajson.ts:139:40
   });
 }
 
-export function closeVmetajson(): void {
-  if (vmetajsonProcess) {
-    vmetajsonProcess.kill();
-    vmetajsonProcess = null;
-  }
-}
+export function closeVmetajson(): void {}
 
 export function isInitialized(): boolean {

[Killed] BlockStatement
src/vmetajson.ts:140:25
 }
 
 export function closeVmetajson(): void {
-  if (vmetajsonProcess) {
-    vmetajsonProcess.kill();
-    vmetajsonProcess = null;
-  }
+  if (vmetajsonProcess) {}
 }
 
killedBy: vmetajson initVmetajson should spawn vmetajson process with correct arguments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "./vmetajson", ["--path=/dict"], {"stdio": ["pipe", "pipe", "pipe"]}

Number of calls: 0

[Killed] ConditionalExpression
src/vmetajson.ts:140:7
 }
 
 export function closeVmetajson(): void {
-  if (vmetajsonProcess) {
+  if (true) {
     vmetajsonProcess.kill();
     vmetajsonProcess = null;
killedBy: vmetajson isInitialized should return false before initialization
statusReason: TypeError: Cannot read properties of null (reading 'kill')

[Killed] BlockStatement
src/vmetajson.ts:146:42
   }
 }
 
-export function isInitialized(): boolean {
-  return vmetajsonProcess !== null;
-}
+export function isInitialized(): boolean {}
 
killedBy: vmetajson isInitialized should return false before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/vmetajson.ts:147:10
 }
 
 export function isInitialized(): boolean {
-  return vmetajsonProcess !== null;
+  return true;
 }
 
killedBy: vmetajson isInitialized should return false before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/vmetajson.ts:147:10
 }
 
 export function isInitialized(): boolean {
-  return vmetajsonProcess !== null;
+  return vmetajsonProcess === null;
 }
 
killedBy: vmetajson isInitialized should return false before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
