[Killed] BlockStatement
src/parser.ts:14:11
 export function extractStressedText(
   response: VmetajsonResponse,
   originalText: string,
-): string {
-  // Stryker disable next-line all: optional chaining is equivalent
-  const tokens = response.annotations?.tokens ?? [];
-  const stressedTokens = tokens
-    .map(extractTokenText)
-    .filter((t): t is string => t !== null);
-
-  return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;
-}
+): string {}
 
 export function extractVariants(
killedBy: extractStressedText should return stressed text from valid response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: undefined

[Survived] MethodExpression
src/parser.ts:17:26
 ): string {
   // Stryker disable next-line all: optional chaining is equivalent
   const tokens = response.annotations?.tokens ?? [];
-  const stressedTokens = tokens
-    .map(extractTokenText)
-    .filter((t): t is string => t !== null);
+  const stressedTokens = tokens.map(extractTokenText);
 
   return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;

[Killed] ConditionalExpression
src/parser.ts:19:33
   const tokens = response.annotations?.tokens ?? [];
   const stressedTokens = tokens
     .map(extractTokenText)
-    .filter((t): t is string => t !== null);
+    .filter((t): t is string => false);
 
   return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;
killedBy: extractStressedText should return stressed text from valid response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "mees"

[Killed] ArrowFunction
src/parser.ts:19:13
   const tokens = response.annotations?.tokens ?? [];
   const stressedTokens = tokens
     .map(extractTokenText)
-    .filter((t): t is string => t !== null);
+    .filter(() => undefined);
 
   return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;
killedBy: extractStressedText should return stressed text from valid response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "mees"

[Killed] ConditionalExpression
src/parser.ts:21:10
     .map(extractTokenText)
     .filter((t): t is string => t !== null);
 
-  return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;
+  return false ? stressedTokens.join(" ") : originalText;
 }
 
killedBy: extractStressedText should return stressed text from valid response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "mees"

[Killed] EqualityOperator
src/parser.ts:21:10
     .map(extractTokenText)
     .filter((t): t is string => t !== null);
 
-  return stressedTokens.length > 0 ? stressedTokens.join(" ") : originalText;
+  return stressedTokens.length <= 0 ? stressedTokens.join(" ") : originalText;
 }
 
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "mees"

[Killed] BlockStatement
src/parser.ts:27:14
 export function extractVariants(
   response: VmetajsonResponse,
   word: string,
-): Variant[] {
-  // Stryker disable next-line all: optional chaining is equivalent
-  const tokens = response.annotations?.tokens ?? [];
-  const variants: Variant[] = [];
-
-  for (const tokenData of tokens) {
-    // Stryker disable next-line all: optional chaining is equivalent
-    const mrfList = tokenData.features?.mrf ?? [];
-    for (const mrfVariant of mrfList) {
-      const variant = createVariantFromMrf(mrfVariant, word);
-      if (variant && !isDuplicateVariant(variants, variant)) {
-        variants.push(variant);
-      }
-    }
-  }
-
-  return variants;
-}
+): Variant[] {}
 
killedBy: extractVariants should extract all morphological variants
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ArrayDeclaration
src/parser.ts:30:31
 ): Variant[] {
   // Stryker disable next-line all: optional chaining is equivalent
   const tokens = response.annotations?.tokens ?? [];
-  const variants: Variant[] = [];
+  const variants: Variant[] = ["Stryker was here"];
 
   for (const tokenData of tokens) {
killedBy: extractVariants should extract all morphological variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

[Killed] BlockStatement
src/parser.ts:32:35
   const tokens = response.annotations?.tokens ?? [];
   const variants: Variant[] = [];
 
-  for (const tokenData of tokens) {
-    // Stryker disable next-line all: optional chaining is equivalent
-    const mrfList = tokenData.features?.mrf ?? [];
-    for (const mrfVariant of mrfList) {
-      const variant = createVariantFromMrf(mrfVariant, word);
-      if (variant && !isDuplicateVariant(variants, variant)) {
-        variants.push(variant);
-      }
-    }
-  }
+  for (const tokenData of tokens) {}
 
   return variants;
killedBy: extractVariants should extract all morphological variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/parser.ts:35:39
   for (const tokenData of tokens) {
     // Stryker disable next-line all: optional chaining is equivalent
     const mrfList = tokenData.features?.mrf ?? [];
-    for (const mrfVariant of mrfList) {
-      const variant = createVariantFromMrf(mrfVariant, word);
-      if (variant && !isDuplicateVariant(variants, variant)) {
-        variants.push(variant);
-      }
-    }
+    for (const mrfVariant of mrfList) {}
   }
 
killedBy: extractVariants should extract all morphological variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] LogicalOperator
src/parser.ts:37:11
     const mrfList = tokenData.features?.mrf ?? [];
     for (const mrfVariant of mrfList) {
       const variant = createVariantFromMrf(mrfVariant, word);
-      if (variant && !isDuplicateVariant(variants, variant)) {
+      if (variant || !isDuplicateVariant(variants, variant)) {
         variants.push(variant);
       }
killedBy: extractVariants should avoid duplicate variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] ConditionalExpression
src/parser.ts:37:11
     const mrfList = tokenData.features?.mrf ?? [];
     for (const mrfVariant of mrfList) {
       const variant = createVariantFromMrf(mrfVariant, word);
-      if (variant && !isDuplicateVariant(variants, variant)) {
+      if (true) {
         variants.push(variant);
       }
killedBy: extractVariants should avoid duplicate variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
