[Killed] StringLiteral
src/description-builder.ts:2:6
 const POS_MAP: Record<string, string> = {
-  S: "nimisõna",
+  S: "",
   V: "tegusõna",
   A: "omadussõna",
killedBy: extractVariants should generate description with POS translation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "nimisõna"
Received string:    "sg n"

[Killed] BlockStatement
src/description-builder.ts:13:65
   Y: "lühend",
 };
 
-function isLemmaDifferent(lemma: string, word: string): boolean {
-  return lemma !== "" && lemma.toLowerCase() !== word.toLowerCase();
-}
+function isLemmaDifferent(lemma: string, word: string): boolean {}
 
 function addLemmaPart(parts: string[], lemma: string, word: string): void {
killedBy: extractVariants should include lemma in description if different from word
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "lemma: mees"
Received string:    "nimisõna, sg p"

[Killed] LogicalOperator
src/description-builder.ts:14:10
 };
 
 function isLemmaDifferent(lemma: string, word: string): boolean {
-  return lemma !== "" && lemma.toLowerCase() !== word.toLowerCase();
+  return lemma !== "" || lemma.toLowerCase() !== word.toLowerCase();
 }
 
killedBy: buildDescription should map POS S to nimisõna
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nimisõna"
Received: "lemma: word, nimisõna"

[Killed] MethodExpression
src/description-builder.ts:14:26
 };
 
 function isLemmaDifferent(lemma: string, word: string): boolean {
-  return lemma !== "" && lemma.toLowerCase() !== word.toLowerCase();
+  return lemma !== "" && lemma.toUpperCase() !== word.toLowerCase();
 }
 
killedBy: buildDescription should map POS S to nimisõna
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nimisõna"
Received: "lemma: word, nimisõna"

[Killed] BlockStatement
src/description-builder.ts:17:75
   return lemma !== "" && lemma.toLowerCase() !== word.toLowerCase();
 }
 
-function addLemmaPart(parts: string[], lemma: string, word: string): void {
-  if (isLemmaDifferent(lemma, word)) parts.push(`lemma: ${lemma}`);
-}
+function addLemmaPart(parts: string[], lemma: string, word: string): void {}
 
 function addPosPart(parts: string[], pos: string): void {
killedBy: extractVariants should include lemma in description if different from word
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "lemma: mees"
Received string:    "nimisõna, sg p"

[Killed] ConditionalExpression
src/description-builder.ts:18:7
 }
 
 function addLemmaPart(parts: string[], lemma: string, word: string): void {
-  if (isLemmaDifferent(lemma, word)) parts.push(`lemma: ${lemma}`);
+  if (true) parts.push(`lemma: ${lemma}`);
 }
 
killedBy: buildDescription should map POS S to nimisõna
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nimisõna"
Received: "lemma: word, nimisõna"

[Killed] ConditionalExpression
src/description-builder.ts:18:7
 }
 
 function addLemmaPart(parts: string[], lemma: string, word: string): void {
-  if (isLemmaDifferent(lemma, word)) parts.push(`lemma: ${lemma}`);
+  if (false) parts.push(`lemma: ${lemma}`);
 }
 
killedBy: extractVariants should include lemma in description if different from word
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "lemma: mees"
Received string:    "nimisõna, sg p"

[Killed] BlockStatement
src/description-builder.ts:21:57
   if (isLemmaDifferent(lemma, word)) parts.push(`lemma: ${lemma}`);
 }
 
-function addPosPart(parts: string[], pos: string): void {
-  if (pos && POS_MAP[pos]) parts.push(POS_MAP[pos]);
-}
+function addPosPart(parts: string[], pos: string): void {}
 
 export function buildDescription(
killedBy: extractVariants should generate description with POS translation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "nimisõna"
Received string:    "sg n"

[Killed] LogicalOperator
src/description-builder.ts:22:7
 }
 
 function addPosPart(parts: string[], pos: string): void {
-  if (pos && POS_MAP[pos]) parts.push(POS_MAP[pos]);
+  if (pos || POS_MAP[pos]) parts.push(POS_MAP[pos]);
 }
 
killedBy: buildDescription should handle unknown POS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tavaline"
Received: ""

[Killed] ConditionalExpression
src/description-builder.ts:22:7
 }
 
 function addPosPart(parts: string[], pos: string): void {
-  if (pos && POS_MAP[pos]) parts.push(POS_MAP[pos]);
+  if (false) parts.push(POS_MAP[pos]);
 }
 
killedBy: extractVariants should generate description with POS translation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "nimisõna"
Received string:    "sg n"

[Killed] BlockStatement
src/description-builder.ts:30:11
   pos: string,
   fs: string,
   word: string,
-): string {
-  const parts: string[] = [];
-  addLemmaPart(parts, lemma, word);
-  addPosPart(parts, pos);
-  if (fs) parts.push(fs);
-  return parts.length > 0 ? parts.join(", ") : "tavaline";
-}
+): string {}
 
killedBy: extractVariants should generate description with POS translation
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArrayDeclaration
src/description-builder.ts:31:27
   fs: string,
   word: string,
 ): string {
-  const parts: string[] = [];
+  const parts: string[] = ["Stryker was here"];
   addLemmaPart(parts, lemma, word);
   addPosPart(parts, pos);
killedBy: buildDescription should map POS S to nimisõna
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nimisõna"
Received: "Stryker was here, nimisõna"

[Killed] ConditionalExpression
src/description-builder.ts:34:7
   const parts: string[] = [];
   addLemmaPart(parts, lemma, word);
   addPosPart(parts, pos);
-  if (fs) parts.push(fs);
+  if (true) parts.push(fs);
   return parts.length > 0 ? parts.join(", ") : "tavaline";
 }
killedBy: buildDescription should map POS S to nimisõna
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nimisõna"
Received: "nimisõna, "

[Killed] ConditionalExpression
src/description-builder.ts:34:7
   const parts: string[] = [];
   addLemmaPart(parts, lemma, word);
   addPosPart(parts, pos);
-  if (fs) parts.push(fs);
+  if (false) parts.push(fs);
   return parts.length > 0 ? parts.join(", ") : "tavaline";
 }
killedBy: buildDescription should include fs when provided
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "sg n"
Received string:    "nimisõna"

[Killed] ConditionalExpression
src/description-builder.ts:35:10
   addLemmaPart(parts, lemma, word);
   addPosPart(parts, pos);
   if (fs) parts.push(fs);
-  return parts.length > 0 ? parts.join(", ") : "tavaline";
+  return false ? parts.join(", ") : "tavaline";
 }
 
killedBy: extractVariants should generate description with POS translation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "nimisõna"
Received string:    "tavaline"

[Killed] EqualityOperator
src/description-builder.ts:35:10
   addLemmaPart(parts, lemma, word);
   addPosPart(parts, pos);
   if (fs) parts.push(fs);
-  return parts.length > 0 ? parts.join(", ") : "tavaline";
+  return parts.length >= 0 ? parts.join(", ") : "tavaline";
 }
 
killedBy: buildDescription should return 'tavaline' when no parts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tavaline"
Received: ""
