[Killed] BlockStatement
src/parser-helpers.ts:9:74
 
 export { buildDescription };
 
-export function formatPhoneticText(stem: string, ending: string): string {
-  return ending && ending !== "0" ? `${stem}+${ending}` : stem;
-}
+export function formatPhoneticText(stem: string, ending: string): string {}
 
 function getFirstMrfStem(
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: ""

[Killed] ConditionalExpression
src/parser-helpers.ts:10:20
 export { buildDescription };
 
 export function formatPhoneticText(stem: string, ending: string): string {
-  return ending && ending !== "0" ? `${stem}+${ending}` : stem;
+  return ending && true ? `${stem}+${ending}` : stem;
 }
 
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "m<ees+0"

[Killed] EqualityOperator
src/parser-helpers.ts:10:20
 export { buildDescription };
 
 export function formatPhoneticText(stem: string, ending: string): string {
-  return ending && ending !== "0" ? `${stem}+${ending}` : stem;
+  return ending && ending === "0" ? `${stem}+${ending}` : stem;
 }
 
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "m<ees+0"

[Killed] BlockStatement
src/parser-helpers.ts:15:44
 
 function getFirstMrfStem(
   mrf: { stem?: string; ending?: string }[] | undefined,
-): { stem: string; ending: string } | null {
-  if (mrf == null || mrf.length === 0 || mrf[0].stem == null) return null;
-
-  return { stem: mrf[0].stem, ending: mrf[0].ending ?? "" };
-}
+): { stem: string; ending: string } | null {}
 
 export function extractTokenText(tokenData: {
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: "mees"

[Killed] ConditionalExpression
src/parser-helpers.ts:16:7
 function getFirstMrfStem(
   mrf: { stem?: string; ending?: string }[] | undefined,
 ): { stem: string; ending: string } | null {
-  if (mrf == null || mrf.length === 0 || mrf[0].stem == null) return null;
+  if (false) return null;
 
   return { stem: mrf[0].stem, ending: mrf[0].ending ?? "" };
killedBy: extractStressedText should fallback to original token if no stem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "xyz"
Received: ""

[Killed] ConditionalExpression
src/parser-helpers.ts:16:7
 function getFirstMrfStem(
   mrf: { stem?: string; ending?: string }[] | undefined,
 ): { stem: string; ending: string } | null {
-  if (mrf == null || mrf.length === 0 || mrf[0].stem == null) return null;
+  if (false || mrf[0].stem == null) return null;
 
   return { stem: mrf[0].stem, ending: mrf[0].ending ?? "" };
killedBy: extractVariants should handle empty mrf array
statusReason: TypeError: Cannot read properties of undefined (reading 'stem')

[Killed] LogicalOperator
src/parser-helpers.ts:18:39
 ): { stem: string; ending: string } | null {
   if (mrf == null || mrf.length === 0 || mrf[0].stem == null) return null;
 
-  return { stem: mrf[0].stem, ending: mrf[0].ending ?? "" };
+  return { stem: mrf[0].stem, ending: mrf[0].ending && "" };
 }
 
killedBy: extractStressedText should combine stem and ending with + separator
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "p<ee+ti"
Received: "p<ee"

[Killed] ObjectLiteral
src/parser-helpers.ts:18:10
 ): { stem: string; ending: string } | null {
   if (mrf == null || mrf.length === 0 || mrf[0].stem == null) return null;
 
-  return { stem: mrf[0].stem, ending: mrf[0].ending ?? "" };
+  return {};
 }
 
killedBy: analyzeHandler should return stressed text on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: ""

[Killed] BlockStatement
src/parser-helpers.ts:23:19
 
 export function extractTokenText(tokenData: {
   features?: { mrf?: { stem?: string; ending?: string }[]; token?: string };
-}): string | null {
-  const first = getFirstMrfStem(tokenData.features?.mrf);
-  if (first) return formatPhoneticText(first.stem, first.ending);
-
-  return tokenData.features?.token ?? null;
-}
+}): string | null {}
 
 export function createVariantFromMrf(
killedBy: extractStressedText should return stressed text from valid response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "m<ees"
Received: ""

[Survived] OptionalChaining
src/parser-helpers.ts:24:33
 export function extractTokenText(tokenData: {
   features?: { mrf?: { stem?: string; ending?: string }[]; token?: string };
 }): string | null {
-  const first = getFirstMrfStem(tokenData.features?.mrf);
+  const first = getFirstMrfStem(tokenData.features.mrf);
   if (first) return formatPhoneticText(first.stem, first.ending);
 

[Killed] ConditionalExpression
src/parser-helpers.ts:25:7
   features?: { mrf?: { stem?: string; ending?: string }[]; token?: string };
 }): string | null {
   const first = getFirstMrfStem(tokenData.features?.mrf);
-  if (first) return formatPhoneticText(first.stem, first.ending);
+  if (true) return formatPhoneticText(first.stem, first.ending);
 
   return tokenData.features?.token ?? null;
killedBy: extractStressedText should fallback to original token if no stem
statusReason: TypeError: Cannot read properties of null (reading 'stem')

[Killed] ConditionalExpression
src/parser-helpers.ts:25:7
   features?: { mrf?: { stem?: string; ending?: string }[]; token?: string };
 }): string | null {
   const first = getFirstMrfStem(tokenData.features?.mrf);
-  if (first) return formatPhoneticText(first.stem, first.ending);
+  if (false) return formatPhoneticText(first.stem, first.ending);
 
   return tokenData.features?.token ?? null;
killedBy: parser-helpers extractTokenText should extract formatted text from mrf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "maja+s"
Received: null

[Killed] LogicalOperator
src/parser-helpers.ts:27:10
   const first = getFirstMrfStem(tokenData.features?.mrf);
   if (first) return formatPhoneticText(first.stem, first.ending);
 
-  return tokenData.features?.token ?? null;
+  return tokenData.features?.token && null;
 }
 
killedBy: parser-helpers extractTokenText should return null for empty mrf array
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Survived] OptionalChaining
src/parser-helpers.ts:27:10
   const first = getFirstMrfStem(tokenData.features?.mrf);
   if (first) return formatPhoneticText(first.stem, first.ending);
 
-  return tokenData.features?.token ?? null;
+  return tokenData.features.token ?? null;
 }
 

[Killed] BlockStatement
src/parser-helpers.ts:39:19
     fs?: string;
   },
   word: string,
-): Variant | null {
-  if (mrfVariant.stem == null) return null;
-
-  const { stem, ending = "", pos = "", lemma = "", fs = "" } = mrfVariant;
-  const text = formatPhoneticText(stem, ending);
-  const description = buildDescription(lemma, pos, fs, word);
-
-  return {
-    text,
-    description,
-    morphology: { lemma, pos, fs, stem, ending } as MorphologyInfo,
-  };
-}
+): Variant | null {}
 
 export function isDuplicateVariant(
killedBy: parser-helpers createVariantFromMrf should create variant from mrf data
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/parser-helpers.ts:40:7
   },
   word: string,
 ): Variant | null {
-  if (mrfVariant.stem == null) return null;
+  if (false) return null;
 
   const { stem, ending = "", pos = "", lemma = "", fs = "" } = mrfVariant;
killedBy: parser-helpers createVariantFromMrf should return null when stem is missing
statusReason: Error: expect(received).toBeNull()

Received: {"description": "tavaline", "morphology": {"ending": "s", "fs": "", "lemma": "", "pos": "", "stem": undefined}, "text": "undefined+s"}

[Killed] ConditionalExpression
src/parser-helpers.ts:40:7
   },
   word: string,
 ): Variant | null {
-  if (mrfVariant.stem == null) return null;
+  if (true) return null;
 
   const { stem, ending = "", pos = "", lemma = "", fs = "" } = mrfVariant;
killedBy: extractVariants should extract all morphological variants
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Survived] StringLiteral
src/parser-helpers.ts:42:36
 ): Variant | null {
   if (mrfVariant.stem == null) return null;
 
-  const { stem, ending = "", pos = "", lemma = "", fs = "" } = mrfVariant;
+  const { stem, ending = "", pos = "Stryker was here!", lemma = "", fs = "" } = mrfVariant;
   const text = formatPhoneticText(stem, ending);
   const description = buildDescription(lemma, pos, fs, word);

[Killed] BlockStatement
src/parser-helpers.ts:56:12
 export function isDuplicateVariant(
   variants: Variant[],
   candidate: Variant,
-): boolean {
-  return variants.some(
-    (v) => v.text === candidate.text && v.description === candidate.description,
-  );
-}
+): boolean {}
 
killedBy: parser-helpers isDuplicateVariant should return true for duplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] MethodExpression
src/parser-helpers.ts:57:10
   variants: Variant[],
   candidate: Variant,
 ): boolean {
-  return variants.some(
-    (v) => v.text === candidate.text && v.description === candidate.description,
-  );
+  return variants.every(v => v.text === candidate.text && v.description === candidate.description);
 }
 
killedBy: parser-helpers isDuplicateVariant should return false for empty variants array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/parser-helpers.ts:58:12
   candidate: Variant,
 ): boolean {
   return variants.some(
-    (v) => v.text === candidate.text && v.description === candidate.description,
+    (v) => v.text === candidate.text || v.description === candidate.description,
   );
 }
killedBy: parser-helpers isDuplicateVariant should return false for different text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/parser-helpers.ts:58:41
   candidate: Variant,
 ): boolean {
   return variants.some(
-    (v) => v.text === candidate.text && v.description === candidate.description,
+    (v) => v.text === candidate.text && true,
   );
 }
killedBy: parser-helpers isDuplicateVariant should return false for different description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
